{"ns:m.03bn_2":{"ns:common.topic.description":["JRT is an implementation of the Pascal programming language. It was available in the early 1980s on the CP/M operating system.\\nAt the end of the 1970s, the most popular Pascal implementation for microcomputers was UCSD Pascal, which many people considered overpriced at hundreds of dollars. The original basis for UCSD Pascal was the p-machine compiler from ETH Zurich, the originators of Pascal. JRT was a Pascal interpreter that compiled to its own pseudocode separate from UCSD Pascal p-code. It was written by Jim Russell Tyson, who sold it cheaply, reducing the price from $295.00 to $29.95.\\nIn the early 1980s various organizations developed compilers for USCD Pascal on microcomputers. UCSD's developers announced that they were working on a native\\\" compiler that would essentially would convert UCSD from an interpreter to a compiled, native system in one step. JRT was able to get considerable attention for several months by being a much cheaper alternative to UCSD Pascal. This lasted less than a year, as the Borland project began selling. However, JRT was very important in that it established a low price precedent for a Pascal implementation."],"rdfs:label":["JRT"],"key:en":["jrt"],"ns:common.topic.article":[{"ns:common.document.text":["JRT (Jim Russell Tyson) is an implementation of the Pascal programming language. It was available in the early 1980s on the CP/M operating system.\\nAt the end of the 1970s, the most popular Pascal implementation for microcomputers was UCSD Pascal, which many people considered overpriced at hundreds of dollars. The original basis for UCSD Pascal was the p-machine compiler from ETH Zurich the originators of Pascal. JRT was a Pascal interpreter, that compiled down to its own pseudo-code totally separate from UCSD Pascal p-code. It was written by Jim Russell Tyson who had the idea that if he dropped the price he'd sell more copies. He sold it cheaply, reducing the price from $295.00 to $29.95, and it was a wild success. Too wild as it turned out. Orders far surpassed JRT's ability to produce product and the company eventually filed for bankruptcy in November 1983 with many cancelled orders and unable to meet the still high demand. The product eventually continued through a version 4 priced at $69.95 and along with a Modula-2 at $99.95 may have been successful had not Turbo Pascal shown up for about the same price. Turbo Pascal was a true compiler with an IDE as well as a business model"],"ns:common.document.source_uri":["<http://wp/en/779155>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["JRT"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258177b0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}