{"ns:m.070s08":{"ns:common.topic.description":["Compact Application Solution Language is a programming language used to create computer programs for Palm OS, and Microsoft Windows desktops, laptops, and Pocket PCs with Windows Mobile. It is published by WAGWARE Systems, Inc., and Brainyware, LLC.\\nAs a language, CASL is similar to Pascal or Visual Basic with object-oriented programming features. The CASL software development kit includes a graphical user interface forms editor, an integrated development environment, and a compiler. CASL programs can either be run as interpreted applications on target devices, or compiled directly to native code. One of CASL's key features is that the same source can be compiled to Palm OS, Windows, or Pocket PC with Windows Mobile, without changing the code, termed \\\"write once, run all\\\".\\nIn July 2005, CASLsoft announced they were discontinuing support for CASL and releasing it as freeware, with version 4.2 as the last official release. A month later, WAGWARE Systems, Inc. and Brainyware, LLC announced the purchase of CASL, updated the product and continue to release it as commercial software. CASL Version 4.3 was released on 3 July 2006."],"rdfs:label":["Compact Application Solution Language"],"key:en":["compact_application_solution_language"],"ns:common.topic.article":[{"ns:common.document.text":["Compact Application Solution Language (CASL) is a programming language used to create computer programs for Palm OS, and Microsoft Windows desktops, laptops, and Pocket PCs with Windows Mobile. It is published by WAGWARE Systems, Inc., and Brainyware, LLC.\\nAs a language, CASL is similar to Pascal or Visual Basic with object-oriented programming features. The CASL software development kit (SDK) includes a graphical user interface (GUI) forms editor, an integrated development environment (IDE), and a compiler. CASL programs can either be run as interpreted applications on target devices (using a small helper binary), or compiled directly to native code (CASLpro). One of CASL's key features is that the same source can be compiled to PalmOS, Windows, or Pocket PC with Windows Mobile, without changing the code, termed \\\"write once, run all\\\".\\nIn July 2005, CASLsoft announced they were discontinuing support for CASL and releasing it as freeware, with version 4.2 as the last official release. A month later, WAGWARE Systems, Inc. and Brainyware, LLC announced the purchase of CASL, updated the product and continue to release it as commercial software. CASL Version 4.3 was released on 3 July"],"ns:common.document.source_uri":["<http://wp/en/2283274>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Compact Application Solution Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258sfc0s"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}