{"ns:m.07lwvb":{"ns:common.topic.description":["In the semiconductor and electronic design industry, SystemVerilog is a combined hardware description language and hardware verification language based on extensions to Verilog."],"rdfs:label":["SystemVerilog"],"key:en":["systemverilog"],"ns:common.topic.article":[{"ns:common.document.text":["In the semiconductor and electronic design industry, SystemVerilog is a combined Hardware Description Language and Hardware Verification Language based on extensions to Verilog.\\nSystemVerilog started with the donation of the Superlog language to Accellera in 2002. The bulk of the verification functionality is based on the OpenVera language donated by Synopsys. In 2005, SystemVerilog was adopted as IEEE Standard 1800-2005. In 2009, the standard was merged with the base Verilog (IEEE 1364-2005) standard, creating IEEE Standard 1800-2009, the current version.\\nThe feature-set of SystemVerilog can be divided into two distinct roles:\\nThe remainder of this article discusses the features of SystemVerilog not present in Verilog-2005.\\nEnhanced variable types add new capability to Verilog's \\\"reg\\\" type:\\nVerilog-1995 and -2001 limit reg variables to behavioral statements such as RTL code. SystemVerilog extends the reg type so it can be driven by a single driver such as gate or module. SystemVerilog names this type \\\"logic\\\" to remind users that it has this extra capability and is not a hardware register. The names \\\"logic\\\" and \\\"reg\\\" are interchangeable. A signal with more than one driver needs to"],"ns:common.document.source_uri":["<http://wp/en/2540686>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["SystemVerilog"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1q5j50v1z"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:computer.programming_language.influenced_by":["ns:m.0h3vb"]}}