{"ns:m.03sktd":{"ns:common.topic.description":["NPL was a functional programming language with pattern matching designed by Rod Burstall and John Darlington in 1977. The language allowed certain sets and logic constructs to appear on the right hand side of definitions, E.g.\\nThe NPL interpreter evaluates the list of generators from left to right so conditions can mention any bound variables that occur to their left. These were known as set comprehensions. NPL eventually evolved into Hope but lost set comprehensions, which made a reappearance in the form of list comprehensions in later functional languages."],"rdfs:label":["NPL"],"key:en":["npl_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["NPL was a functional language with pattern matching designed by Rod Burstall and John Darlington in 1977. The language allowed certain sets and logic constructs to appear on the right hand side of definitions, E.g.\\nThe NPL interpreter evaluates the list of generators from left to right so conditions can mention any bound variables that occur to their left. These were known as set comprehensions. NPL eventually evolved into Hope but lost set comprehensions, which made a reappearance in the form of list comprehensions in later functional languages.\\nReference: John Darlington, \\\"Program Transformation and Synthesis: Present Capabilities\\\", Research Report No. 77/43, Dept. of Computing and Control, Imperial College of Science and Technology, London September 1977.\\nThis article was originally based on material from the Free On-line Dictionary of Computing, which is licensed under the GFDL."],"ns:common.document.source_uri":["<http://wp/en/948982>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["NPL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cpy_vz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.02ykw"]}}