{"ns:m.04zsm":{"ns:common.topic.description":["Mercury is a functional logic programming language geared towards real-world applications. It was initially developed at the University Of Melbourne Computer Science department under the supervision of Zoltan Somogyi. The first version was developed by Fergus Henderson, Thomas Conway and Zoltan Somogyi and was released on April 8, 1995.\\nMercury is a purely declarative logic language. It is related to both Prolog and Haskell. It features a strong, static, polymorphic type system, as well as a strong mode and determinism system.\\nThe official implementation, the Melbourne Mercury Compiler, is available for most Unix platforms, including Mac OS X, as well as for Microsoft Windows."],"rdfs:label":["Mercury"],"ns:common.topic.official_website":["<http://www.cs.mu.oz.au/research/mercury/>"],"ns:common.topic.topical_webpage":["<http://www.mercury.csse.unimelb.edu.au/>"],"ns:computer.programming_language.developers":["Zoltan Somogyi"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0blrvnc"],"ns:common.webpage.uri":["<http://www.mercury.csse.unimelb.edu.au/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.04zsm"]}],"ns:common.topic.article":[{"ns:common.document.text":["Mercury is a functional logic programming language geared towards real-world applications. It is developed at the University Of Melbourne Computer Science department under the supervision of Zoltan Somogyi. The first version was developed by Fergus Henderson, Thomas Conway and Zoltan Somogyi and was released on April 8, 1995.\\nMercury is a purely declarative logic language. It is related to both Prolog and Haskell. It features a strong, static, polymorphic type system, as well as a strong mode and determinism system.\\nThe official implementation, the Melbourne Mercury Compiler, is available for most Unix platforms, including Mac OS X, as well as for Microsoft Windows (in Windows, it requires one of the Cygwin or MinGW toolsets, and can be compiled either with GCC or Microsoft Visual C++).\\nMercury is based on the logic programming language Prolog. It has the same syntax, and the same basic concepts such as the SLD resolution algorithm. It can ostensibly be viewed as a pure subset of Prolog with strong types and modes. As such, it is often compared to its predecessor, both in terms of features, and run-time efficiency.\\nThe language is designed with software engineering principles in"],"ns:common.document.source_uri":["<http://wp/en/19726>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1995-04-08"],"ns:type.object.name":["Mercury"],"rdf:type":["ns:user.skud.names.topic"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cqf05y"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.05vpz"],"ns:symbols.namesake.named_after":["ns:m.09bd3"]}}