{"ns:m.02wz500":{"ns:common.topic.description":["Sawzall is a procedural domain-specific programming language, used by Google to process large numbers of individual log records. Sawzall was first described in 2003, and the szl runtime was open-sourced in August 2010. However, since the MapReduce table aggregators have not been released, the open-sourced runtime is not useful for large-scale data analysis off the shelf."],"rdfs:label":["Sawzall"],"key:en":["sawzall"],"ns:common.topic.article":[{"ns:common.document.text":["Sawzall is a procedural domain-specific programming language, used by Google to process large numbers of individual log records. Sawzall was first described in 2003, and the szl runtime was open-sourced in August 2010. However, since the MapReduce table aggregators have not been released, the open-sourced runtime is not useful for large-scale data analysis off-the-shelf.\\nGoogle's server logs are stored as large collections of records (protocol buffers) that are partitioned over many disks within GFS. In order to perform calculations involving the logs, engineers can write MapReduce programs in C++ or Java. MapReduce programs need to be compiled and may be more verbose than necessary, so writing a program to analyze the logs can be time-consuming. To make it easier to write quick scripts, Rob Pike et al. developed the Sawzall language. A Sawzall script runs within the Map phase of a MapReduce and \\\"emits\\\" values to tables. Then the Reduce phase (which the script writer does not have to be concerned about) aggregates the tables from multiple runs into a single set of tables.\\nCurrently, only the language runtime (which runs a Sawzall script once over a single input) has been"],"ns:common.document.source_uri":["<http://wp/en/12640293>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Sawzall"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125ck6xbr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}