{"ns:m.09wm62":{"key:authority.google.google_plus_page":["105982199697308008192"],"ns:common.topic.description":["AIMMS is a software system designed for modeling and solving large-scale optimization and scheduling-type problems. It consists of an algebraic modeling language, an integrated development environment for both editing models and creating a graphical user interface around these models, and a graphical end-user environment. AIMMS is linked to multiple solvers through the AIMMS Open Solver Interface, not to be confused with COIN-OR Open Solver Interface which unlike AIMMS OSI is an open-source project. Supported solvers include CPLEX, Gurobi, MOSEK, CBC, Conopt, MINOS, IPOPT, SNOPT, KNITRO and CP Optimizer.\\nAIMMS is considered to be one of the five most important algebraic modeling languages, and the creator has been awarded with INFORMS Impact Prize for his work in this language."],"rdfs:label":["AIMMS"],"key:en":["aimms"],"ns:common.topic.social_media_presence":["<http://plus.google.com/105982199697308008192>"],"ns:common.topic.official_website":["<http://www.aimms.com/>"],"ns:computer.programming_language.language_designers":["Marcel Roelofs"],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.aimms.com>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkm362"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.09wm62"]}],"ns:common.topic.article":[{"ns:common.document.text":["AIMMS (an acronym for \\\"Advanced Interactive Multidimensional Modeling System\\\") is a software system designed for modeling and solving large-scale optimization and scheduling-type problems. It consists of an algebraic modeling language, an integrated development environment for both editing models and creating a graphical user interface around these models, and a graphical end-user environment. AIMMS is linked to multiple solvers through the AIMMS Open Solver Interface. Supported solvers include CPLEX, Gurobi, MOSEK, CBC, Conopt, MINOS, IPOPT, SNOPT and KNITRO.\\nAIMMS features a mixture of declarative and imperative programming styles. Formulation of optimization models takes place through declarative language elements such as sets and indices, as well as scalar and multidimensional parameters, variables and constraints, which are common to all algebraic modeling languages, and allow for a concise description of most problems in the domain of mathematical optimization. Units of measurement are natively supported in the language, and compile- and runtime unit analysis may be employed to detect modeling errors.\\nProcedures and control flow statements are available in AIMMS for\\nTo"],"ns:common.document.source_uri":["<http://wp/en/31460418>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1993"],"ns:type.object.name":["AIMMS"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dz2mwh"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}