{"ns:m.03wxr":{"rdfs:label":["INTERCAL"],"ns:common.topic.description":["The Compiler Language With No Pronounceable Acronym, abbreviated INTERCAL, is an esoteric programming language that was created as a parody by Don Woods and James M. Lyon, two Princeton University students, in 1972. It satirizes aspects of the various programming languages at the time, as well as the proliferation of proposed language constructs and notations in the 1960s.\\nThere are two currently maintained versions of INTERCAL: C-INTERCAL, maintained by Eric S. Raymond, and CLC-INTERCAL, maintained by Claudio Calvelli."],"key:en":["intercal"],"ns:common.topic.image":[{"ns:type.content.length":["56059"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Dicklyon"],"rdfs:label":["Jimbo Lyon"],"ns:type.content.blob_id":["b53bed14686e3a9bc1342840204fbddeaae175fdbc8c7d517b213adeab3e465b"],"ns:common.licensed_object.provenance":["wikipedia,en,7996598"],"ns:type.content.source":["ns:m.03r_410"],"ns:common.image.size":["ns:m.02bfq1s"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["Jimbo Lyon"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.04gt03b"]}],"ns:common.topic.article":[{"ns:common.document.text":["INTERCAL is an esoteric programming language that was created as a parody by Don Woods and James M. Lyon, two Princeton University students, in 1972. It satirizes aspects of the various programming languages at the time, as well as the proliferation of proposed language constructs and notations in the 1960s.\\nThere are two currently maintained versions of INTERCAL: C-INTERCAL, formerly maintained by Eric S. Raymond, and CLC-INTERCAL, maintained by Claudio Calvelli.\\nAccording to the original manual by the authors,\\nThe original Princeton implementation used punched cards and the EBCDIC character set. To allow INTERCAL to run on computers using ASCII, substitutions for two characters had to be made: $ substituted for ¢ as the mingle operator, \\\"represent[ing] the increasing cost of software in relation to hardware\\\", and ? was substituted for ∀ as the unary exclusive-or operator to \\\"correctly express the average person's reaction on first encountering exclusive-or\\\". In recent versions of C-INTERCAL, the older operators are supported as alternatives; INTERCAL programs may now be encoded in ASCII, Latin-1, UTF-8, EBCDIC, Hollerith, or Baudot.\\nINTERCAL was intended to be completely"],"ns:common.document.source_uri":["<http://wp/en/15075>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Don Woods"],"ns:computer.programming_language.introduced":["1972"],"ns:type.object.name":["INTERCAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257t91fy"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}