{"ns:m.026d5hv":{"ns:common.topic.description":["Logtalk is an object-oriented logic programming language that extends and leverages the Prolog language with a feature set suitable for programming in the large. It provides support for encapsulation and data hiding, separation of concerns and enhanced code reuse. Logtalk uses standard Prolog syntax with the addition of a few operators and directives.\\nThe Logtalk language implementation is distributed under an open source license and can run using a Prolog implementation as the back-end compiler."],"rdfs:label":["Logtalk"],"key:en":["logtalk"],"ns:common.topic.official_website":["<http://www.logtalk.org>"],"ns:common.topic.article":[{"ns:common.document.text":["Logtalk is an object-oriented logic programming language that extends the Prolog language with a feature set suitable for programming in the large. It provides support for encapsulation and data hiding, separation of concerns and enhanced code reuse. Logtalk uses standard Prolog syntax with the addition of a few operators and directives.\\nLogtalk is distributed under an open source license and can run using ISO-compliant Prolog implementations as the back-end compiler.\\nLogtalk aims to bring together the advantages of object-oriented programming and logic programming. Object-orientation emphasizes developing discrete, reusable units of software, while logic programming emphasizes representing the knowledge of each object in a declarative way.\\nAs an object-oriented programming language, Logtalk's major features include support for both classes (with optional metaclasses) and prototypes, parametric objects, protocols (interfaces), categories (mixins, aspects,hot patching), multiple inheritance, event-driven programming, high-level multi-threading programming, reflection, and automatic generation of documentation.\\nFor Prolog programmers, Logtalk provides predicate namespaces (supporting"],"ns:common.document.source_uri":["<http://wp/en/7792164>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://logtalk.org>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.026d5hv"]}],"ns:computer.programming_language.introduced":["1998"],"ns:type.object.name":["Logtalk"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258tnrc1"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.070d2"]}}