{"ns:m.02_6bj":{"rdfs:label":["bc"],"ns:common.topic.description":["bc, for basic calculator, is \\\"an arbitrary precision calculator language\\\" with syntax similar to the C programming language. bc is typically used as either a mathematical scripting language or as an interactive mathematical shell.\\nbc is often referred to as bench calculator.\\nA typical interactive usage is typing the command bc on a Unix command prompt and entering a mathematical expression, such as * 2, whereupon 8 will be output. While bc can work with arbitrary precision, it actually defaults to zero digits after the decimal point - so the expression 2/3 yields 0. This can surprise new bc users unaware of this fact. The \\\"-l\\\" option to bc sets the default scale to 20, and adds several additional mathematical functions to the language.\\nbc first appeared in Version 6 Unix in 1975, and was written by Robert Morris and Lorinda Cherry of Bell Labs. Bc was preceded by dc, an earlier arbitrary precision calculator written by the same authors. Dc could do arbitrary-precision calculations, but its reverse polish notation syntax was inconvenient for users, and therefore Bc was written as a front-end to Dc."],"key:en":["bc_programming_language"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ビーシー"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["bc, for basic calculator, is \\\"an arbitrary precision calculator language\\\" with syntax similar to the C programming language. bc is typically used as either a mathematical scripting language or as an interactive mathematical shell.\\nA typical interactive usage is typing the command bc on a Unix command prompt and entering a mathematical expression, such as (1 + 3) * 2, whereupon 8 will be output. While bc can work with arbitrary precision, it actually defaults to zero digits after the decimal point - so the expression 2/3 yields 0. This can surprise new bc users unaware of this fact. The \\\"-l\\\" option to bc sets the default scale (digits after the decimal point) to 20, and adds several additional mathematical functions to the language.\\nBc first appeared in Version 6 Unix in 1975, and was written by Robert Morris and Lorinda Cherry of Bell Labs. Bc was preceded by dc, an earlier arbitrary precision calculator written by the same authors. Dc could do arbitrary-precision calculations, but its reverse polish notation syntax was inconvenient for users, and therefore Bc was written as a front-end to Dc. Bc was a very simple compiler (a single yacc source file with a few hundred lines) which"],"ns:common.document.source_uri":["<http://wp/en/646359>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["bc"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258mvlky"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}