{"ns:m.05h5g7":{"ns:common.topic.description":["Autocode is the name of a family of \\\"simplified coding systems\\\", later called programming languages, devised in the 1950s and 1960s for a series of digital computers at the Universities of Manchester, Cambridge and London. Autocode was a generic term; the autocodes for different machines were not necessarily closely related as are, for example, the different versions of the single language FORTRAN.\\nIn the 1960s, high-level programming languages using a compiler were commonly called autocodes. Examples of autocodes are COBOL and Fortran."],"rdfs:label":["Autocode"],"key:en":["autocode"],"ns:common.topic.article":[{"ns:common.document.text":["Autocode is the name of a family of \\\"simplified coding systems\\\", later called programming languages, devised in the 1950s and 1960s for a series of digital computers at the Universities of Manchester and Cambridge. Autocode was a generic term; the autocodes for different machines were not necessarily closely related as are, for example, the different versions of the single language FORTRAN.\\nThe first autocode and its compiler were developed by Alick Glennie in 1952 for the Mark 1 computer at the University of Manchester and is considered by some to be the first compiled programming language.\\nThe second autocode was developed for the Mark 1 by R. A. Brooker in 1954 and was called the \\\"Mark 1 Autocode\\\".\\nBrooker also developed an autocode for the Ferranti Mercury in the 1950s in conjunction with the University of Manchester. Mercury Autocode had a limited repertoire of variables a-z and a'-z' and, in some ways resembled early versions of the later Dartmouth BASIC language. It pre-dated ALGOL, having no concept of stacks and hence no recursion or dynamically-allocated arrays. In order to overcome the relatively small store size available on Mercury, large programs were written as"],"ns:common.document.source_uri":["<http://wp/en/1619142>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Autocode"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bt90h5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}