{"ns:m.0d8zvc":{"rdfs:label":["3APL"],"key:en":["3apl"],"ns:common.topic.description":["An Abstract Agent Programming Language or Artificial Autonomous Agents Programming Language or 3APL is an experimental tool and programming language for the development, implementation and testing of multiple cognitive agents using the Belief-Desire-Intention approach."],"ns:common.topic.image":[{"rdfs:label":["3APL Architecture"],"ns:type.content.length":["4262"],"ns:type.content.blob_id":["90ebcc1c5d37ebfb8204642c776db1d1bee5643b34ea018ea8ec2737706c5a25"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:common.image.size":["ns:m.03t0gt1"],"ns:type.content.source":["ns:m.0639xsm"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08wq"],"ns:type.object.name":["3APL Architecture"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0d8zvc"]}],"ns:common.topic.article":[{"ns:common.document.text":["An Abstract Agent Programming Language or Artificial Autonomous Agents Programming Language or 3APL (pronounced triple-A-P-L) is an experimental tool and programming language for the development, implementation and testing of multiple cognitive agents using the Belief-Desire-Intention (BDI) approach.\\n3APL was developed and is maintained by a team at the computer science department of the University of Utrecht in the Netherlands. It facilitates specification of cognitive agent behavior using actions, beliefs, goals, plans, and rules. It has been subject to at least 15 papers and conferences, and at least 4 theses.\\nThe 3APL platform has a visual interface for the monitoring and debugging of agents being run therein, and a syntax-coloring editor for source code editing. It has been released as a Java-based software, which comes with some specification Java interfaces that can be used to develop Java-based plug-ins and libraries. These can be used to provide a visible representation of a virtual environment, for instance. A 3APL platform can also connect in client or server roles to other 3APL platforms across a network, to allow communication among 3APL agents on each platform. A"],"ns:common.document.source_uri":["<http://wp/en/5229527>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["3APL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dzqm3x"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}