{"ns:m.07s3k3v":{"key:user.avh.ellerdale":["0085-c734"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0085-c734"],"ns:common.topic.description":["Office Open XML is a zipped, XML-based file format developed by Microsoft for representing spreadsheets, charts, presentations and word processing documents. The format was initially standardised by Ecma and, in later versions, by ISO and IEC.\\nStarting with Microsoft Office 2007, the Office Open XML file formats have become the default target file format of Microsoft Office. Microsoft Office 2010 provides read support for ECMA-376, read/write support for ISO/IEC 29500 Transitional, and read support for ISO/IEC 29500 Strict. Microsoft Office 2013 additionally supports both reading and writing of ISO/IEC 29500 Strict."],"rdfs:label":["Office Open XML"],"key:en":["office_open_xml"],"ns:common.topic.article":[{"ns:common.document.text":["Office Open XML (also informally known as OOXML or OpenXML) is a zipped, XML-based file format developed by Microsoft for representing spreadsheets, charts, presentations and word processing documents. The Office Open XML specification was initially standardised by Ecma (as ECMA-376) and later by ISO and IEC (as ISO/IEC 29500).\\nStarting with Microsoft Office 2007, the Office Open XML file formats have become the default target file format of Microsoft Office, although the Strict variant of the standard is not yet fully supported. Microsoft Office 2010 provides read support for ECMA-376, read/write support for ISO/IEC 29500 Transitional, and read support for ISO/IEC 29500 Strict. Microsoft has stated that the next release of Microsoft Office (version 15) will support both read and write of ISO/IEC 29500 Strict.\\nIn 2000, Microsoft released an initial version of an XML-based format for Microsoft Excel, which was incorporated in Office XP. In 2002, a new file format for Microsoft Word followed. The Excel and Word formats—known as the Microsoft Office XML formats—were later incorporated into the 2003 release of Microsoft Office.\\nMicrosoft announced in November 2005 that it would"],"ns:common.document.source_uri":["<http://wp/en/3300610>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Office Open XML"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2__vc"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}