{"ns:m.04zs6":{"ns:common.topic.alias":["Massachusetts General Hospital Utility Multi-Programming System"],"ns:common.topic.description":["MUMPS or alternatively M, is a general-purpose computer programming language that provides ACID transaction processing. Its most unique and differentiating feature is its \\\"built-in\\\" database, enabling high-level access to disk storage using simple symbolic program variables and subscripted arrays, similar to the variables used by most languages to access main memory.\\nThe M database is a key-value database engine optimized for high-throughput transaction processing. As such it is in the class of \\\"schema-less\\\", \\\"schema-free,\\\" or NoSQL databases. Internally, M stores data in multidimensional hierarchical sparse arrays. Each array may have up to 32 subscripts, or dimensions. A scalar can be thought of as an array element with zero subscripts. Nodes with varying numbers of subscripts can freely co-exist in the same array.\\nPerhaps the most unusual aspect of the M language is the notion that the database is accessed through variables, rather than queries or retrievals. This means that accessing volatile memory and non-volatile storage use the same basic syntax, enabling a function to work on either local or global variables."],"rdfs:label":["MUMPS"],"key:en":["mumps"],"ns:common.topic.article":[{"ns:common.document.text":["MUMPS (Massachusetts General Hospital Utility Multi-Programming System), or alternatively M, is a programming language created in the late 1960s, originally for use in the healthcare industry. It was designed for the production of multi-user database-driven applications. It predates C and most other popular languages in current usage, and has very different syntax and terminology.\\nIt was largely adopted during the 1970s and early 1980s in healthcare and financial information systems/databases, and continues to be used by many of the same clients today. It is currently used in electronic health record systems as well as by multiple banking networks and online trading/investment services.\\nMUMPS was developed by Neil Pappalardo and colleagues in Dr. Octo Barnett's animal lab at Massachusetts General Hospital (MGH) in Boston during 1966 and 1967. The original MUMPS system was, like Unix a few years later, built on a spare DEC PDP-7.\\nOcto Barnett and Neil Pappalardo were also involved with MGH's planning for a Hospital Information System, obtained a backward compatible PDP-9, and began using MUMPS in the admissions cycle and laboratory test reporting. MUMPS was then an interpreted"],"ns:common.document.source_uri":["<http://wp/en/19723>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Octo Barnett"],"ns:computer.programming_language.introduced":["1966"],"ns:type.object.name":["MUMPS"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255jzbv4"],"ns:computer.programming_language.influenced_by":["ns:m.0gdxqx"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.0b_pm5"],"ns:computer.programming_language.influenced":["ns:m.06yp6q"]}}