{"ns:m.09bss7":{"ns:common.topic.description":["Grammar-oriented programming and Grammar-oriented Object Design are good for designing and creating a domain-specific programming language for a specific business domain.\\nGOOD can be used to drive the execution of the application or it can be used to embed the declarative processing logic of a context-aware component or context-aware service. GOOD is a method for creating and maintaining dynamically reconfigurable software architectures driven by business-process architectures. The business compiler was used to capture business processes within real-time workshops for various lines of business and create an executable simulation of the processes used.\\nInstead of using one DSL for the entire programming activity, GOOD suggests the combination of defining domain-specific behavioral semantics in conjunction with the use of more traditional, general purpose programming languages."],"rdfs:label":["Grammar-oriented programming"],"key:en":["grammar-oriented_programming"],"ns:common.topic.article":[{"ns:common.document.text":["Grammar-oriented programming (GOP) and Grammar-oriented Object Design (GOOD) are good for designing and creating a domain-specific programming language (DSL) for a specific business domain.\\nGOOD can be used to drive the execution of the application or it can be used to embed the declarative processing logic of a context-aware component (CAC) or context-aware service (CAS). GOOD is a method for creating and maintaining dynamically reconfigurable software architectures driven by business-process architectures. The business compiler was used to capture business processes within real-time workshops for various lines of business and create an executable simulation of the processes used.\\nInstead of using one DSL for the entire programming activity, GOOD suggests the combination of defining domain-specific behavioral semantics in conjunction with the use of more traditional, general purpose programming languages."],"ns:common.document.source_uri":["<http://wp/en/3425054>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Grammar-oriented programming"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bx0z8_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}