{"ns:m.049b0_":{"rdfs:label":["WATFIV"],"ns:common.topic.description":["WATFIV, or WATerloo FORTRAN IV, developed at the University of Waterloo, Canada is an implementation of the Fortran computer programming language. It is the successor of WATFOR.\\nWATFIV was used from the late 1960s into the mid-1980s. WATFIV was in turn succeeded by later versions of WATFOR. Because it could complete the three usual steps in just one pass, the system became popular for teaching students computer programming."],"key:en":["watfiv_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["WATFIV, or WATerloo FORTRAN IV, developed at the University of Waterloo, Canada is an implementation of the Fortran computer programming language. It is the successor of WATFOR.\\nWATFIV was used from the late 1960s into the mid 1970s. WATFIV was in turn succeeded by later versions of WATFOR. Because it could complete the three usual steps (\\\"compile-link-go\\\") in just one pass, the system became popular for teaching students computer programming.\\nIn the early 1960s, newly-formed computer science departments started university programs to teach computer programming languages. The Fortran language had been developed at IBM, but suffered from slow and error-prone three-stage batch processing workflow. In the first stage, the compiler started with source code and produced object code. In the second stage, a linker constructed a complete program using growing libraries of common functions. Finally, the program was repeatedly executed with data for the typical scientific and business problems of customers. Each step often included a new set of punched cards or tape. Students, on the other hand, had very different requirements. Their programs were generally short, but usually contained"],"ns:common.document.source_uri":["<http://wp/en/1135659>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["WATFIV"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fl6r8b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}