{"ns:m.07dh_":{"key:user.avh.ellerdale":["0080-1621"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-1621"],"ns:common.topic.description":["TeX is a typesetting system designed and mostly written by Donald Knuth and released in 1978. Within the typesetting system, its name is formatted as TeX.\\nTogether with the Metafont language for font description and the Computer Modern family of typefaces, TeX was designed with two main goals in mind: to allow anybody to produce high-quality books using a reasonably minimal amount of effort, and to provide a system that would give exactly the same results on all computers, at any point in time.\\nTeX is a popular means by which to typeset complex mathematical formulae; it has been noted as one of the most sophisticated digital typographical systems in the world. TeX is popular in academia, especially in mathematics, computer science, economics, engineering, physics, statistics, and quantitative psychology. It has largely displaced Unix troff, the other favored formatter, in many Unix installations, which use both for different purposes. It is also used for many other typesetting tasks, especially in the form of LaTeX, ConTeXt, and other template packages."],"rdfs:label":["TeX"],"key:en":["tex"],"ns:common.topic.official_website":["<http://www.tug.org/>"],"ns:computer.programming_language.language_designers":["Donald Knuth"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm1418"],"ns:common.webpage.uri":["<http://www.tug.org>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.07dh_"]}],"ns:common.topic.image":[{"ns:type.content.length":["79368"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Grendelkhan"],"rdfs:label":["LaTeX sample"],"ns:type.content.blob_id":["fa1ae4405b5ca849f0080aeb61e9e026b72c30516857ae0712aa9c46b60649fc"],"ns:common.image.size":["ns:m.029rhbn"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.source":["ns:m.04y1fb0"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["LaTeX sample"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.07dh_"]}],"ns:common.topic.article":[{"ns:common.document.text":["TeX ( /ˈtɛx/ as in Greek, but often pronounced /ˈtɛk/ in English) is a typesetting system designed and mostly written by Donald Knuth and released in 1978. Within the typesetting system, its name is formatted as TeX.\\nTogether with the Metafont language for font description and the Computer Modern family of typefaces, TeX was designed with two main goals in mind: to allow anybody to produce high-quality books using a reasonable amount of effort, and to provide a system that would give exactly the same results on all computers, now and in the future.\\nTeX is a popular means by which to typeset complex mathematical formulae; it has been noted as one of the most sophisticated digital typographical systems in the world. TeX is popular in academia, especially in mathematics, computer science, economics, engineering, physics, statistics, and quantitative psychology. It has largely displaced Unix troff, the other favored formatter, in many Unix installations, which use both for different purposes. It is now also being used for many other typesetting tasks, especially in the form of LaTeX and other template packages.\\nThe widely used MIME type for TeX is application/x-tex. TeX is free"],"ns:common.document.source_uri":["<http://wp/en/30065>"],"rdf:type":["ns:common.document"]}],"ns:base.ontologies.ontology_instance.equivalent_instances":[{"ns:base.ontologies.ontology_instance_mapping.uri":["<http://sw.opencyc.org/2008/06/10/concept/Mx4rvViYmZwpEbGdrcN5Y29ycA>"],"ns:base.ontologies.ontology_instance_mapping.ontology":["ns:m.04dm2p_"],"rdf:type":["ns:base.ontologies.ontology_instance_mapping"],"ns:base.ontologies.ontology_instance_mapping.freebase_topic":["ns:m.07dh_"]}],"ns:type.object.name":["TeX"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125972rdx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0bp8q"]}}