{"ns:m.037xjq":{"ns:common.topic.description":["StarLogo is an agent-based simulation language developed by Mitchel Resnick, Eric Klopfer, and others at MIT Media Lab and MIT Scheller Teacher Education Program in Massachusetts. It is an extension of the Logo programming language, a dialect of Lisp. Designed for education, StarLogo can be used by students to model the behavior of decentralized systems.\\nThe first StarLogo ran on a Connection Machine 2 parallel computer. A subsequent version ran on Macintosh computers; this version became known later as MacStarLogo. The current StarLogo is written in Java and works on most computers.\\nStarLogo is also available in a version called OpenStarLogo. The source code for OpenStarLogo is available online, although the license under which it is released is not an open source license according to the Open Source Definition, because of restrictions on the commercial use of the code.\\nStarLogo TNG version 1.0 was released in July 2008. It provides a 3D world using OpenGL graphics and a block-based graphical language to increase ease of use and learnability. It is written in C and Java. StarLogo TNG uses \\\"blocks\\\" to put together like puzzle pieces."],"rdfs:label":["StarLogo"],"key:en":["starlogo"],"ns:common.topic.official_website":["<http://education.mit.edu/starlogo/>"],"ns:common.topic.article":[{"ns:common.document.text":["StarLogo is an agent-based simulation language developed by Mitchel Resnick, Eric Klopfer, and others at MIT Media Lab and MIT Teacher Education Program in Massachusetts. It is an extension of the Logo programming language, a dialect of Lisp. Designed for education, StarLogo can be used by students to model the behavior of decentralized systems.\\nThe first StarLogo ran on a Connection Machine 2 parallel computer. A subsequent version ran on Macintosh computers; this version became known later as MacStarLogo (and now is called MacStarLogo Classic). The current StarLogo is written in Java and works on most computers.\\nStarLogo is also available in a version called OpenStarLogo. The source code for OpenStarLogo is available online, although the license under which it is released is not an open source license according to the Open Source Definition, because of restrictions on the commercial use of the code.\\nStarLogo TNG (The Next Generation) version 1.0 was released in July 2008. It provides a 3D world using OpenGL graphics and a block-based graphical language to increase ease of use and learnability. It is written in C and Java. StarLogo TNG uses \\\"blocks\\\" to put together like puzzle"],"ns:common.document.source_uri":["<http://wp/en/746828>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm493m"],"ns:common.webpage.uri":["<http://education.mit.edu/starlogo/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.037xjq"]}],"ns:computer.programming_language.language_designers":["Mitchel Resnick"],"ns:type.object.name":["StarLogo"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12564tyx0"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0bfq5w"],"ns:computer.programming_language.dialects":["ns:m.02tfsj"],"ns:computer.programming_language.influenced_by":["ns:m.04n8q"],"ns:computer.programming_language.parent_language":["ns:m.04n8q"]}}