{"ns:m.02kmb8":{"ns:common.topic.description":["Dartmouth BASIC is the original version of the BASIC programming language. It is so named because it was designed and implemented at Dartmouth College. The language was designed by John Kemeny and Thomas Kurtz as part of the Dartmouth Time Sharing System and was one of the first programming languages intended to be used interactively.\\nSeveral versions were produced at Dartmouth over the years, all implemented as compile and go compilers, unlike many of the versions of the language implemented elsewhere, which were interpreters. The first compiler was produced before the time-sharing system was ready. Known as CardBASIC, it was intended for the standard card-reader based batch processing system. Like all the following versions, it was implemented by a team of undergraduate programmers working under the direction of Kemeny and Kurtz. The first interactive version was made available to general users in June 1964; the second in October, 1964; the third in 1966; the fourth in 1969; the fifth in 1970; the sixth in 1971; and the seventh in 1979."],"rdfs:label":["Dartmouth BASIC"],"key:en":["dartmouth_basic"],"ns:common.topic.article":[{"ns:common.document.text":["Dartmouth BASIC is the original version of the BASIC programming language. It is so named because it was designed and implemented at Dartmouth College. The language was designed by John Kemeny and Thomas Kurtz as part of the Dartmouth Time Sharing System (DTSS) and was one of the first programming languages intended to be used interactively.\\nSeveral versions were produced at Dartmouth over the years, all implemented as compilers, unlike many of the versions of the language implemented elsewhere, which were interpreters. The first compiler was produced before the time-sharing system was ready. Known as CardBASIC, it was intended for the standard card-reader based batch processing system. Like all the following versions, it was implemented by a team of undergraduate programmers working under the direction of Kemeny and Kurtz. The first interactive version was made available to general users in June 1964; the second in October, 1964; the third in 1966; the fourth in 1969; the fifth in 1970; the sixth in 1971; and the seventh in 1979.\\nWork on the compiler and the operating system was done concurrently, and so the first BASIC programs were run in batch mode as part of the development"],"ns:common.document.source_uri":["<http://wp/en/516845>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["John G. Kemeny"],"ns:computer.programming_language.introduced":["1964"],"ns:type.object.name":["Dartmouth BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d12pqm"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}