{"ns:m.02rn8h0":{"rdfs:label":["Generalized Automation Language"],"ns:common.topic.description":["Two forms of GAL are available. The first is General Automation Language for device automation and the second is Generalized Automation Language which a very high level programming language for MVS based systems such as OS/390 and z/OS.\\nGeneral Automation Language\\nDeveloped by iLED to provide a common language for standardising automation and control of devices in the residential and commercial control environments. The language provides a standardised method of communicating to/from controlled/controlling devices. At each device, GAL is converted into the machine specific protocol and medium. An example is the control of a DVD player. The GAL command will be <MyHouse MyArea MyRoom MyDevice MyCommand> FredsHouse GroundFloor Lounge DVDplayer ON. The GAL device will then convert this to the discrete IR command to switch on the DVD Player.\\nRef\\nGeneralized Automation Language\\ncontains features and constructs that enable the programmer to efficiently intercept systems events and schedule responses. Somewhat akin to BASIC, GAL enables systems programmers and operators to define logic to apply to systems messages as they flow through a multi-system environment."],"key:en":["generalized_automation_language"],"ns:common.topic.article":[{"ns:common.document.text":["Two forms of GAL are available. The first is General Automation Language for device automation and the second is Generalized Automation Language (GAL) which a very high level programming language for MVS based systems such as OS/390 and z/OS.\\n\\nGeneral Automation Language\\nDeveloped by iLED to provide a common language for standardising automation and control of devices in the residential (Home Automation) and commercial control environments. The language provides a standardised method of communicating to/from controlled/controlling devices. At each device, GAL is converted into the machine specific protocol and medium. An example is the control of a DVD player. The GAL command will be <MyHouse MyArea MyRoom MyDevice MyCommand> FredsHouse GroundFloor Lounge DVDplayer ON. The GAL device will then convert this to the discrete IR command to switch on the DVD Player.\\nRef \\n\\nGeneralized Automation Language\\ncontains features and constructs that enable the programmer to efficiently intercept systems events and schedule responses. Somewhat akin to BASIC, GAL enables systems programmers and operators to define logic to apply to systems messages as they flow through a multi-system (sysplex)"],"ns:common.document.source_uri":["<http://wp/en/19596538>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Generalized Automation Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256kszhv"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}