{"ns:m.06bm1_":{"ns:common.topic.description":["Mortran is an extension of the Fortran programming language used for scientific computation. It introduces syntax changes, including the use of semicolons to end statements, in order to improve readability and flexibility. Mortran code is macro-processed into Fortran code for compilation.\\nNote that Mortran, like many preprocessors, does not make a complete analysis of the Fortran source and, like many preprocessors, may not always make its assumptions/requirements explicit. Consider, for example, Mortran multiple assignment. From the Mortran User Guide:\\nproduces the following FORTRAN statements:\\nIn this example, the produced Fortran implements the multiple assignment correctly only if X is not aliased to I or to A, assuming the multiple assignment semantics are left to right."],"rdfs:label":["Mortran"],"key:en":["mortran"],"ns:common.topic.article":[{"ns:common.document.text":["Mortran (More Fortran) is an extension of the Fortran programming language used for scientific computation. It introduces syntax changes, including the use of semicolons to end statements, in order to improve readability and flexibility. Mortran code is macro-processed into Fortran code for compilation.\\nNote that Mortran, like many preprocessors, does not make a complete analysis of the Fortran source and, like many preprocessors, may not always make its assumptions/requirements explicit. Consider, for example, Mortran multiple assignment. From the Mortran User Guide:\\nIn this example, the produced Fortran implements the multiple assignment correctly only if X is not aliased to I or to A(I,K), assuming the multiple assignment semantics are left to right."],"ns:common.document.source_uri":["<http://wp/en/1979848>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Mortran"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125ch2dcw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}