{"ns:m.01grf1":{"ns:common.topic.description":["JOVIAL is a high-level computer programming language similar to ALGOL, but specialized for the development of embedded systems."],"rdfs:label":["JOVIAL"],"key:en":["jovial"],"ns:common.topic.article":[{"ns:common.document.text":["JOVIAL is a high-order computer programming language similar to ALGOL, but specialized for the development of embedded systems (specialized computer systems designed to perform one or a few dedicated functions[1], usually embedded as part of a complete device including mechanical parts).\\nJOVIAL is an acronym for \\\"Jules Own Version of the International Algorithmic Language.\\\" The \\\"International Algorithmic Language\\\" was a name originally proposed for ALGOL 58. It was developed to compose software for the electronics of military aircraft by Jules Schwartz in 1959.\\nDuring the 1960s JOVIAL was a part of the US Military L-project series, in particular 465L (the SACCS project), due to a lack of real-time languages available. 95% of the SACCS project, managed by ITT with software primarily written by SDC, was written in JOVIAL. The software project took two years and fewer than 1400 programmer years, less than half of the equivalent time in the SAGE L-project.\\nDuring the late 1970s and early 1980s, the U.S. Air Force adopted a standardized CPU, the MIL-STD-1750A, and subsequent JOVIAL programs were built for that processor. JOVIAL was standardized during 1973 with MIL-STD-1589 and was"],"ns:common.document.source_uri":["<http://wp/en/224748>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1960"],"ns:type.object.name":["JOVIAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255frz5d"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0c_knm"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}