{"ns:m.030b4s":{"ns:common.topic.description":["TI-BASIC is the unofficial name of a BASIC-like language built into Texas Instruments's graphing calculators, including the TI-83 series, TI-84 Plus series, TI-89 series, TI-92 series, TI-73, and TI-Nspire. TI rarely refers to the language by name, but the name TI-BASIC has been used in some developer documentation.\\nFor many applications, it is the most convenient way to program any TI calculator, since the capability to write programs in TI-BASIC is built-in. Assembly language can also be used, and C compilers exist for translation into assembly: TIGCC for Motorola 68000 based calculators, and SDCC for Zilog Z80 based calculators. However, both of them are cross-compilers, not allowing on-calculator programming. TI-BASIC is considerably slower than the assembly language, making it better suited to writing programs to quickly solve math problems or perform repetitive tasks, rather than programming games or graphics-intensive applications. Some math instruction books even provide programs in TI-BASIC.\\nAlthough it is somewhat minimalist compared to programming languages used on computers, TI-BASIC is nonetheless an important factor in the programming community."],"rdfs:label":["TI-BASIC"],"key:en":["ti-basic"],"ns:common.topic.article":[{"ns:common.document.text":["TI-BASIC is the unofficial name of a BASIC-like language built into Texas Instruments (TI)'s graphing calculators, including the TI-83 series, TI-84 Plus series, TI-89 series, TI-92 series (including Voyage 200), TI-73, and TI-Nspire. TI usually doesn't refer to the language by name, but the name TI-BASIC has been used occasionally in developer documentation.\\nFor many applications, it is the most convenient way to program any TI calculator, since the capability to write programs in TI-BASIC is built-in. Assembly language (often referred to as \\\"asm\\\") can also be used, and C compilers exist for translation into assembly: TIGCC for Motorola 68000 (68k) based calculators, and SDCC for Zilog Z80 based calculators. However, both of them are cross-compilers, not allowing on-calculator programming. TI-BASIC is considerably slower than the assembly language (because it has to be interpreted), making it better suited to writing programs to quickly solve math problems or perform repetitive tasks, rather than programming games or graphics-intensive applications. Some math instruction books even provide programs in TI-BASIC (usually for the widespread variant used by the TI-82/83/84"],"ns:common.document.source_uri":["<http://wp/en/657730>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["TI-BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125g6zr52"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}