{"ns:m.026k4ty":{"ns:common.topic.description":["MAPPER is a database management and processing system. It is a software tool that enables end-users to share computer power in a corporation. Users are able to develop their own applications and process them interactively. The product has a number of unique characteristics that may appear technically impossible to persons unfamiliar with its method of operation.\\nMAPPER had its origins outside the technical mainstream of computer programming. Initially created in Sperry Univac's computer factory in Roseville, Minnesota, MAPPER is a proprietary product of Unisys Corporation. The principal architect was Louis S. Schlueter, who worked with other early \\\"gurus\\\" like Michael Stroeing of Sperry, Steve Anderson of Santa Fe Railway, and later with Kansas City government. MAPPER became a very popular solution in the Government sector. Large user group communities formed like the New England MAPPER Users Group headed by Judith Hartman, Howard Roundy and Michael Scolastico.\\nThere are similarities between the development history of MAPPER and that of UNIX. Both were responses to what appeared to be unreasonable restrictions in the way computer systems were developed."],"rdfs:label":["MAPPER"],"key:en":["mapper"],"ns:common.topic.article":[{"ns:common.document.text":["MAPPER (MAintain, Prepare, and Produce Executive Reports) is a database management and reporting system that includes the world's first 4GL. Developed in-house by the UNIVAC Division of Sperry Corporation, MAPPER's heritage dates back to the 1960s when Louis Schlueter conceived the CRT RPS (Report Processing System, to differentiate it from RPG) as a means to help Sperry/Univac manage disparate activities involved with coordinating hardware and software development, with identifying and meeting requirements for new systems, and with maintaining existing systems.  .\\nCRT RPS became MAPPER in 1975. That proving ground, plus the development of the UNIVAC 1100, and pressure from customers, most notably Sante Fe railroad, led to a release for more general use in 1979.  MAPPER was intended for End-user computing from the beginning, and was the first to use more advanced techniques. MAPPER applied a powerful cabinet and drawer metaphor to handle directories and files. Data was represented in a 'row and column' framework which pre-dated spreadsheet methods. High-level commands allowed easy programming.\\nAn early major use of MAPPER was by the Santa Fe railroad to track its freight cars,"],"ns:common.document.source_uri":["<http://wp/en/7920952>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["MAPPER"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256qv1xz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}