{"ns:m.02yrkx":{"rdfs:label":["IBM RPG"],"ns:common.topic.description":["RPG is a high-level programming language for business applications. RPG is an IBM proprietary programming language and its later versions are only available on IBM i or OS/400 based systems.\\nIt has a long history, having been developed by IBM in 1959 as the Report Program Generator - a tool to replicate punched card processing on the IBM 1401 then updated to RPG II for the IBM System/3 in the late 1960s, and since evolved into an HLL equivalent to COBOL and PL/I.\\nIt remains a popular programming language on the IBM i operating system, which runs on IBM Power i platform hardware. The current version, RPG IV, provides a modern programming environment."],"key:en":["rpg_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["RPG is a high-level programming language (HLL) for business applications.\\nIt has a long history, having been developed by IBM in 1959 as the Report Program Generator - a tool to replicate card processing on the IBM 1401 then updated to RPG II for the IBM System/3 in the late 1960s, and since evolved into an HLL equivalent to COBOL and PL/I. It remains a popular programming language on the IBM Power i platform where the current version, RPG IV (aka ILE RPG), provides a modern programming environment.\\nWhile IBM is the creator and primary vendor of RPG the language is available from other mainframe and microcomputer manufacturers, including Unisys.\\nAn RPG program typically starts off with File Specifications, listing all files being written to, read from or updated, followed by Data Definition Specifications containing program elements such as Data Structures and dimensional arrays, much like a \\\"Working-Storage\\\" section of a COBOL program or var statements in a Pascal program. This is followed by Calculation Specifications, which contain the actual meat of the code. Output Specifications can follow which can be used to determine the layout of other files or reports. Alternatively"],"ns:common.document.source_uri":["<http://wp/en/632241>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.developers":["IBM"],"ns:computer.programming_language.introduced":["1959"],"ns:type.object.name":["IBM RPG"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fkm42v"],"ns:computer.programming_language.language_paradigms":["ns:m.01h1_2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.02544s"],"ns:computer.programming_language.influenced_by":["ns:m.0fs0gv"]}}