{"ns:m.044cfc":{"ns:common.topic.description":["High Performance Fortran is an extension of Fortran 90 with constructs that support parallel computing, published by the High Performance Fortran Forum. The HPFF was convened and chaired by Ken Kennedy of Rice University. The first version of the HPF Report was published in 1993.\\nBuilding on the array syntax introduced in Fortran 90, HPF uses a data parallel model of computation to support spreading the work of a single array computation over multiple processors. This allows efficient implementation on both SIMD and MIMD style architectures. HPF features included:\\nNew Fortran statements, such as FORALL, and the ability to create PURE procedures\\nCompiler directives for recommended distributions of array data\\nExtrinsic procedure interface for interfacing to non-HPF parallel procedures such as those using message passing\\nAdditional library routines - including environmental inquiry, parallel prefix/suffix, data scattering, and sorting operations\\nFortran 95 incorporated several HPF capabilities. In response, the HPFF again convened and published the HPF 2.0 Report. The updated report removed material which was already covered by Fortran 95."],"rdfs:label":["High Performance Fortran"],"key:en":["high_performance_fortran"],"ns:common.topic.article":[{"ns:common.document.text":["High Performance Fortran (HPF) is an extension of Fortran 90 with constructs that support parallel computing, published by the High Performance Fortran Forum (HPFF). The HPFF was convened and chaired by Ken Kennedy of Rice University. The first version of the HPF Report was published in 1993.\\nBuilding on the array syntax introduced in Fortran 90, HPF uses a data parallel model of computation to support spreading the work of a single array computation over multiple processors. This allows efficient implementation on both SIMD and MIMD style architectures. HPF features included:\\nFortran 95 incorporated several HPF capabilities. In response, the HPFF again convened and published the HPF 2.0 Report. The updated report removed material which was already covered by Fortran 95. The report was also reorganized and revised based on experience with HPF 1.0.\\nWhile some vendors did incorporate HPF into their compilers in the 1990s, some aspects proved difficult to implement and of questionable use. Since then, most vendors and users have moved to OpenMP-based parallel processing. However HPF continues to have influence. For example the proposed BIT data type for the upcoming Fortran-2008"],"ns:common.document.source_uri":["<http://wp/en/1081482>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["High Performance Fortran"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255sxv2c"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0gnckq"]}}