{"ns:m.03x8qv":{"ns:common.topic.description":["TELCOMP was a programming language developed at Bolt, Beranek and Newman in about 1964 and in use until at least 1974. BBN offered TELCOMP as a paid service, with first revenue in October 1965. The service was sold to a company called On-Line Systems in 1972. In the United Kingdom, TELCOMP was offered by Time Sharing, Ltd, a partnership between BBN and an entrepreneur named Richard Evans.\\nIt was an interactive, conversational language based on JOSS, developed by BBN after Cliff Shaw from RAND visited the labs in 1964 as part of the NIH survey. It was first implemented on the PDP-1 and was used to provide a commercial time sharing service by BBN in the Boston area and later by Time Sharing Ltd. in the United Kingdom.\\nIn 1996, Leo Beranek said \\\"We even developed a programming language called TELCOMP that to this day, some say was better than the programming language that the industry adopted, namely BASIC.\\\"\\nThere were at least three versions: TELCOMP I, TELCOMP II, and TELCOMP III.\\nTELCOMP I was implemented on the PDP-1, TELCOMP II on the PDP-7 and TELCOMP III on the PDP-10, running on DEC 's TOPS-10 operating system or on BBN's own TENEX operating system."],"rdfs:label":["TELCOMP"],"key:en":["telcomp"],"ns:common.topic.article":[{"ns:common.document.text":["TELCOMP was a programming language developed at Bolt, Beranek and Newman (BBN) in about 1965 and in use until at least 1974.\\nIt was an interactive, conversational language based on JOSS, developed by BBN after Cliff Shaw from RAND visited the labs in 1964 as part of the NIH survey. It was first implemented on the PDP-1 and was used to provide a commercial time sharing service by BBN in the Boston area and later by Time Sharing Ltd. in the United Kingdom.\\nIn 1996, Leo Beranek said \\\"We even developed a programming language called TELCOMP that to this day, some say was better than the programming language that the industry adopted, namely BASIC.\\\"\\nThere were at least three versions: TELCOMP I, TELCOMP II, and TELCOMP III.\\nTELCOMP II was implemented on the PDP-7 and TELCOMP III on the PDP-10, running on DEC 's TOPS-10 operating system or on BBN's own TENEX operating system.\\nTELCOMP programs were normally input via a paper tape reader on a Teletype Model 33, which would be connected to a PDP via a modem and acoustic telephone line. Data could be read from the paper tape reader or from the Teletype keyboard. Output was either printed to the Teletype or sent to the paper tape punch. Early"],"ns:common.document.source_uri":["<http://wp/en/991259>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["TELCOMP"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12571z91k"],"ns:computer.programming_language.influenced_by":["ns:m.011k8l"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.04zs6"]}}