{"ns:m.05c5dj":{"ns:common.topic.description":["Strongtalk is a Smalltalk environment with optional static typing support. Strongtalk can make some compile time checks, and offer \\\"stronger\\\" type safety guarantees; this is the source of its name. It is non-commercial, though it was originally a commercial project developed by a small start-up company called LongView Technologies."],"rdfs:label":["Strongtalk"],"key:en":["strongtalk"],"ns:common.topic.article":[{"ns:common.document.text":["Strongtalk is a Smalltalk environment with optional static typing support. Strongtalk can make some compile time checks, and offer \\\"stronger\\\" type-safety guarantees; this is the source of its name. It is non-commercial, though it was originally a commercial project developed by a small start-up company called LongView Technologies (trading as Animorphic Systems).\\nDave Griswold wanted to use Smalltalk more extensively, but the existing implementations weren't sufficient for his needs. He wanted to improve the performance, add type-checking, and use native UI widgets. His efforts resulted in the 1993 paper he co-authored with Gilad Bracha. This version was based on adding type-checking to the ParcPlace Systems implementation of Smalltalk; an implementation that started from scratch would gain a better typing system.\\nHe became interested in the improvements that the Self team had achieved, and envisioned the same techniques used to improve Smalltalk. Urs Hölzle, who worked on the powerful Self compiler, spoke with Griswold about implementing the same \\\"type feedback\\\" in a Smalltalk compiler. Griswold, Hölzle, Lars Bak and others formed a small company (LongView Technologies, doing"],"ns:common.document.source_uri":["<http://wp/en/1569550>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Strongtalk"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256b8xm8"],"ns:computer.programming_language.influenced":["ns:m.01p8vv"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}