{"ns:m.0q1x":{"ns:common.topic.alias":["ALGOL 60"],"ns:common.topic.description":["ALGOL is a family of imperative computer programming languages, originally developed in the mid-1950s, which greatly influenced many other languages and was the standard method for algorithm description used by the ACM in textbooks and academic sources for more than thirty years.\\nIn the sense that most modern languages are \\\"algol-like\\\", it was arguably the most successful of the four high-level programming languages with which it was roughly contemporary: Fortran, Lisp, and COBOL. It was designed to avoid some of the perceived problems with FORTRAN and eventually gave rise to many other programming languages, including BCPL, B, Pascal, PL/I, Simula, and C. ALGOL introduced code blocks and the begin…end pairs for delimiting them. It was also the first language implementing nested function definitions with lexical scope. Moreover, it was the first programming language which gave detailed attention to formal language definition and through the Algol 60 Report introduced Backus-Naur Form, a principal notation for language design.\\nThere were three major specifications:\\nALGOL 58 – originally proposed to be called IAL."],"rdfs:label":["ALGOL"],"ns:computer.programming_language.language_designers":["John Backus"],"ns:common.topic.article":[{"ns:common.document.text":["ALGOL (short for ALGOrithmic Language) is a family of imperative computer programming languages originally developed in the mid 1950s which greatly influenced many other languages and was the standard method for algorithm description used by the ACM, in textbooks, and academic works for the next 30 years and more. In the sense that most modern languages are \\\"algol-like\\\", it was arguably the most successful of the four high level programming languages with which it was roughly contemporary, Fortran, Lisp, and COBOL. It was designed to avoid some of the perceived problems with FORTRAN and eventually gave rise to many other programming languages, including BCPL, B, Pascal, Simula, and C. ALGOL introduced code blocks and the begin and end pairs for delimiting them and it was also the first language implementing nested function definitions with lexical scope. Moreover, it was the first programming language which gave serious attention to formal language definition and through the Algol 60 Report introduced Backus-Naur Form, a principal notation for language design.\\nThere were three major specifications:\\nNiklaus Wirth based his own ALGOL W on ALGOL 60 before developing Pascal. Algol-W"],"ns:common.document.source_uri":["<http://wp/en/1453>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1958"],"ns:type.object.name":["ALGOL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259zm8bp"],"ns:computer.programming_language.influenced":["ns:m.0n6y"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:computer.programming_language.dialects":["ns:m.0bbtm17"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.03s53r"]}}