{"ns:m.0cjbf1":{"ns:common.topic.description":["S-algol is a computer programming language derivative of ALGOL 60 developed at the University of St Andrews in 1979 by Ron Morrison and Tony Davie. The language was developed as his PhD thesis as a modification of ALGOL to contain orthogonal datatypes. Ron Morrison would go on to become professor at the university and head of the department of computer science. The S-algol language was used for teaching at the university at an undergraduate level until 1999. It was also the language taught for several years in the 1980s at a local school in St. Andrews, Madras College. The computer science text Recursive Descent Compiling describes a recursive descent compiler for S-algol, using S-algol as the implementation language.\\nPS-Algol is a persistent derivative of S-algol. It was developed around 1981 at the Universities of Edinburgh and St Andrews. It supports database capability by providing for longevity of data in the form of a persistent heap that survives termination of PS-Algol programs."],"rdfs:label":["S-algol"],"key:en":["s-algol"],"ns:common.topic.article":[{"ns:common.document.text":["S-algol is a computer programming language derivative of ALGOL 60 developed at the University of St. Andrews in 1979 by Ron Morrison and Tony Davie. The language was developed as his PhD thesis as a modification of ALGOL to contain orthogonal datatypes. Ron Morrison would go on to become professor at the university and head of the department of computer science. The S-algol language was used for teaching at the university at an undergraduate level until 1999. It was also the language taught for several years in the 1980s at a local school in St. Andrews, Madras College. The computer science text Recursive descent compiling describes a recursive descent compiler for S-algol, using S-algol as the implementation language (see bootstrapping).\\nPS-Algol is a persistent derivative of S-algol. It was developed around 1981 at the Universities of Edinburgh and St Andrews. It supports database capability by providing for longevity of data in the form of a persistent heap that survives termination of PS-Algol programs. It is considered to be the first programming language to support orthogonal persistence."],"ns:common.document.source_uri":["<http://wp/en/4706468>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["S-algol"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257vpks0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}