{"ns:m.0705zy":{"ns:common.topic.description":["ProvideX is a computer language and development environment derived from Business Basic in the mid-1980s.\\nProvideX is available on several operating systems and includes not only the programming language but also file system, presentation layer interface, and other components. The language is primarily designed for use in the development of business applications. There are numerous companies using the technology as the basis for their application in markets such as distribution, property management, health care, transportation, etc. While primarily used in North America, there are developers around the world which use ProvideX.\\nOver the years since its inception and as the computer industry has changed, ProvideX has added functionality such as a graphical interface, client-server capabilities, access to external databases, web services, and, more recently, object oriented programming capabilities. The language has generally maintained compatibility with its roots; thus applications developed in ProvideX have been able to remain current even though the world of technology has changed."],"rdfs:label":["ProvideX"],"key:en":["providex"],"ns:common.topic.official_website":["<http://www.pvx.com/>"],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.pvxplus.com>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bk_m02"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0705zy"]}],"ns:common.topic.article":[{"ns:common.document.text":["ProvideX is a computer language and development environment derived from Business Basic (a business oriented derivative of BASIC) in the mid-1980s.\\nProvideX is available on several operating systems (Unix/Linux/Windows/Mac OS X) and includes not only the programming language but also file system, presentation layer interface, and other components. The language is primarily designed for use in the development of business applications. There are numerous companies using the technology as the basis for their application in markets such as distribution, property management, health care, transportation, etc. While primarily used in North America, there are developers around the world which use ProvideX.\\nOver the years since its inception and as the computer industry has changed, ProvideX has added functionality such as a graphical interface, client-server capabilities, access to external databases, web services, and, more recently, object oriented programming capabilities. The language has generally maintained compatibility with its roots; thus applications developed in ProvideX have been able to remain current even though the world of technology has changed.\\nOn October 8, 2010, PVX"],"ns:common.document.source_uri":["<http://wp/en/2276397>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1992"],"ns:type.object.name":["ProvideX"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1yl5svy45"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}