{"ns:m.0672c1":{"ns:common.topic.description":["X10 is a programming language being developed by IBM at the Thomas J. Watson Research Center as part of the Productive, Easy-to-use, Reliable Computing System project funded by DARPA's High Productivity Computing Systems program. Its primary authors are Kemal Ebcioğlu, Vijay Saraswat, and Vivek Sarkar.\\nX10 is designed specifically for parallel computing using the partitioned global address space model. A computation is divided among a set of places, each of which holds some data and hosts one or more activities that operate on those data. It has a constrained type system for object-oriented programming, a form of dependent types. Other features include user-defined primitive struct types; globally distributed arrays, and structured and unstructured parallelism.\\nX10 uses the concept of parent and child relationships for activities to prevent the lock stalemate that can occur when two or more processes wait for each other to finish before they can complete. An activity may spawn one or more child activities, which may themselves have children. Children cannot wait for a parent to finish, but a parent can wait for a child using the finish command."],"rdfs:label":["X10"],"ns:common.topic.official_website":["<http://www.x10-lang.org>"],"ns:computer.programming_language.developers":["IBM"],"ns:computer.programming_language.language_designers":["Kemal Ebcioglu"],"ns:common.topic.article":[{"ns:common.document.text":["X10 is a programming language being developed by IBM at the Thomas J. Watson Research Center as part of the Productive, Easy-to-use, Reliable Computing System (PERCS) project funded by DARPA's High Productivity Computing Systems (HPCS) program. Its primary authors are Kemal Ebcioğlu, Vijay Saraswat, and Vivek Sarkar.\\nX10 is designed specifically for parallel programming using the partitioned global address space (PGAS) model. A computation is divided among a set of places, each of which holds some data and hosts one or more activities that operate on those data. It has a constrained type system for object-oriented programming, a form of dependent types. Other features include user-defined primitive struct types; globally distributed arrays, and structured and unstructured parallelism.\\nX10 uses the concept of parent and child relationships for activities to prevent the lock stalemate that can occur when two or more processes wait for each other to finish before they can complete. An activity may spawn one or more child activities, which may themselves have children. Children cannot wait for a parent to finish, but a parent can wait for a child using the finish command."],"ns:common.document.source_uri":["<http://wp/en/1932246>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://x10-lang.org/>"],"ns:common.webpage.resource":["ns:m.0bl9y24"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0672c1"]}],"ns:computer.programming_language.introduced":["2004"],"ns:type.object.name":["X10"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259f0r0s"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.07sbkfb"]}}