{"ns:m.09f7qd":{"rdfs:label":["Dexterity programming language"],"ns:common.topic.description":["The Dexterity programming language was designed in the early 1990s for the implementation of platform independent graphical accounting software. Dexterity itself is written in the C programming language. It was used in the development of Great Plains accounting software.\\nMicrosoft Business Solutions GP, formerly Great Plains Dynamics and eEnterprise, is a Dexterity-written application. Microsoft's small business line, Microsoft Small Business Manager and Small Business Financials, were also written in Dexterity and use the same code base as Great Plains."],"key:en":["dexterity_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["The Dexterity programming language was designed in the early 1990s for the implementation of platform independent graphical accounting software. Dexterity itself is written in the C programming language . It was used in the development of Great Plains accounting software.\\nMicrosoft Business Solutions GP, formerly Great Plains Dynamics and eEnterprise, is a Dexterity-written application. Microsoft's small business line, Microsoft Small Business Manager and Small Business Financials, were also written in Dexterity and use the same code base as Great Plains.\\nGreat Plains Dexterity is a proprietary programming language and technology, designed in the early 1990s with the goal to build a platform-independent graphical accounting package - Great Plains Dynamics. Dexterity itself is written in C (with the hope that C would provide platform independence). You can install Dexterity from the Dynamics GP CD #2 and it allows custom pieces to be seamlessly integrated with the Dynamics GP interface.\\nDynamics GP macros can also be recorded in Dexterity. The ability to handle branches does not appear to exist in these macros."],"ns:common.document.source_uri":["<http://wp/en/3471233>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Dexterity programming language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259jw3lz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}