{"ns:m.06xcy4":{"ns:common.topic.description":["Join Java is a programming language based on the join-pattern that extends the standard Java programming language with the join semantics of the join-calculus. It was written at the University of South Australia within the Reconfigurable Computing Lab by Dr. Von Itzstein."],"rdfs:label":["Join Java"],"key:en":["join_java"],"ns:common.topic.official_website":["<http://www.joinjava.unisa.edu.au/>"],"ns:common.topic.article":[{"ns:common.document.text":["Join Java is a programming language that extends the standard Java programming language with the join semantics of the join-calculus. It was written at the University of South Australia within the Reconfigurable Computing Lab by Dr. Von Itzstein.\\nThe Join Java extension introduces three new language constructs:\\nConcurrency in most popular programming languages is implemented using constructs such as semaphores and monitors. Libraries are emerging (such as the Java concurrency library JSR-166) that provide higher-level concurrency semantics. Communicating Sequential Processes (CSP), Calculus of Communicating Systems (CCS) and Pi have higher-level synchronization behaviours defined implicitly through the composition of events at the interfaces of concurrent processes. Join calculus, in contrast, has explicit synchronization based on a localized conjunction of events defined as reduction rules. Join semantics try to provide explicit expressions of synchronization without breaching the object-oriented idea of modularization, including dynamic creation and destruction of processes and channels.\\nThe Join Java language can express virtually all published concurrency patterns without"],"ns:common.document.source_uri":["<http://wp/en/2225745>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://joinjava.unisa.edu.au/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.06xcy4"]}],"ns:type.object.name":["Join Java"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257svlw5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:computer.programming_language.influenced_by":["ns:m.07sbkfb"]}}