{"ns:m.02k6kx":{"rdfs:label":["RPL"],"ns:common.topic.description":["The RPL programming language is a handheld calculator system and application programming language used on Hewlett-Packard's engineering graphing RPN calculators of the HP 28, 48, 49 and 50 series, but it is also usable on non-RPN calculators, such as the 38, 39 and 40 series.\\nRPL is a structured programming language based on RPN, but equally capable of processing algebraic expressions and formulae, implemented as a threaded interpreter. RPL has many similarities to Forth, both languages being stack-based, and of course the list-based LISP. Contrary to previous HP RPN calculators, which had a fixed four-level stack, the stack used by RPL is only limited by available calculator RAM.\\nRPL originated from HP's Corvallis, Oregon development facility in 1984 as a replacement for the previous practice of implementing the operating systems of calculators in assembly language. According to a quote by William Wickes, one of the original RPL developers, \\\"the development team never calls it anything but RPL.\\\""],"key:en":["rpl_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["The RPL programming language (RPL meaning ROM-based procedural language following Hewlett-Packard or, alternatively, Reverse Polish LISP) is a handheld calculator system and application programming language used on Hewlett-Packard's engineering graphing RPN calculators of the HP-28, HP-48, HP-49 and HP-50 series, but it is also usable on non-RPN calculators, such as the HP-39 series.\\nRPL is a structured programming language based on RPN but equally capable of processing algebraic expressions and formulae, implemented as a threaded interpreter. RPL has many similarities to Forth, both languages being stack-based, and of course the list-based LISP. Contrary to previous HP RPN calculators, which had a fixed four-level stack, the stack used by RPL is only limited by available calculator RAM.\\nRPL originated from HP's Corvallis, Oregon development facility in 1984 as a replacement for the previous practice of implementing the operating systems of calculators in assembly language. According to a quote by Dr. William Wickes, one of the original RPL developers, \\\"the development team never calls it anything but (the initials) RPL.\\\"\\nThe internal low- to medium-level variant of RPL, called"],"ns:common.document.source_uri":["<http://wp/en/512681>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1984"],"ns:type.object.name":["RPL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256ft_fm"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.04kyw"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"]}}