{"ns:m.02z81":{"key:user.avh.ellerdale":["0080-b55a"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-b55a"],"ns:common.topic.description":["Forth is an imperative stack-based computer programming language and programming environment. Language features include structured programming, reflection, concatenative programming and extensibility. Although not an acronym, the language's name is sometimes spelled with all capital letters as FORTH, following the customary usage during its earlier years.\\nA procedural programming language without type checking, Forth features both interactive execution of commands and the ability to compile sequences of commands for later execution. Some Forth implementations compile threaded code, but many implementations today generate optimized machine code like other language compilers.\\nAlthough not as popular as other programming systems, Forth has enough support to keep several language vendors and contractors in business. Forth is currently used in boot loaders such as Open Firmware, space applications, and other embedded systems. Gforth, an implementation of Forth by the GNU Project, is actively maintained, with its most recent release on June 14, 2014. The 1994 standard is currently undergoing revision, provisionally titled Forth 200x."],"rdfs:label":["Forth"],"key:en":["forth"],"ns:computer.programming_language.language_designers":["Charles H. Moore"],"ns:common.topic.article":[{"ns:common.document.text":["Forth is an imperative stack-based computer programming language and programming environment. Language features include structured programming, reflection (the ability to modify the program structure during program execution), concatenative programming (functions are composed with juxtaposition) and extensibility (the programmer can create new commands). Although not an acronym, the language's name is sometimes spelled with all capital letters as FORTH, following the customary usage during its earlier years.\\nA procedural programming language without type checking, Forth features both interactive execution of commands (making it suitable as a shell for systems that lack a more formal operating system) and the ability to compile sequences of commands for later execution. Some Forth implementations (usually early versions or those written to be extremely portable) compile threaded code, but many implementations today generate optimized machine code like other language compilers.\\nAlthough not as popular as other programming systems, Forth has enough support to keep several language vendors and contractors in business. Forth is currently used in boot loaders such as Open Firmware, space"],"ns:common.document.source_uri":["<http://wp/en/11012>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.image":[{"ns:type.content.length":["1716"],"ns:type.content.blob_id":["91e3f1bdf0a4a1850d2f4efa70a7d26c2c009b37e6a8d6a2fa8bc55b1267f0ce"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Walkeraj"],"rdfs:label":["Forthstack1 5"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:common.licensed_object.license":["ns:m.03mtv8h"],"ns:type.content.source":["ns:m.0bc8mv_"],"ns:type.content.media_type":["ns:m.08y0"],"ns:common.image.size":["ns:m.0kk33t"],"ns:type.object.name":["Forthstack1 5"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.02z81"]}],"ns:computer.programming_language.introduced":["1970"],"ns:type.object.name":["Forth"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:computer.programming_language.influenced":["ns:m.09trtv"],"ns:common.topic.notable_for":["ns:g.1258953sr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.02m_jv"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:computer.programming_language.influenced_by":["ns:m.0q1d"]}}