{"ns:m.05zx8sy":{"ns:common.topic.description":["AgentSpeak is an agent-oriented programming language. It is based on logic programming and the BDI architecture for autonomous agents. The language was originally called AgentSpeak, but became more popular as AgentSpeak, a term that is also used to refer to the variants of the original language."],"rdfs:label":["AgentSpeak"],"key:en":["agentspeak"],"ns:common.topic.article":[{"ns:common.document.text":["AgentSpeak is an agent-oriented programming language. It is based on logic programming and the BDI architecture for (cognitive) autonomous agents. The language was originally called AgentSpeak(L), but became more popular as AgentSpeak, a term that is also used to refer to the variants of the original language.\\nIn 1996, Anand Rao created a logic-based agent programming language based on the BDI architecture and named it AgentSpeak(L). This became a highly cited paper in the multi-agent systems literature. In its original conception, AgentSpeak was an abstract agent programming language aimed to help the understanding of the relation between practical implementations of the BDI architecture such as Procedural Reasoning System (PRS) and the formalisation of the ideas behind the BDI architecture using modal logics.\\nVarious authors contributed to the further formalisation of the AgentSpeak(L) language, for example. In recent years, the language has been revived both in research and development. In terms of research, there has been work both on extensions of AgentSpeak as well as on formal verification of AgentSpeak programs using model checking. The language is also one of the most"],"ns:common.document.source_uri":["<http://wp/en/22623404>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1996"],"ns:type.object.name":["AgentSpeak"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2_vxq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}