{"ns:m.087l8":{"key:user.avh.ellerdale":["0080-ac5d"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-ac5d"],"ns:common.topic.description":["XSLT is a language for transforming XML documents into other XML documents, or other formats such as HTML for web pages, plain text or into XSL Formatting Objects, which may subsequently be converted to other formats, such as PDF PostScript and PNG.\\nThe original document is not changed; rather, a new document is created based on the content of an existing one. Typically, input documents are XML files, but anything from which the processor can build an XQuery and XPath Data Model can be used, for example relational database tables, or geographical information systems.\\nXSLT is a Turing-complete language, meaning it can specify any computation that can be performed by a computer."],"rdfs:label":["XSLT"],"key:en":["xsl_transformations"],"ns:common.topic.official_website":["<http://www.w3.org/TR/xslt20/>"],"ns:book.book_subject.works":[{"ns:book.written_work.date_of_first_publication":["2001-08"],"key:en":["xslt"],"ns:book.written_work.subjects":["ns:m.087l8"],"ns:book.written_work.author":[],"ns:book.book.editions":["ns:m.0c9jtt8"],"ns:type.object.name":["XSLT"],"rdfs:label":["XSLT"],"rdf:type":["ns:common.topic"],"ns:kg.object_profile.prominent_type":["ns:book.book"],"ns:common.topic.notable_for":["ns:g.125cn8zk4"],"ns:common.topic.notable_types":["ns:m.01xryvm"]}],"ns:common.topic.article":[{"ns:common.document.text":["XSLT (Extensible Stylesheet Language Transformations) is a declarative, XML-based language used for the transformation of XML documents. The original document is not changed; rather, a new document is created based on the content of an existing one. The new document may be serialized (output) by the processor in standard XML syntax or in another format, such as HTML or plain text. XSLT is most often used to convert data between different XML schemas or to convert XML data into web pages or PDF documents.\\nApplications often use XSLT to convert XML data into HTML or XHTML documents for display as a web page. The transformation may happen dynamically either on a client or on a server, or it may be done as part of the publishing process. It is also used to create output for printing or direct video display, typically by transforming the original XML into XSL Formatting Objects to create formatted output which can then be converted to a variety of formats, including PDF, PostScript and PNG. XSLT can also translate XML messages between different XML schemas, or make changes to documents within the scope of a single schema, for example by removing the parts of a message that are not"],"ns:common.document.source_uri":["<http://wp/en/34211>"],"rdf:type":["ns:common.document"]}],"ns:computer.internet_protocol.software_used_by":["Virtuoso Universal Server"],"ns:computer.programming_language.introduced":["1998"],"ns:type.object.name":["XSLT"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259nb_b9"],"ns:computer.programming_language.language_paradigms":["ns:m.02ykw"],"ns:computer.programming_language.influenced":["ns:m.0w7msm6"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.02z3d4k"],"ns:computer.programming_language.influenced_by":["ns:m.05b4196"]}}