{"ns:m.083g1v":{"ns:common.topic.description":["Zonnon is a programming language along the Oberon, Modula, and Pascal language line. Jürg Gutknecht is the author of the programming language.\\nZonnon is a general purpose programming language in the Pascal, Modula-2 and Oberon family. Its conceptual model is based on objects, definitions, implementations and modules. Its computing model is concurrent, based on active objects which interact via syntax controlled dialogs. The language is being developed at ETH Zürich Institute for Computer Systems by Prof. Jürg Gutknecht. Zonnon introduces the concept of 'active objects' which are used to represent real world concurrent objects within computer programs. The Zonnon Language Report was written by Brian Kirk, and David Lightfoot working with Prof. Jürg Gutknecht and Dr. Eugene Zueff.\\nThe first book about Zonnon was published by the N. I. Lobachevsky State University of Nizhny Novgorod."],"rdfs:label":["Zonnon"],"key:en":["zonnon"],"ns:computer.programming_language.language_designers":["Jürg Gutknecht"],"ns:common.topic.article":[{"ns:common.document.text":["Zonnon is a general purpose programming language in the Pascal, Modula-2 and Oberon family. Its conceptual model is based on objects, definitions, implementations and modules. Its computing model is concurrent, based on active objects which interact via syntax controlled dialogs.\\nThe language is being developed at ETH Zürich Institute for Computer Systems by Prof. Jürg Gutknecht. Zonnon introduces the concept of 'active objects' which are used to represent real world concurrent objects within computer programs.\\nThe Zonnon Language Report was written by Brian Kirk (director at Robinsons Associates), and David Lightfoot (Oxford Brookes University) working with Prof. Jürg Gutknecht (ETH, Zürich) and Dr. Eugene Zueff (Moscow State University).\\nZonnon is a member of the Pascal family of languages, which has two beneficial consequences: a) it is a general purpose language and b) it is immediately familiar to Pascal, Modula-2 and Oberon programmers. Most Pascal programs from the domain of algorithms and data structures are successfully compiled by the Zonnon compiler after just a few minor modifications. However, from the perspective of “programming-in-the-large”, Zonnon is much more"],"ns:common.document.source_uri":["<http://wp/en/39516472>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Zonnon"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12599j92t"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0kzb_"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"]}}