{"ns:m.0c5d9p":{"ns:common.topic.description":["O-Matrix is a matrix programming language for mathematics, engineering, science, and financial analysis, marketed by Harmonic Software. The language is designed for use in high-performance computing.\\nO-Matrix provides an integrated development environment and a matrix-based scripting language. The environment includes mathematical, statistical, engineering and visualization functions. The set of analysis functions is designed for development of complex, computationally intensive scientific, mathematical and engineering applications.\\nThe integrated environment provides a mode that is largely compatible with version 4 of the MATLAB language in the commercial product from MathWorks. Certain features of MATLAB, such as non-numeric data types, error handling with try/catch, and nested and anonymous functions, are missing in O-Matrix.\\nThe O-Matrix environment includes a virtual machine of the O-Matrix language to enable re-distribution of applications."],"rdfs:label":["O-Matrix"],"key:en":["o-matrix"],"ns:common.topic.article":[{"ns:common.document.text":["O-Matrix is a matrix programming language for mathematics, engineering, science, and financial analysis, marketed by Harmonic Software. The language is designed for High-performance computing solutions.\\nO-Matrix is an integrated technical computing environment and matrix-based scripting language. The O-Matrix environment includes hundreds of mathematical, statistical, engineering and visualization functions. The diverse set of analysis functions enable the rapid development of complex, computationally intensive scientific, mathematical and engineering solutions.\\nThe O-Matrix integrated environment provides a mode that is largely compatible with version 4 of the MATLAB language in the commercial product from MathWorks. More recent features of MATLAB, such as non-numeric data types (structures, cell arrays and objects), error handling with try/catch, and nested and anonymous functions, are missing in O-Matrix.\\nThe O-Matrix environment includes a virtual machine of the O-Matrix language to enable re-distribution of solutions."],"ns:common.document.source_uri":["<http://wp/en/4492598>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["O-Matrix"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255kfstq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}