{"ns:m.09gdqsb":{"rdfs:label":["Newsqueak"],"ns:common.topic.description":["Squeak and its successor Newsqueak are concurrent programming languages for writing application software with interactive graphical user interfaces. Squeak was designed by Luca Cardelli and Rob Pike at Bell Labs in the first half of the 1980s; Newsqueak was a further development by Pike. Both languages were presented as \\\"a language for communicating with mice\\\": their main aim was to model the concurrent nature of programs interacting with multiple input devices, viz., keyboards and mice.\\nNewsqueak's syntax and semantics are influenced by the C language, but its approach to concurrency was inspired by C. A. R. Hoare's communicating sequential processes. However, in Newsqueak, channels are first-class objects, with dynamic process creation and dynamic channel creation.\\nNewsqueak was developed from an earlier, smaller, language, called Squeak. It was developed by Luca Cardelli and Rob Pike as a language for implementing graphical user interfaces.\\nThe ideas present in Newsqueak were further developed in the programming languages Alef, Limbo, and Go."],"key:en":["newsqueak"],"ns:common.topic.article":[{"ns:common.document.text":["Newsqueak is a concurrent programming language for writing application software for windowing systems. It was designed at Bell Labs by Rob Pike in the late 1980s.\\nNewsqueak's syntax and semantics are influenced by the C language, but its approach to concurrency was inspired by C. A. R. Hoare's communicating sequential processes (CSP). However, in Newsqueak, channels are first-class objects, with dynamic process creation and dynamic channel creation.\\nNewsqueak was developed from an earlier, smaller, language, called Squeak (not to be confused with the Smalltalk implementation Squeak). It was developed by Luca Cardelli and Rob Pike as a language for implementing graphical user interfaces.\\nThe ideas present in Newsqueak were further developed in the programming languages Alef, Limbo, and Go."],"ns:common.document.source_uri":["<http://wp/en/25051106>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Newsqueak"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1q5jb78s0"],"ns:computer.programming_language.influenced":["ns:m.0dsbpg6"],"ns:computer.programming_language.influenced_by":["ns:m.01t6b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"]}}