{"ns:m.08f3sg":{"ns:common.topic.description":["Language Integrated Query is a Microsoft .NET Framework component that adds native data querying capabilities to .NET languages, although ports exist for Java, PHP, JavaScript and ActionScript.\\nLINQ extends the language by the addition of query expressions, which are akin to SQL statements, and can be used to conveniently extract and process data from arrays, enumerable classes, XML documents, relational databases, and third-party data sources. Other uses, which utilize query expressions as a general framework for readably composing arbitrary computations, include the construction of event handlers or monadic parsers.\\nLINQ also defines a set of method names, along with translation rules used by the compiler to translate fluent-style query expressions into expressions using these method names, lambda expressions and anonymous types.\\nMany of the concepts that LINQ has introduced were originally tested in Microsoft's Cω research project. LINQ was released as a major part of .NET Framework 3.5 on November 19, 2007."],"rdfs:label":["Language Integrated Query"],"key:en":["language_integrated_query"],"ns:common.topic.article":[{"ns:common.document.text":["Language Integrated Query (LINQ, pronounced \\\"link\\\") is a Microsoft .NET Framework component that adds native data querying capabilities to .NET languages, although ports exist for Java, PHP and JavaScript.\\nLINQ defines a set of method names (called standard query operators, or standard sequence operators), along with translation rules from so-called query expressions to expressions using these method names, lambda expressions and anonymous types. These can, for example, be used to project and filter data into arrays, enumerable classes, XML (LINQ to XML), relational databases, and third party data sources. Other uses, which use query expressions as a general framework for composing readable arbitrary computations, include the construction of event handlers or monadic parsers.\\nMany of the concepts that LINQ has introduced were originally tested in Microsoft's Cω research project. LINQ was released as a part of .NET Framework 3.5 on November 19, 2007.\\nIn what follows, the descriptions of the operators are based on the application of working with collections.\\nThe set of query operators defined by LINQ is exposed to the user as the Standard Query Operator (SQO) API. The query operators"],"ns:common.document.source_uri":["<http://wp/en/13706337>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Language Integrated Query"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fvgpw5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.075st"]}}