{"ns:m.04zwp_z":{"ns:common.topic.description":["FACT was an early computer programming language, created by the Datamatic Division of Minneapolis Honeywell for its model 800 series business computers in 1959. FACT was an acronym for \\\"Fully Automated Compiling Technique\\\". It was an influence on the design of the COBOL programming language.\\nSome of the design of FACT was based on the linguistic project Basic English, developed about 1925 by C.K. Ogden.\\nThe software was actually designed by Computer Sciences Corporation under contract to Richard Clippinger of Honeywell."],"rdfs:label":["FACT"],"key:en":["fact_computer_language"],"ns:common.topic.article":[{"ns:common.document.text":["FACT was an early computer programming language, created by the Datamatic Division of Minneapolis Honeywell for its model 800 series business computers in 1959. FACT was an acronym for \\\"Fully Automated Compiling Technique\\\". It was an influence on the design of the COBOL programming language.\\nSome of the design of FACT was based on the linguistic project Basic English, developed about 1925 by C.K. Ogden.\\nThe software was actually designed by Computer Sciences Corporation (Fletcher Jones, Roy Nutt, and Robert L. Patrick) under contract to Richard Clippinger of Honeywell.\\nFACT was an influence in the design of COBOL, and is one of 3 predecessor languages credited in all COBOL manuals.\\nSeveral elements of FACT were incorporated into COBOL:\\nThere is some question if a working version of FACT was ever released by Honeywell. The language was designed, and a detailed specification released (see references), but it said that \\\"Computer Sciences Corporation also has the contract to implement FACT\\\", which seems to imply that they are still working on an implementation. About that time, the short range committee began developing COBOL, and Roy Nutt, 1 of the 3 principals of CSC began working"],"ns:common.document.source_uri":["<http://wp/en/20497946>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1959"],"ns:type.object.name":["FACT"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dxkf1r"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.01zpg"]}}