{"ns:m.04d88":{"ns:common.topic.description":["KRC is a lazy functional language developed by David Turner from November 1979 to October 1981 based on SASL, with pattern matching, guards and ZF expressions. Two implementations of KRC were written: David Turner's original one in BCPL running on EMAS, and Simon J. Croft's later one in C under Unix, and KRC was the main language used for teaching functional programming at the University of Kent at Canterbury from 1982 to 1985.\\nThe direct successor to KRC is Miranda, which includes a polymorphic type discipline based on that of Milner's ML."],"rdfs:label":["Kent Recursive Calculator"],"key:en":["kent_recursive_calculator"],"ns:computer.programming_language.language_designers":["David Turner"],"ns:common.topic.article":[{"ns:common.document.text":["KRC (Kent Recursive Calculator) is a lazy functional language developed by David Turner in (or before?) 1981 based on SASL, with pattern matching, guards and ZF expressions (now more usually called list comprehensions). Two implementations of KRC were written: David Turner's original one in BCPL running on EMAS, and Simon Croft's later one in C under Unix, and KRC was the main language used for teaching functional programming at the University of Kent at Canterbury (UK) from 1982 to 1985.\\nThe direct successor to KRC is Miranda, which includes a polymorphic type discipline based on that of Milner's ML.\\nThis article was originally based on material from the Free On-line Dictionary of Computing, which is licensed under the GFDL."],"ns:common.document.source_uri":["<http://wp/en/17224>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1981"],"ns:type.object.name":["Kent Recursive Calculator"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12567f03z"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.02ykw"],"ns:computer.programming_language.influenced":["ns:m.0n3xv"],"ns:computer.programming_language.influenced_by":["ns:m.04qxmx"]}}