{"ns:m.025tvjt":{"rdfs:label":["Mouse"],"ns:common.topic.description":["The Mouse programming language is a small computer programming language developed by Dr. Peter Grogono in the late 1970s and early 1980s. It was developed as an extension of an earlier language called MUSYS, which was used to control digital and analog devices in an electronic music studio.\\nMouse was originally intended as a small, efficient language for microcomputers with limited memory. It is an interpreted, stack-based language and uses Reverse Polish notation. To make an interpreter as easy as possible to implement, Mouse is designed so that a program is processed as a stream of characters, interpreted one character at a time.\\nThe elements of the Mouse language consist of a set of one-character symbols, each of which performs a specific function. Since variable names are limited to one character, there are only 26 possible variables in Mouse. Integers and characters are the only available data types.\\nDespite these limits, Mouse includes a number of relatively advanced features, including:\\nConditional branching\\nLoops\\nPointers\\nMacros\\nArrays\\nCode tracing\\nThe design of the Mouse language makes it ideal for teaching the design of a simple interpreter."],"ns:common.topic.article":[{"ns:common.document.text":["The Mouse programming language is a small computer programming language developed by Dr. Peter Grogono in the late 1970s and early 1980s. It was developed as an extension of an earlier language called MUSYS, which was used to control digital and analog devices in an electronic music studio.\\nMouse was originally intended as a small, efficient language for microcomputers with limited memory. It is an interpreted, stack-based language and uses Reverse Polish notation. To make an interpreter as easy as possible to implement, Mouse is designed so that a program is processed as a stream of characters, interpreted one character at a time.\\nThe elements of the Mouse language consist of a set of (mostly) one-character symbols, each of which performs a specific function (see table below). Since variable names are limited to one character, there are only 26 possible variables in Mouse (named A-Z). Integers and characters are the only available data types.\\nDespite these limits, Mouse includes a number of relatively advanced features, including:\\nThe design of the Mouse language makes it ideal for teaching the design of a simple interpreter. Much of the book describing Mouse is devoted to"],"ns:common.document.source_uri":["<http://wp/en/6378343>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Mouse"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2p9bw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}