{"ns:m.022s20":{"ns:common.topic.description":["CLIST is a procedural programming language for TSO in MVS systems. It originated in OS/360 Release 20 and has assumed a secondary role since the availability of Rexx in TSO/E Version 2.\\nIn its basic form, a CLIST program can take the form of a simple list of commands to be executed in strict sequence. However, CLIST also features If-Then-Else logic as well as loop constructs.\\nCLIST is an interpreted language. That is, the computer must translate a CLIST every time the program is executed. CLISTs therefore tend to be slower than programs written in compiled languages such as COBOL, FORTRAN, or PL/1.\\nCLIST can read/write MVS files and read/write from/to a TSO terminal. It can read parameters from the caller and also features a function to hold global variables and pass them between CLISTs. A CLIST can also call an MVS application program. CLISTs can be run in background. TSO I/O screens and menus using ISPF dialog services can be displayed by CLISTs."],"rdfs:label":["CLIST"],"key:en":["clist"],"ns:common.topic.article":[{"ns:common.document.text":["CLIST (Command List) (pronounced \\\"C-List\\\") is a procedural programming language for TSO in MVS systems. It originated in OS/360 Release 20 and has assumed a secondary role since the availability of Rexx in TSO/E Version 2.\\nIn its basic form, a CLIST program (or \\\"CLIST\\\" for short) can take the form of a simple list of commands to be executed in strict sequence (like a DOS batch file (*.bat) file). However, CLIST also features If-Then-Else logic as well as loop constructs.\\nCLIST is an interpreted language. That is, the computer must translate a CLIST every time the program is executed. CLISTs therefore tend to be slower than programs written in compiled languages such as COBOL, FORTRAN, or PL/1. (A program written in a compiled language is translated once to create a \\\"load module\\\" or executable.)\\nCLIST can read/write MVS files and read/write from/to a TSO terminal. It can read parameters from the caller and also features a function to hold global variables and pass them between CLISTs. A CLIST can also call an MVS application program (written in COBOL or PL/I, for example). CLISTs can be run in background (by running JCL which executes the TSO control program (IKJEFT01)). TSO I/O"],"ns:common.document.source_uri":["<http://wp/en/391542>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["CLIST"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256bxlr6"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}