{"ns:m.022l10":{"ns:common.topic.description":["Cg is a high-level shading language developed by Nvidia in close collaboration with Microsoft for programming vertex and pixel shaders. Cg is based on the C programming language and although they share the same syntax, some features of C were modified and new data types were added to make Cg more suitable for programming graphics processing units. This language is only suitable for GPU programming and is not a general programming language. The Cg compiler outputs DirectX or OpenGL shader programs. Since 2012, Cg is deprecated, with no additional development or support available."],"rdfs:label":["Cg"],"key:en":["cg_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Cg (short for C for Graphics) is a high-level shading language developed by Nvidia in close collaboration with Microsoft for programming vertex and pixel shaders. It is very similar to Microsoft's HLSL.\\nCg is based on the C programming language and although they share the same syntax, some features of C were modified and new data types were added to make Cg more suitable for programming graphics processing units.\\nThis language is only suitable for GPU programming and is not a general programming language.\\nThe Cg compiler outputs DirectX or OpenGL shader programs.\\nDue to technical advances in graphics hardware, some areas of 3D graphics programming have become quite complex. To simplify the process, new features were added to graphics cards, including the ability to modify their rendering pipelines using vertex and pixel shaders.\\nIn the beginning, vertex and pixel shaders were programmed at a very low level with only the assembly language of the graphics processing unit. Although using the assembly language gave the programmer complete control over code and flexibility, it was fairly hard to use. A portable, higher level language for programming the GPU was needed, so Cg was created"],"ns:common.document.source_uri":["<http://wp/en/390212>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Cg"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259pqwgj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}