{"ns:m.043jn7w":{"ns:common.topic.description":["Nu is an interpreted object-oriented programming language, with a Lisp-like syntax, created by Tim Burks as an alternative scripting language to program Mac OS X through its Cocoa application programming interface. Implementations also exist for Linux, and iPhone.\\nThe language was first announced at C4, a conference for indie Mac developers held in August 2007.\\nConsidered a niche tool, possibly because of its Lisp-like syntax, it is notable as part of a recent rise in use of functional programming languages."],"rdfs:label":["Nu"],"ns:common.topic.official_website":["<http://programming.nu/>"],"ns:common.topic.article":[{"ns:common.document.text":["Nu is an interpreted object-oriented programming language, with a Lisp-like syntax, created by Tim Burks as an alternative scripting language to program Mac OS X through its Cocoa application programming interface (API). Implementations also exist for Linux, and iPhone.\\nThe language was first announced at C4, a conference for indie Mac developers held in August 2007.\\nAlthough being for the moment confined as a niche tool, possibly because of its Lisp-like syntax, it is generally considered stable, and is notable as part of a recent rise in use of functional programming languages.\\nThis Nu code defines a simple complex numbers class.\\nThe example is a basic definition of a complex number: it defines the instance variables, and a method to initialize the object. It shows the similarity between the Nu code and the equivalent Objective-C code; it also shows the similarity with Ruby.\\nThis snippet, from the nuke tool bundled with Nu, also shows the influence of Objective-C, Lisp, and Ruby in the design of the language."],"ns:common.document.source_uri":["<http://wp/en/17151577>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm3csl"],"ns:common.webpage.uri":["<http://programming.nu/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.043jn7w"]}],"ns:computer.programming_language.introduced":["2007"],"ns:type.object.name":["Nu"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dysfgs"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.06ff5"]}}