{"ns:m.02471":{"ns:common.topic.description":["CLU is a pioneering programming language created at MIT by Barbara Liskov and her students between 1974 and 1975. While it did not find extensive use itself, it introduced many features that are now widely used, and is seen as a step in the development of object-oriented programming. However, it is not object-oriented itself, instead being considered \\\"object-based\\\", as it intentionally omitted many features of OOP.\\nKey contributions include abstract data types, call-by-sharing, iterators, multiple return values, type-safe parameterized types, and type-safe variant types. It is also notable for its use of classes with constructors and methods, but without inheritance."],"rdfs:label":["CLU"],"key:en":["clu"],"ns:common.topic.article":[{"ns:common.document.text":["CLU is a programming language created at MIT by Barbara Liskov and her students between 1974 and 1975. It was notable for its use of constructors for abstract data types that included the code that operated on them, a key step in the direction of object-oriented programming (OOP). However many of the other features of OOP are (intentionally) missing, notably inheritance, and the language is also hindered by a sometimes frustrating if elegant syntax.\\nThe syntax of CLU was based on ALGOL, then the starting point for most new language design. The key addition was the concept of a cluster, CLU's type extension system and the root of the language's name (CLUster). Clusters correspond generally to the concept of an \\\"object\\\" in an OO language, and have roughly the same syntax. For instance, here is the CLU syntax for a cluster that implements complex numbers:\\nCluster names are global, and no namespace mechanism was provided to group clusters or allow them to be created \\\"locally\\\" inside other clusters.\\nCLU does not perform implicit type conversions. In a cluster, the explicit type conversions 'up' and 'down' change between the abstract type and the representation. There is a universal type"],"ns:common.document.source_uri":["<http://wp/en/7575>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Barbara Liskov"],"ns:computer.programming_language.introduced":["1974"],"ns:type.object.name":["CLU"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bpghkz"],"ns:computer.programming_language.influenced":["ns:m.0n6y"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}