{"ns:m.06yp6q":{"ns:common.topic.alias":["Cache ObjectScript"],"ns:common.topic.description":["Caché ObjectScript is a part of the Caché database system sold by InterSystems. The language is a functional superset of the ANSI-standard MUMPS programming language. Since Caché is at its core a MUMPS implementation, it can run ANSI MUMPS routines with no change. To appeal as a commercial product, Caché implements support for object-oriented programming, a macro preprocessing language, embedded SQL for ANSI-standard SQL access to M's built-in database, procedure and control blocks using C-like brace syntax, procedure-scoped variables, and relaxed whitespace syntax limitations.\\nThe language has private and public variables and globals. Global has a different meaning in this language than in most; such variables are global across routines, processes, and sessions. Thus, editing a global variable is making permanent and immediate changes to a system-universal database. The scope of a private variable is the local function, the scope of a public variable is the entire process. Variables, private and public, may be single elements or complete multi-dimensional arrays.\\nThe great majority of Caché's feature-set is inherited from the ANSI MUMPS standard."],"rdfs:label":["Caché ObjectScript"],"key:en":["cache_objectscript"],"ns:computer.programming_language.language_designers":["InterSystems"],"ns:common.topic.article":[{"ns:common.document.text":["Caché ObjectScript is a part of the Caché database system sold by Intersystems Corp. The language is a functional superset of the ANSI-standard M (i.e. MUMPS) programming language. MUMPS programmers can run existing MUMPS routines under Caché with little or no change. Caché ObjectScript offers a number of additions to ANSI-standard M including integrated support for object-oriented programming, procedure and control blocks using { } syntax and relaxed whitespace limitations.\\nThe language has private and public variables and globals. Global has a different meaning in this language than in most; it does not refer only to scope but also to permanence. Globals refer directly to items stored in the hierarchical database. Any global that is SET will retain its value across system shutdowns. Also, all globals have universal scope.\\nThe scope of a private variable is the local function, the scope of a public variable is the entire process. Variables, private and public, may be single elements or complete multi-dimensional arrays.\\nAn interesting characteristic of hierarchical databases is that the data is always sorted (basically the data structure is a B-tree). There are no sorting"],"ns:common.document.source_uri":["<http://wp/en/2242790>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1997"],"ns:type.object.name":["Caché ObjectScript"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12590jrfh"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.04zs6"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}