{"ns:m.026krmt":{"ns:common.topic.description":["Business Application Language was originally defined by Honeywell in 1973 and the major diffusion was in their system '80-'90 in Europe with the work of French firm Prologue S.A. that used BAL for programming on their proprietary Operative System.\\nIn 1986 the language was ported to the Unix platform by GuyPes. The first development environment, named Balix, are distributed starting in 1988 in Italy and France. A different evolution path was made by Prologue S.A., named ABAL, in 1992.\\nThe evolution of Balix, developed in Italy, is called B2U developed by GuyPes, and are used for a Banking Information System that are used by one hundred banks in Italy."],"rdfs:label":["Business application language"],"key:en":["b_a_l"],"ns:common.topic.article":[{"ns:common.document.text":["In computer programming, BAL (an acronym for Business Application Language) refers to a high-level programming language similar to BASIC.\\nIt was originally defined by Honeywell in 1973 and the major diffusion was in their system '80-'90 in Europe with the work of French firm Prologue S.A. that used BAL for programming on their proprietary Operative System (Prologue).\\nIn 1986 the language was ported to the Unix platform by GuyPes. The first development environment, named Balix, are distributed starting in 1988 in Italy and France. A different evolution path was made by Prologue S.A., named ABAL, in 1992.\\nThe evolution of Balix, developed in Italy, is called B2U (an acronym for Business under UNIX) developed by GuyPes, and are used for a Banking Information System that are used by one hundred banks in Italy."],"ns:common.document.source_uri":["<http://wp/en/7937393>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Business application language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256h5mp1"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}