{"ns:m.03r1wd":{"ns:common.topic.description":["Claire is a high-level functional and object-oriented programming language with rule processing abilities. It was designed by Yves Caseau at Bouygues' e-Lab research laboratory, and received its final definition in 2004.\\nClaire provides:\\na simple object system with parametric classes and methods\\npolymorphic and parametric functional programming\\nproduction rules triggered by events\\nversioned snapshots of the state of the whole system, or any part, supporting rollback and easy exploration of search spaces\\nexplicit relations between entities; for example, two entities might be declared inverses of one another\\nfirst-class sets with convenient syntax for set-based programming\\nan expressive set-based type system allowing both second-order static and dynamic typing\\nClaire's reference implementation, consisting of an interpreter and compiler, was fully open-sourced with the release of version 3.3.46 in February 2009. Another implementation, WebClaire, is commercially supported."],"rdfs:label":["Claire"],"key:en":["claire_programming_language"],"ns:computer.programming_language.language_designers":["Yves Caseau"],"ns:common.topic.article":[{"ns:common.document.text":["Claire is a high-level functional and object-oriented programming language with rule processing abilities. It was designed by Yves Caseau at Bouygues' e-Lab research laboratory, and received its final definition in 2004.\\nClaire provides:\\nClaire's reference implementation, consisting of an interpreter and compiler, was fully open-sourced with the release of version 3.3.46 in February 2009. Another implementation, WebClaire, is commercially supported.\\nClaire is a general-purpose programming language, best suited to application software requiring sophisticated data modeling, rule processing or problem solving. WebClaire adds extensions for fuller integration with the operating system and for programming web applications.\\nThough Claire can be used for complete projects, it is designed to integrate smoothly with C++ or Java: Claire programs may include C++ or Java code, and Claire code may be translated into C++ or Java for use in C++ or Java projects.\\nThe key set of features that distinguishes Claire from other programming languages has been dictated by experience in solving complex optimization problems. Two features not found in other mixed functional/object-oriented languages, such"],"ns:common.document.source_uri":["<http://wp/en/930956>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1994"],"ns:type.object.name":["Claire"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12561xlqr"],"ns:computer.programming_language.influenced_by":["ns:m.070d2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}