{"ns:m.03ff_9":{"ns:common.topic.description":["CPL is a multi-paradigm programming language, that was developed in the early 1960s."],"rdfs:label":["CPL"],"key:en":["combined_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["CPL (from Combined Programming Language and Cambridge Programming Language before that) was a multi-paradigm programming language, that was developed in the early 1960s.\\nCPL was developed jointly between the Mathematical Laboratory at the University of Cambridge and the University of London Computer Unit during the 1960s hence CPL gained the nickname \\\"Cambridge Plus London\\\". The collaborative effort was responsible for the \\\"Combined\\\" in the name of the language (previously, the name was Cambridge Programming Language). D. W. Barron and Christopher Strachey were involved (for others see paper). In 1963 (when the paper was published) it was currently being implemented on the Titan Computer at Cambridge and the Atlas Computer at London.\\nIt was heavily influenced by ALGOL 60, but instead of being extremely small, elegant and simple, CPL was intended for a wider application area than scientific calculations and was therefore much more complex and not as elegant as ALGOL 60. CPL was a big language for its time. CPL attempted to go beyond ALGOL to include industrial process control and business data processing, among other things. CPL was also intended to allow low-level programming and"],"ns:common.document.source_uri":["<http://wp/en/828614>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1963"],"ns:type.object.name":["CPL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12577x2j2"],"ns:computer.programming_language.influenced":["ns:m.03wfgb"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}