{"ns:m.08c73m":{"rdfs:label":["Ana"],"ns:common.topic.description":["In contexts of solar physics and data analysis, Ana is a somewhat whimsically named computer language that is designed for array processing and image data analysis. The name is an acronym for \\\"A Non Acronym\\\". Ana began as a fork of an early version of IDL, but has diverged significantly since then.\\nIt is in common use at the Lockheed-Martin Space Applications Laboratory and at institutions that analyze data from the TRACE spacecraft, but is not commonly used elsewhere. Ana appears to be intended as free software though it is not distributed under a recognized FOSS license. It is available as source code, primarily through the Solarsoft distribution system.\\nThe most commonly used application written in Ana is the TRACE image browser, which is designed for browsing and viewing time-lapse movies collected by TRACE, SOHO, Yohkoh, and other observatories.\\nAna homepage:"],"ns:common.topic.article":[{"ns:common.document.text":["In contexts of solar physics and data analysis, ana is a somewhat whimsically named computer language that is designed for array processing and image data analysis. The name is an acronym for \\\"A Non Acronym\\\". Ana began as a fork of an early version of IDL, but has diverged significantly since then. It is in common use at the Lockheed-Martin Space Applications Laboratory and at institutions that analyze data from the TRACE spacecraft, but is not commonly used elsewhere. Ana appears to be intended as free software though it is not distributed under a recognized FOSS license. It is available as source code, primarily through the Solarsoft distribution system.\\nThe most commonly used application written in ana is the TRACE image browser, which is designed for browsing and viewing time-lapse movies collected by TRACE, SOHO, Yohkoh, and other observatories.\\nANA homepage:"],"ns:common.document.source_uri":["<http://wp/en/2914183>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Ana"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b5xvdf"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}