{"ns:m.01dpgv":{"key:user.avh.ellerdale":["0081-0027"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0081-0027"],"ns:common.topic.alias":["VB.NET"],"ns:common.topic.description":["Visual Basic .NET is a multi-paradigm, high level programming language, implemented on the .NET Framework. Microsoft launched VB.NET in 2002 as the successor to its original Visual Basic language. Although the \\\".NET\\\" portion was dropped in 2005, this article uses \\\"Visual Basic .NET\\\" to refer to all Visual Basic languages releases since 2002, in order to distinguish between them and the classic Visual Basic. Along with Visual C#, it is one of the two main languages targeting the .NET framework.\\nMicrosoft's integrated development environment for developing in Visual Basic .NET language is Visual Studio. Most of Visual Studio editions are commercial; the only exceptions are Visual Studio Express and Visual Studio Community which are freeware. In addition, .NET Framework SDK includes a freeware command-line compiler called vbc.exe. Mono also includes a command-line VB.NET compiler."],"rdfs:label":["Visual Basic .NET"],"key:en":["visual_basic_net"],"ns:common.topic.official_website":["<http://www.msdn.microsoft.com/vbasic>"],"ns:common.topic.article":[{"ns:common.document.text":["Visual Basic .NET (VB.NET), is an object-oriented computer programming language that can be viewed as an evolution of the classic Visual Basic (VB), which is implemented on the .NET Framework. Microsoft currently supplies two main editions of IDEs for developing in Visual Basic: Microsoft Visual Studio 2010, which is commercial software and Visual Basic Express Edition 2010, which is free of charge. The command-line compiler, VBC.EXE, is installed as part of the freeware .NET Framework SDK. Mono also includes a command-line VB.NET compiler.\\nThere are 5 versions of Visual Basic .NET implemented by the Visual Basic team.\\nFirst version of Visual Basic .NET, which run on .NET framework 1.0. The most important feature is Managed code, which contrasts with Visual Basic 6.0 and before.\\nVisual Basic .NET 2003 was released with version 1.1 of the .NET Framework. New features included support for the .NET Compact Framework and a better VB upgrade wizard. Improvements were also made to the performance and reliability of the .NET IDE (particularly the background compiler) and runtime. In addition, Visual Basic .NET 2003 was available in the Visual Studio.NET Academic Edition (VS03AE). VS03AE"],"ns:common.document.source_uri":["<http://wp/en/208996>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Microsoft Corporation"],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://msdn.microsoft.com/en-us/vstudio/hh388568>"],"ns:common.webpage.resource":["ns:m.0bjkp0l"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.01dpgv"]}],"ns:computer.programming_language.introduced":["2001"],"ns:type.object.name":["Visual Basic .NET"],"rdf:type":["ns:user.uoa_it.uoa_it.uoa_technology"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12557t6mc"],"ns:computer.programming_language.influenced_by":["ns:m.0fp_1y"],"ns:computer.programming_language.language_paradigms":["ns:m.0qjrr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.04ygytb"],"ns:user.uoa_it.uoa_it.uoa_technology.used_for":["ns:m.06vx42c"]}}