{"ns:m.061wdk":{"ns:common.topic.description":["Autocoder was the name given to certain assemblers for a number of IBM computers of the 1950s and 1960s. The first Autocoders appear to have been the earliest assemblers to provide a macro facility.\\nThe term autocoder needs to be distinguished from autocode, a term of the same era which was used in the UK for languages of a higher level. Both terms derive from the phrase automatic coding, which referred generally to programs which eased the burden of producing the numeric machine language codes of programs. In some circles \\\"autocoder\\\" could be used in a rather generic way to refer to what is now called a macro-assembler.\\nThe first Autocoders were released in 1955 for the IBM 702 and in 1956 for the almost compatible IBM 705. They were designed by Roy Goldfinger who earlier had worked on New York University's NYAP assembler. These machines were variable word length commercial machines, as were many of the computers for which an Autocoder was released.\\nBesides the 702 and 705, there eventually also were Autocoders for the IBM 7010, IBM 7030, IBM 7070, IBM 7080, and the IBM 1400 series."],"rdfs:label":["Autocoder"],"key:en":["autocoder"],"ns:common.topic.article":[{"ns:common.document.text":["Autocoder was the name given to certain assemblers for a number of IBM computers of the 1950s and 1960s. The first Autocoders appear to have been the earliest assemblers to provide a macro facility.\\nThe term autocoder needs to be distinguished from autocode, a term of the same era which was used in the UK for languages of a higher level. Both terms derive from the phrase automatic coding, which referred generally to programs which eased the burden of producing the numeric machine language codes of programs. (\\\"Autocoding\\\" is seen occasionally, and can refer to any kind of programming system.) In some circles \\\"autocoder\\\" could be used in a rather generic way to refer to what is now called a macro-assembler.\\nThe first Autocoders were released in 1955 for the IBM 702 and in 1956 for the almost compatible IBM 705. They were designed by Roy Goldfinger who earlier had worked on New York University's (NYU) NYAP assembler. These machines were variable word length commercial machines, as were many of the computers for which an Autocoder was released.\\nBesides the 702 and 705, there eventually also were Autocoders for the IBM 7010, IBM 7030 (Stretch), IBM 7070, IBM 7080, and the IBM 1400"],"ns:common.document.source_uri":["<http://wp/en/1861435>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Autocoder"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256p9d_0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}