{"ns:m.07_n5r":{"rdfs:label":["Laning and Zierler system"],"ns:common.topic.description":["The Laning and Zierler system was one of the first operating algebraic compilers, that is, a system capable of accepting mathematical formulae in algebraic notation and producing equivalent machine code. It was implemented in 1954 for the MIT WHIRLWIND by J. Halcombe Laning and Neal Zierler. It is preceded by the UNIVAC A-2, IBM Speedcoding and a number of systems that were proposed but never implemented."],"key:en":["laning_and_zierler_system"],"ns:common.topic.article":[{"ns:common.document.text":["The Laning and Zierler system (sometimes called \\\"George\\\" by its users) was one of the first operating algebraic compilers, that is, a system capable of accepting mathematical formulae in algebraic notation and producing equivalent machine code. It was implemented in 1954 for the MIT WHIRLWIND by J. Halcombe Laning and Neal Zierler. It is preceded by the UNIVAC A-2, IBM Speedcoding and a number of systems that were proposed but never implemented.\\nThe literature sometimes refers to the Laning and Zierler system as a compiler. In the 1950s, however, compiler meant what we might today call a linking loader (see Linker and Loader) or an assembler. Laning and Zieler described their work as a \\\"system of automatic coding\\\" and the language is very similar to Tony Brooker's Manchester Autocodes, sitting somewhere between Mercury Autocode and Atlas Autocode in complexity. The remainder of this article will use the word system.\\nThe system accepted formulae in a more or less algebraic notation. It respected the standard rules for operator precedence, allowed nested parentheses, and used superscripts to indicate exponents. It was among the first programming systems to allow symbolic variable"],"ns:common.document.source_uri":["<http://wp/en/2732031>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Laning and Zierler system"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b02lsw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}