{"ns:m.03cjm6":{"ns:common.topic.description":["XBL is an XML-based markup language used to declare the behavior and look of XUL-widgets and XML elements. Development of the XBL specification was abandoned by the W3C in 2012.\\nXBL was developed by the Mozilla project for use in the Mozilla Application Suite; the language is not currently described by any formal standard and is thus proprietary to Mozilla, with the only implementation being the Gecko layout engine. XBL 2.0 is the latest version of XBL."],"rdfs:label":["XBL"],"key:en":["xbl"],"ns:common.topic.article":[{"ns:common.document.text":["XBL (XML Binding Language) is an XML-based markup language used to declare the behavior and look of XUL-widgets and XML elements.\\nXBL was developed by the Mozilla project for use in the Mozilla Application Suite; the language is not currently described by any formal standard and is thus proprietary to Mozilla, with the only implementation being the Gecko layout engine. XBL 2.0 is the new version of XBL, which is in process of being standardized by the World Wide Web Consortium.\\nIn XUL one defines the user interface layout of an application, and then by applying \\\"styles\\\" one can customize the look of various elements. The drawback is that XUL provides no means to change an element's function. For example, one might want to change how the pieces of a scroll bar work. This is where XBL comes in.\\nAn XBL file contains \\\"bindings\\\", each of which describes the behavior of a XUL-widget or XML element. For example, a binding might be attached to a scroll bar. The behavior describes the properties and methods of the scroll bar and also describes the XUL elements defining the scroll bar.\\nThe root element of an XBL file is the <bindings> element, which contain one or more <binding> elements."],"ns:common.document.source_uri":["<http://wp/en/793475>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["XBL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dz7bzd"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}