{"ns:m.04gnjjy":{"ns:common.topic.description":["chomski virtual machine and pp refer to both a command line computer language and utility which can be used to parse and transform text patterns. The utility reads input files character by character, applying the operation which has been specified via the command line or a pp script, and then outputs the line. It was developed from 2006 as a Unix and Windows utility, and is available today for Windows and Linux systems. Pp has derived a number of ideas and syntax elements from Sed, a command line text stream editor."],"key:en":["chomski"],"rdfs:label":["chomski"],"ns:common.topic.official_website":["<http://bumble.sourceforge.net/machine/>"],"ns:common.topic.article":[{"ns:common.document.text":["chomski virtual machine (named after the noted linguist Noam Chomsky) and pp (the pattern parser) refer to both a command line computer language and utility (interpreter for that language) which can be used to parse and transform text patterns. The utility reads input files character by character (sequentially), applying the operation which has been specified via the command line or a pp script, and then outputs the line. It was developed from 2006 as a Unix and Windows utility, and is available today for Windows and Linux systems. Pp has derived a number of ideas and syntax elements from Sed, a command line text stream editor.\\nThe chomski language uses many ideas taken from sed, the Unix stream editor. For example, sed includes two virtual variables or data buffers, known as the \\\"pattern space\\\" and the \\\"hold space\\\". These two variables constitute an extremely simple virtual machine. In the Chomski language this virtual machine has been augmented with several new buffers or registers along with a number of commands to manipulate these buffers.\\nThe chomski virtual machine includes a tape data structure as well as a stack (data structure), along with a \\\"workspace\\\" (which is the"],"ns:common.document.source_uri":["<http://wp/en/18718048>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm38kl"],"ns:common.webpage.uri":["<http://bumble.sourceforge.net/machine/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.04gnjjy"]}],"ns:computer.programming_language.introduced":["2007"],"ns:type.object.name":["chomski"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bm51ss"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q2c"]}}