{"ns:m.01fk4":{"ns:common.topic.description":["B is a programming language developed at Bell Labs circa 1969. It is the work of Ken Thompson with Dennis Ritchie.\\nB was derived from BCPL, and its name may be a contraction of BCPL. Thompson's coworker Dennis Ritchie speculated that the name might be based on Bon, an earlier, but unrelated, programming language that Thompson designed for use on Multics.\\nB was designed for recursive, non-numeric, machine independent applications, such as system and language software."],"rdfs:label":["B"],"key:en":["b_programming_language"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ビーげんご"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["B is a programming language that was developed at Bell Labs. It is almost extinct, as it was replaced with the C language. It was mostly the work of Ken Thompson, with contributions from Dennis Ritchie, and first appeared circa 1969.\\nKen Thompson wrote B basing it mainly on the BCPL language he had used to write Unix while in the Multics project. B was essentially the BCPL system stripped of any component that Thompson felt he could do without, in order to make it fit within the memory capacity of the minicomputers of the time. The language also included some changes made to suit Thompson's preferences (mostly along the lines of reducing the number of non-whitespace characters in a typical program).\\nLike BCPL and FORTH, B had only one datatype: the computer word. Most operators (e.g., +, -, *, /) treated this as an integer, but others treated it as a memory address to be dereferenced. In many other ways it looked a lot like an early version of C. A few library functions existed, including some that vaguely resemble functions from the standard I/O library in C.\\nEarly implementations were for the DEC PDP-7 and PDP-11 minicomputers using early Unix, and Honeywell 36-bit mainframes"],"ns:common.document.source_uri":["<http://wp/en/4475>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Ken Thompson"],"ns:computer.programming_language.introduced":["1969"],"ns:type.object.name":["B"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258t0kws"],"ns:computer.programming_language.influenced_by":["ns:m.05xjv"],"ns:computer.programming_language.influenced":["ns:m.01t6b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"]}}