{"ns:m.08yy56":{"ns:common.topic.description":["ColdC is a programming language, originally designed for ColdMUD by Greg Hudson in 1993, but with some applications in fields unrelated to MUDs. It is a dynamically typed prototype-based object oriented system, with a syntax derived from the C programming language. It is similar to the MOO programming language in that it operates in a runtime which provides persistence and network access.\\nColdC includes many of the attributes that made their debut with the CoolMUD system and programming language, such as:\\nInstance variables are all private and not externally visible. Methods must be written to expose them. This is similar to early object-oriented languages such as Smalltalk.\\nThere are no builtin properties for owner and location like in MOO. This was done partly to simplify the language and partly to permit more versatile applications.\\nThere are no facilities for ownership of objects or code security, as strong encapsulation permits these facilities to be written in the ColdC language itself.\\nMultiple parent relationships, that is multiple objects from which an object can inherit behaviour.\\nIn addition, there are some specific innovations that ColdC added:"],"rdfs:label":["ColdC"],"key:en":["coldc"],"ns:common.topic.article":[{"ns:common.document.text":["ColdC is a programming language, originally designed for ColdMUD by Greg Hudson in 1993, but with some applications in fields unrelated to MUDs. It is a dynamically typed prototype-based object oriented system, with a syntax derived from the C programming language. It is similar to the MOO programming language in that it operates in a runtime which provides persistence (through an object database) and network access.\\nColdC includes many of the attributes that made their debut with the CoolMUD system and programming language, such as:\\nIn addition, there are some specific innovations that ColdC added:"],"ns:common.document.source_uri":["<http://wp/en/3201475>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1993"],"ns:type.object.name":["ColdC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cvc_hm"],"ns:computer.programming_language.influenced_by":["ns:m.0521z"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.0gkc5"]}}