{"ns:m.02pmq0l":{"ns:common.topic.description":["Concurrent Pascal was designed by Per Brinch Hansen for writing concurrent computing programs such as operating systems and real-time monitoring systems on shared memory computers.\\nA separate language, Sequential Pascal, is used as the language for applications programs run by the operating systems written in Concurrent Pascal. Both languages are extensions of Niklaus Wirth's Pascal, and share a common threaded code interpreter. The following describes how Concurrent Pascal differs from Wirth's Pascal."],"rdfs:label":["Concurrent Pascal"],"key:en":["concurrent_pascal"],"ns:common.topic.article":[{"ns:common.document.text":["Concurrent Pascal (also known as PASCAL-FC) was designed by Per Brinch Hansen for writing concurrent computing programs such as operating systems and real-time monitoring systems on shared memory computers.\\nA separate language, Sequential Pascal, is used as the language for applications programs run by the operating systems written in Concurrent Pascal. Both languages are extensions of Niklaus Wirth's Pascal, and share a common threaded code interpreter. The following describes how Concurrent Pascal differs from Wirth's Pascal.\\nSeveral constructs in Pascal were removed from Concurrent Pascal for simplicity and security:\\nThese omissions make it possible to guarantee, by a combination of compile-time checks and minimal run-time checking in the threaded-code interpreter, that a program can not damage itself or another program by addressing outside its allotted space.\\nConcurrent Pascal includes class, monitor, and process data types. Instances of these types are declared as variables, and initialized in an init statement.\\nClasses and monitors are similar: both package private variables and procedures with public procedures (called procedure entries). A class instance can be used by"],"ns:common.document.source_uri":["<http://wp/en/9637343>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Concurrent Pascal"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258h83ht"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0bxzs64"]}}