{"ns:m.06yljz":{"ns:common.topic.description":["Stagecast Creator is a visual programming language intended for use in teaching programming to children. It is based on the programming by demonstration concept, where rules are created by giving examples of what actions should take place in a given situation. It can be used to construct simulations, animations and games, which run under Java on any suitable platform."],"rdfs:label":["Stagecast Creator"],"key:en":["stagecast_creator"],"ns:common.topic.article":[{"ns:common.document.text":["Stagecast Creator is a visual programming language intended for use in teaching programming to children. It is based on the programming by demonstration concept, where rules are created by giving examples of what actions should take place in a given situation. It can be used to construct simulations, animations and games, which run under Java on any suitable platform.\\nWhat is today known as Creator originally started as a project by Allen Cypher and David Canfield Smith in Apple's Advanced Technology Group (ATG) known as KidSim. As the name implies, it was intended to allow kids to construct their own simulations, reducing the programming task to something that anyone could handle. Programming in Creator uses graphical rewrite rules augmented with non-graphical tests and actions.\\nIn 1994, Kurt Schmucker became the project manager, and under him, the project was renamed Cocoa, and expanded to include a Netscape plug-in. It was also repositioned as \\\"Internet Authoring for Kids\\\", as the Internet was becoming increasingly accessible. The project was officially announced on May 13, 1996. There were three releases:\\nWhen Steve Jobs returned to Apple in 1997, he began dismantling a number"],"ns:common.document.source_uri":["<http://wp/en/2241788>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Stagecast Creator"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259w1fvf"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}