{"ns:m.028by64":{"rdfs:label":["CyberQuery"],"ns:common.topic.description":["Cyberquery is a software product of Cyberscience Corporation Inc. Originally developed for data handling and analysis on Data General AOS and AOS/VS minicomputers, then the available platforms for Cyberquery were extended to all major UNIX platforms, VAX/VMS from Digital Equipment Corporation and all the way down to personal computers and Microsoft Windows."],"key:en":["cyberquery"],"ns:common.topic.article":[{"ns:common.document.text":["Cyberquery is a software product of Cyberscience Corporation Inc. Originally developed for data handling and analysis on Data General AOS and AOS/VS minicomputers, then the available platforms for Cyberquery were extended to all major UNIX platforms, VAX/VMS from Digital Equipment Corporation and all the way down to personal computers and Microsoft Windows.\\nInvented in 1980, Cyberquery is a declarative \\\"4GL\\\" fourth-generation programming language. Its early design was slightly influenced by RAMIS and other data access and analysis languages such as the query language on GE time sharing systems. Cyberquery automates the process of accessing files or tables and reading records or rows. This basic operation allows the user/developer to concentrate on the details of working with the data within each record, in effect working almost entirely within an implicit program loop that runs for each record. Compared to general-purpose programming languages, this automation allows the user/developer to ignore the technical details of the data and how it is stored, and concentrate on the information contained in the data.\\nCyberquery has a data dictionary to describe the datasets users wish to"],"ns:common.document.source_uri":["<http://wp/en/9488298>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["CyberQuery"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125gv11ml"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}