{"ns:m.019wx":{"ns:common.topic.description":["BCPL is a procedural, imperative, and structured computer programming language designed by Martin Richards of the University of Cambridge in 1966."],"rdfs:label":["BCPL"],"key:en":["bcpl"],"ns:computer.programming_language.language_designers":[],"ns:common.topic.article":[{"ns:common.document.text":["BCPL (Basic Combined Programming Language) is a procedural, imperative, and structured computer programming language designed by Martin Richards of the University of Cambridge in 1966.\\nOriginally intended for writing compilers for other languages, BCPL is no longer in common use. However, its influence is still felt because a stripped down and syntactically changed version of BCPL, called B, was the language on which the C programming language was based. This important fact led many C programmers to humorously issue the backronym Before C Programming Language. BCPL was the first brace programming language, and the braces survived the syntactical changes and have become a common means of denoting program source code statements. In practice, on limited keyboards of the day, source programs often used the sequences $( and )$ in place of the symbols { and }. The single-line '//' comments of BCPL, which were not taken up in C, reappeared in C++, and later in C99.\\nBCPL was a response to difficulties with its predecessor Combined Programming Language (CPL), created during the early 1960s. Richards created BCPL by \\\"removing those features of the full language which make compilation"],"ns:common.document.source_uri":["<http://wp/en/4052>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1966"],"ns:type.object.name":["BCPL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12585j52h"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:computer.programming_language.influenced":["ns:m.0fl2d"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.03ff_9"]}}