{"ns:m.02r5chy":{"ns:common.topic.alias":["BPL - Beginners Programming Langauge"],"rdfs:label":["Beginners Programming Language"],"key:en":["bpl_beginners_programming_langauge"],"ns:common.topic.article":[{"ns:common.document.text":["Beginners Programming Language, abbreviated as BPL is a general purpose programming language that aims to provide a more accessible syntax to beginners. It claims to let them learn in 20 minutes . BPL 2010 is inspired by Liberty Basic and AutoIt.\\nIts development was started by U.K. based programmer Ashley Hunter,whose first programming language was Leopard which was written in Liberty Basic. After learning Leopard, he learnt Liberty Basic and then started the BPL project in it during 2005. He was later joined by Joseph Thompson.\\nBPL 1.2 was the first version for general release, but it had many problems. Users complained of a confusing help file, buggy code and low functionality, especially in the GUI. It was totally dependent on a runtime JIT compiler written in Liberty BASIC, which in turn runs on a Smalltalk written JIT engine for Liberty BASIC.\\nBPL 2010 had the ability to create standalone executable files. Version 2010 was also based upon the runtime JET compiler concept but now some parts, such as the stand alone executable bundle system, were written in the automation language AutoIt. To allow programmers to distribute BPL programs more easily, an executable bundle with all"],"ns:common.document.source_uri":["<http://wp/en/35627411>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.beginnersprogramming.com/Index/Home_Page.html>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.02r5chy"]}],"ns:type.object.name":["Beginners Programming Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12595vgzr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0dzjl"]}}