{"ns:m.011k7v":{"rdfs:label":["CORC"],"ns:common.topic.description":["CORC, was a simple computer language developed at Cornell University in 1962 to serve lay users, namely, for students to use to solve math problems. Its developers, industrial engineering professors Richard Conway and William Maxwell and mathematics professor Robert J. Walker, sought to create a diagnostic compiler in PL/I which could both expose math and engineering students to computing and remove the burden of mechanical problem-solving from their professors.\\nCORC was designed with ease of use in mind. In contrast to the BASIC programming language under contemporaneous development at Dartmouth College, it used English language statements. Since programs were tediously input with punched cards, the compiler had a high tolerance for error, attempting to bypass or even correct problem sections of code. Students could submit a program by 5 PM which would be compiled or run overnight, with results available the next morning.\\nIt was initially run on the Burroughs 220 and later extended to the Control Data Corporation CDC 1604. In 1966 it was superseded by CUPL, a batch compiler for teaching which ran on the IBM System/360."],"key:en":["corc"],"ns:common.topic.article":[{"ns:common.document.text":["CORC (after CORnell Compiler), was a simple computer language developed at Cornell University in 1962 to serve lay users, namely, for students to use to solve math problems. Its developers, industrial engineering professors Richard Conway and William Maxwell and mathematics professor Robert J. Walker, sought to create a diagnostic compiler in PL/I which could both expose math and engineering students to computing and remove the burden of mechanical problem-solving from their professors.\\nCORC was designed with ease of use in mind. In contrast to the BASIC programming language under contemporaneous development at Dartmouth College, it used English language statements. Since programs were tediously input with punched cards, the compiler had a high tolerance for error, attempting to bypass or even correct problem sections of code. Students could submit a program by 5 PM which would be compiled or run overnight, with results available the next morning.\\nIt was initially run on the Burroughs 220 and later extended to the Control Data Corporation CDC 1604. In 1966 it was superseded by CUPL, a batch compiler for teaching which ran on the IBM System/360.\\nAn extension of CORC, the Cornell"],"ns:common.document.source_uri":["<http://wp/en/140641>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["CORC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12590c6h0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}