{"ns:m.03sl11":{"rdfs:label":["NELIAC"],"ns:common.topic.description":["The Navy Electronics Laboratory International ALGOL Compiler or NELIAC is a dialect and compiler implementation of the ALGOL 58 programming language developed by the Naval Electronics Laboratory in 1958.\\nIt was designed for numeric and logical computations and was the first language to provide a bootstrap implementation."],"key:en":["neliac"],"ns:common.topic.article":[{"ns:common.document.text":["The Navy Electronics Laboratory International ALGOL Compiler or NELIAC is a dialect and compiler implementation of the ALGOL 58 programming language developed by the Naval Electronics Laboratory in 1958.\\nIt was designed for numeric and logical computations and was the first language to provide a bootstrap implementation.\\nNELIAC was the brainchild of Harry Huskey — then Chairman of the ACM and a well known computer scientist, and supported by Maury Halstead, the head of the computational center at NEL. The earliest version was implemented on the prototype USQ-17 computer (called \\\"the Countess\\\") at the laboratory. It was the world's first self-compiling compiler. This means that the compiler was first coded in simplified form in assembly language \\\"the bootstrap\\\", and then re-written in its own language, compiled by this \\\"bootstrap\\\" compiler, and re-compiled by itself, making the \\\"bootstrap\\\" obsolete.\\nIt is called a variant of ALGOL 58 because of similarities to that language, but, shortly after the ALGOL committee produced other versions of ALGOL, and NELIAC and ALGOL parted ways.\\nThe compiler was used on the Countess to produce a version for the CDC 1604, and later self-compiled on"],"ns:common.document.source_uri":["<http://wp/en/949068>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["NELIAC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125btrl_3"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}