{"ns:m.06_s5g":{"ns:common.topic.description":["Query by Example is a database query language for relational databases. It was devised by Moshé M. Zloof at IBM Research during the mid-1970s, in parallel to the development of SQL. It is the first graphical query language, using visual tables where the user would enter commands, example elements and conditions. Many graphical front-ends for databases use the ideas from QBE today. Originally limited only for the purpose of retrieving data, QBE was later extended to allow other operations, such as inserts, deletes and updates, as well as creation of temporary tables.\\nThe motivation behind QBE is that a parser can convert the user's actions into statements expressed in a database manipulation language, such as SQL. Behind the scenes, it is this statement that is actually executed. A suitably comprehensive front-end can minimize the burden on the user to remember the finer details of SQL, and it is easier and more productive for end-users to select tables and columns by selecting them rather than typing in their names,\\nIn the context of information retrieval, QBE has a somewhat different meaning."],"rdfs:label":["Query by Example"],"key:en":["query_by_example"],"ns:common.topic.image":[{"ns:type.content.length":["11765"],"ns:type.content.blob_id":["76b9def1e7285fd510bbb635a9c3dbf3665bce13f92a339445ce10f00c2adac1"],"ns:common.licensed_object.provenance":["wikipedia,en,3686881"],"ns:common.image.size":["ns:m.02btp_y"],"ns:type.content.source":["ns:m.02cpm84"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["Query by Example"],"rdfs:label":["Query by Example"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.06_s5g"]}],"ns:common.topic.article":[{"ns:common.document.text":["Query by Example (QBE) is a database query language for relational databases. It was devised by Moshé M. Zloof at IBM Research during the mid 1970s, in parallel to the development of SQL. It is the first graphical query language, using visual tables where the user would enter commands, example elements and conditions. Many graphical front-ends for databases use the ideas from QBE today. Originally limited only for the purpose of retrieving data, QBE was later extended to allow other operations, such as inserts, deletes and updates, as well as creation of temporary tables.\\nThe motivation behind QBE is that a parser can convert the user's actions into statements expressed in a database manipulation language, such as SQL. Behind the scenes, it is this statement that is actually executed. A suitably comprehensive front-end can minimize the burden on the user to remember the finer details of SQL, and it is easier and more productive for end-users (and even programmers) to select tables and columns by selecting them rather than typing in their names,\\nIn the context of information retrieval, QBE has a somewhat different meaning. The user can submit a document, or several documents, and"],"ns:common.document.source_uri":["<http://wp/en/2271084>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Query by Example"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256fvh6w"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}