{"ns:m.03gbmp":{"ns:common.topic.alias":["LSL"],"rdfs:label":["Linden Scripting Language"],"ns:common.topic.description":["Linden Scripting Language, or LSL, is the programming language used by residents of Second Life, a virtual world by Linden Lab and similar virtual worlds.\\nLSL has a syntax similar to C and allows objects to control the behavior of in-world objects of Second Life from the Internet via email, XML-RPC, and most recently, HTTP requests."],"key:en":["linden_scripting_language"],"ns:common.topic.official_website":["<https://wiki.secondlife.com/wiki/LSL_Portal>"],"ns:common.topic.webpage":[{"ns:common.webpage.description":["LSL Portal"],"ns:common.webpage.uri":["<http://wiki.secondlife.com/wiki/LSL_Portal>"],"ns:common.webpage.category":["ns:m.08mbj32"],"ns:common.webpage.resource":["ns:m.0bkq0pr"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.03gbmp"]}],"ns:common.topic.article":[{"ns:common.document.text":["Linden Scripting Language, or LSL, is the programming language used by residents of Second Life (SL), a virtual world by Linden Lab.\\nLSL has a syntax similar to C and allows objects to control the behavior of in-world objects of Second Life from the Internet via email, XML-RPC, and most recently, HTTP requests.\\nLinden Scripting Language is a state-event driven scripting language, in the sense of a finite state machine. A script consists of variables, function definitions, and one or more named states. Each state contains a description of how to react to events that occur while the program is within that state. The system sends to the script, such as timers, movement, chat (from other agents), email, and collisions (with objects in the virtual world). Scripts can change most aspects of the state of the object and communicate with other objects and agents. As soon as a script is added to an object, and turned on, it begins to execute.\\nA script is tightly bound to the concept of virtual-world objects (in the 3D modeling sense rather than in the object-oriented sense) called primitives. An object in Second Life represents something like a chair or a wall, or possibly something"],"ns:common.document.source_uri":["<http://wp/en/843913>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Linden Lab"],"ns:type.object.name":["Linden Scripting Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255nb01p"],"ns:computer.programming_language.parent_language":["ns:m.01t6b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}