{"ns:m.03mc99n":{"ns:common.topic.description":["Tensilica Instruction Extension refers to the proprietary language that is used to customize the Xtensa processor core architecture.\\nBy using TIE, the user can customize the Xtensa architecture by adding custom instructions and register files, instantiating TIE Ports and Queues for multiprocessor communication, and adding pre-configured extensions. Software applications can greatly benefit from properly targeted user-defined instructions, while TIE ports and TIE queues facilitate multiprocessor communication by adding separate input and output interfaces to the processor core. Using the TIE language and Xtensa Xplorer toolkit, the generation and verification of the instructions used to extend the processor ISA are automated. Such automation helps to reduce the hardware verification time that typically consumes a large percentage of the project duration of a typical hardware developed for the same functionality."],"rdfs:label":["Tensilica Instruction Extension"],"key:en":["tensilica_instruction_extension"],"ns:common.topic.article":[{"ns:common.document.text":["Tensilica Instruction Extension refers to the proprietary language that is used to customize the Xtensa processor core architecture.\\nBy using TIE, the user can customize the Xtensa architecture by adding custom instructions and register files, instantiating TIE Ports and Queues for multiprocessor communication, and adding pre-configured extensions (such as Tensilica's DSP). Software applications can greatly benefit from properly targeted user-defined instructions, while TIE ports and TIE queues facilitate multiprocessor communication by addign separate input and output interfaces to the processor core. Using the TIE language and Xtensa Xplorer toolkit, the generation and verification of the instructions used to extend the processor ISA are automated. Such automation helps to reduce the hardware verification time that typically consumes a large percentage of the project duration of a typical hardware developed for the same functionality.\\nTIE was added by Tensilica to extend the instruction set of the Xtensa processors.\\nTIE code can be created in two ways. TIE can be:\\nManual coding is similar to programming using Verilog, a Hardware description language. Automatic generation of TIE"],"ns:common.document.source_uri":["<http://wp/en/15500092>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Tensilica Instruction Extension"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257zsv5k"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}