{"ns:m.03c4bw5":{"ns:common.topic.description":["FRACTRAN is a Turing-complete esoteric programming language invented by the mathematician John Conway. A FRACTRAN program is an ordered list of positive fractions together with an initial positive integer input n. The program is run by updating the integer n as follows:\\nfor the first fraction f in the list for which nf is an integer, replace n by nf\\nrepeat this rule until no fraction in the list produces an integer when multiplied by n, then halt.\\nConway gave an interesting formula for primes in FRACTRAN:\\nStarting with n=2, this FRACTRAN program generates the following sequence of integers:\\n2, 15, 825, 725, 1925, 2275, 425, 390, 330, 290, 770, ...\\nAfter 2, this sequence contains the following powers of 2:\\n\\nwhich are the prime powers of 2."],"rdfs:label":["FRACTRAN"],"key:en":["fractran"],"ns:common.topic.article":[{"ns:common.document.text":["FRACTRAN is a Turing-complete esoteric programming language invented by the mathematician John Conway. A FRACTRAN program is an ordered list of positive fractions together with an initial positive integer input n. The program is run by updating the integer n as follows:\\nConway gave an interesting formula for primes in FRACTRAN:\\nStarting with n=2, this FRACTRAN program generates the following sequence of integers:\\nAfter 2, this sequence contains the following powers of 2:\\nwhich are the prime powers of 2.\\nA FRACTRAN program can be seen as a type of register machine where the registers are stored in prime exponents in the argument n.\\nUsing Gödel numbering, a positive integer n can encode an arbitrary number of arbitrarily large positive integer variables. The value of each variable is encoded as the exponent of a prime number in the prime factorization of the integer. For example, the integer\\nrepresents a register state in which one variable (which we will call v2) holds the value 2 and two other variables (v3 and v5) hold the value 1. All other variables hold the value 0.\\nA FRACTRAN program is an ordered list of positive fractions. Each fraction represents an instruction that tests"],"ns:common.document.source_uri":["<http://wp/en/13408203>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FRACTRAN"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255zqbg3"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.02ykw"]}}