{"ns:m.022rw9":{"ns:common.topic.description":["Job Control Language is a name for scripting languages used on IBM mainframe operating systems to instruct the system on how to run a batch job or start a subsystem.\\nThere are two distinct job control languages: one for the operating system lineage that begins with DOS/360 and whose latest member is z/VSE; and the other for the lineage from OS/360 to z/OS. They share some basic syntax rules and a few basic concepts, but are otherwise very different.\\nOther mainframe batch systems had some form of job control language, whether called that or not; their syntax was totally different from IBM versions, but they usually provided similar capabilities. Interactive systems include \\\"command languages\\\"—command files can be run non-interactively, but these usually do not provide as robust an environment for running unattended jobs as JCL. On some computer systems the job control language and the interactive command language may be different. For example TSO on z/OS systems uses CLIST or Rexx as command languages along with JCL for batch work. On other systems these may be the same."],"rdfs:label":["Job Control Language"],"key:en":["job_control_language"],"ns:common.topic.article":[{"ns:common.document.text":["Job Control Language (JCL) is a scripting language used on IBM mainframe operating systems to instruct the system on how to run a batch job or start a subsystem.\\nThere are actually two IBM JCLs: one for the operating system lineage that begins with DOS/360 and whose latest member is z/VSE; and the other for the lineage from OS/360 to z/OS. They share some basic syntax rules and a few basic concepts, but are otherwise very different.\\nIn both JCLs the unit of work is the job. A job consists of one or several steps, each of which is a request to run one specific program. For example, before the days of relational databases, a job to produce a printed report for management might consist of the following steps: a user-written program to select the appropriate records and copy them to a temporary file; sort the temporary file into the required order, usually using a general-purpose utility; a user-written program to present the information in a way that is easy for the end-users to read and includes other useful information such as sub-totals; and a user-written program to format selected pages of the end-user information for display on a monitor or terminal.\\nIn both DOS and OS JCL the"],"ns:common.document.source_uri":["<http://wp/en/391487>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Job Control Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fhstpw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.027sj6"]}}