{"ns:m.02tgs":{"ns:common.topic.description":["Emacs Lisp is a dialect of the Lisp programming language used by the GNU Emacs and XEmacs text editors. It is used for implementing most of the editing functionality built into Emacs, the remainder being written in C. Emacs Lisp is also referred to as Elisp, although there is also an older, unrelated Lisp dialect with that name.\\nUsers of Emacs commonly write Emacs Lisp code to customize and extend Emacs. Other options include the \\\"Customize\\\" feature that's in GNU Emacs since version 20. This provides a set of preference pages and when the user saves their preferences, Customize writes the necessary Emacs Lisp code to the user's config file.\\nEmacs Lisp can also function as a scripting language, much like the Unix Bourne shell or Python, by calling Emacs in \\\"batch mode\\\". In this way it may be called from the command line or via an executable file, and its editing functions, such as buffers and movement commands are available to the program just as in the normal mode."],"rdfs:label":["Emacs Lisp"],"key:en":["emacs_lisp"],"ns:common.topic.topical_webpage":["<http://www.xemacs.org/>"],"ns:common.topic.webpage":[{"ns:common.webpage.description":["XEmacs Home Page"],"ns:common.webpage.uri":["<http://www.xemacs.org>"],"ns:common.webpage.category":["ns:m.08mbj32"],"ns:common.webpage.resource":["ns:m.0blkwxy"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.02tgs"]}],"ns:common.topic.article":[{"ns:common.document.text":["Emacs Lisp is a dialect of the Lisp programming language used by the GNU Emacs and XEmacs text editors (which this article will refer to collectively as \\\"Emacs\\\"). It is used for implementing most of the editing functionality built into Emacs, the remainder being written in C (as is the Lisp interpreter itself). Users of Emacs commonly write Emacs Lisp code to customize and extend Emacs.\\nEmacs Lisp can also function as a scripting language, much like the Unix Bourne shell, Perl, Python, scsh, or GNU Guile. Just as with those languages, it may be called from the command line or via an executable file. Its editing functions, such as buffers and movement commands, complement the features of Lisp and work in batch mode.\\nSome people refer to Emacs Lisp as Elisp, at the risk of confusion with an older unrelated Lisp dialect with the same name. In terms of features, it is closely related to the Maclisp dialect, with some later influence from Common Lisp. It supports imperative and functional programming methods. Richard Stallman chose Lisp as the extension language for his rewrite of Emacs (the original used TECO as its extension language) because of its powerful features, including the"],"ns:common.document.source_uri":["<http://wp/en/10392>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Richard Stallman"],"ns:type.object.name":["Emacs Lisp"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256n65cw"],"ns:computer.programming_language.influenced_by":["ns:m.04kyw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.02ykw"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}