{"ns:m.0gmljm":{"key:authority.google.google_plus_page":["115535916268245263868"],"ns:common.topic.description":["LANSA is an integrated development environment for building software applications that can run on IBM i, Windows and Linux. The features of the LANSA development environment are:\\nHigh-level programming language\\nBusiness rules and data definitions metadata repository\\nData management services\\nApplication framework\\nIntegrated-development-environment"],"rdfs:label":["LANSA"],"key:en":["lansa"],"ns:common.topic.social_media_presence":["<http://plus.google.com/115535916268245263868>"],"ns:common.topic.article":[{"ns:common.document.text":["LANSA is a development environment that requires a single skill set to build applications that can run on multiple platforms, namely IBMi, Windows, LINUX, UNIX. LANSA (http://www.lansa.com) also consists of an entire family of integrated software development tools (see below) and Business Solutions. The main feature of the LANSA environment is the 'RDML / RDMLX' language. This high-level language is classified as a 4GL (4th generation computing language) and though it originates from the IBMi AS400 (iSeries or i5), it now runs on many systems including MS Windows, Unix, Linux and IBM OS400. In its first release in 1987, the RDML language was known as lambda.\\nLANSA is currently used as a development environment by thousands of Companies worldwide to build multilingial / multi-platform applications that run in English, French, Spanish, Japanese etc.\\nRDML is an abbreviation for Rapid Development and Maintenance Language. RDML closely follows the syntax of IBM CL, or Control Language. CL is the \\\"scripting language\\\" equivalent of the OS/400 operating system. In recent years RDML has been extended to become RDMLX. This new version of the language has extra features, commands, types, and"],"ns:common.document.source_uri":["<http://wp/en/6761437>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["LANSA"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125782126"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}