{"ns:m.03ckgxf":{"ns:common.topic.description":["Tersus Visual Programming Platform is a general purpose software development platform that enables the development of applications, mainly rich web applications, by drawing flow diagrams instead of writing code. It's dual licensed as open-source and proprietary software.\\nThe Tersus Modeling Language is a visual language for defining user interface, client side behavior and server side processing. The language shares many features of dataflow programming languages.\\nWhen used for web development, Tersus can be classified as Client Side + Server Side. The modeled applications are executed by the Tersus Server.\\nTersus Studio is an IDE, an extension of the Eclipse platform, used by developers to graphically define the functionality of applications.\\nThe platform also contains a visual debugging capability. The Tersus Server can record every step during the application’s execution, and this recording can then be played back in the Tersus Studio to view the flow of the application and the value of each data element.\\nBoth the Studio and the Server are available on a variety of platforms, including Microsoft Windows, UNIX, Linux, and Mac OS X."],"rdfs:label":["Tersus"],"key:en":["tersus"],"ns:common.topic.article":[{"ns:common.document.text":["Tersus Visual Programming Platform is a general purpose software development platform that enables the development of applications, mainly rich web applications, by drawing flow diagrams instead of writing code. It's dual licensed as open-source and proprietary software.\\nThe Tersus Modeling Language is a visual language for defining user interface, client side behavior and server side processing. The language shares many features of dataflow programming languages.\\nWhen used for web development, Tersus can be classified as Client Side + Server Side (using AJAX techniques). The modeled applications are executed by the Tersus Server.\\nTersus Studio is an IDE, an extension of the Eclipse platform, used by developers (modelers) to graphically define the functionality of applications.\\nThe platform also contains a visual debugging capability. The Tersus Server can record every step during the application’s execution, and this recording (\\\"trace\\\") can then be played back in the Tersus Studio to view the flow of the application and the value of each data element.\\nBoth the Studio and the Server are available on a variety of platforms, including Microsoft Windows, UNIX, Linux, and Mac OS X. The"],"ns:common.document.source_uri":["<http://wp/en/13826750>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Tersus"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b6pjqj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}