{"ns:m.08j11c":{"ns:common.topic.description":["Magik is an object-oriented programming language that supports multiple inheritance, polymorphism and is dynamically typed. It was designed implemented in 1989 by Arthur Chance, of Smallworld Systems Ltd, as part of Smallworld Geographical Information System. Following Smallworld's acquisition in 2000, Magik is now is provided by GE Energy, still as part of its Smallworld technology platform.\\nMagik was originally introduced in 1990 and has been improved and updated over the years. Its current version is 4.0 or Magik SF.\\nIn July 2012, Magik developers announced that they were in the process of porting Magik language on the Java virtual machine. The successful porting was confirmed by Oracle Corporation in November of the same year."],"rdfs:label":["Magik"],"key:en":["magik_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Magik is an object-oriented programming language that supports multiple inheritance, polymorphism and is dynamically typed. It is provided by GE Energy as part of its Smallworld technology platform and was designed from the outset to implement complex applications for enterprise utilities such as power distribution and telecommunications.\\nMagik (Inspirational Magik) was originally introduced in 1990 and has been improved and updated over the years. Its current version is 4.0 or Magik SF (Small Footprint).\\nMagik itself shares some similarities with Smalltalk in terms of its language features and its architecture: the Magik language is compiled into byte codes interpreted by the Magik virtual machine. The Magik virtual machine is available on several platforms including Microsoft Windows, various flavours of Unix and Linux.\\nMagik is console based and code can be modified on the fly even when an application is running. The console can also be used to execute Magik code and to see the results.\\nCompiled code is stored in a single file called an image file. Each image file holds the compiled byte-codes and the state of the session (for example variable values) when the image was last"],"ns:common.document.source_uri":["<http://wp/en/2988758>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Magik"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12555v58p"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}