{"ns:m.03pxm2":{"ns:common.topic.description":["S is a statistical programming language developed primarily by John Chambers and Rick Becker and Allan Wilks of Bell Laboratories. The aim of the language, as expressed by John Chambers, is \\\"to turn ideas into software, quickly and faithfully\\\".\\nThe two modern implementations of S are R, part of the GNU free software project, and S-PLUS."],"rdfs:label":["S"],"key:en":["s_programming_language"],"ns:computer.programming_language.language_designers":[],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["えすげんご"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["S is a statistical programming language developed primarily by John Chambers and (in earlier versions) Rick Becker and Allan Wilks of Bell Laboratories. The aim of the language, as expressed by John Chambers, is \\\"to turn ideas into software, quickly and faithfully.\\\"\\nThe two modern implementations of S are R and S-PLUS. The R implementation is listed in TIOBE index (February 2012) at position 20, S-Plus and generic S are listed among the 100 most popular programming languages.\\nS is one of several statistical computing languages that were designed at Bell Laboratories, and first took form between 1975–1976. Up to that time, much of the statistical computing was done by directly calling Fortran subroutines; however, S was designed to offer an alternate and more interactive approach. Early design decisions that hold even today include interactive graphics devices (printers and character terminals at the time), and providing easily accessible documentation for the functions.\\nThe first working version of S was built in 1976, and operated on the GCOS operating system. At this time, S was unnamed, and suggestions included Interactive SCS (ISCS), Statistical Computing System, and"],"ns:common.document.source_uri":["<http://wp/en/919313>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://stat.bell-labs.com/S/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.03pxm2"]}],"ns:computer.programming_language.introduced":["1976"],"ns:type.object.name":["S"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fprb2t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.0q1d"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.0212jm"],"ns:computer.programming_language.influenced":["ns:m.0212jm"]}}