{"ns:m.0clhh3":{"ns:common.topic.description":["BASICODE was a computer project intended to create a unified standard for the BASIC programming language. BASIC was available on many popular home computers, but there were countless variants that were mostly incompatible with each other. The project was initiated in 1980 by Hobbyscoop, a radio program of the Dutch broadcasting organisation Nederlandse Omroep Stichting.\\nThe basic implementation were architecture-specific utility applications that executed calls of subroutines for text, audio and sound defined in the BASICODE language standard according to the abilities of the computer in question. These applications, called Bascoders, also enabled the sharing of data and programs across different computer platforms by defining a data format for the compact audio cassettes that were regularly used as storage media in the 1980s. A BASICODE program stored on cassette could be loaded and run on any computer supporting the language. BASICODE was often called \\\"Esperanto for computers\\\" for that reason."],"rdfs:label":["BASICODE"],"key:en":["basicode"],"ns:common.topic.article":[{"ns:common.document.text":["BASICODE was a computer project intended to create a unified standard for the BASIC programming language. BASIC was available on many popular home computers, but there were countless variants that were mostly incompatible with each other. The project was initiated in 1980 by Hobbyscoop, a radio program off the Netherlands broadcasting organisation Nederlandse Omroep Stichting (NOS).\\nThe basic implementation were architecture-specific utility applications that executed calls of subroutines for text, audio and sound defined in the BASICODE language standard according to the abilities of the computer in question. These applications, called Bascoders, also enabled the sharing of data and programs across different computer platforms by defining a data format for the compact audio cassettes that were regularly used as storage media in the 1980s. A BASICODE program stored on cassette could be loaded and run on any computer supporting the language. BASICODE was often called \\\"Esperanto for computers\\\" for that reason.\\nFrom the late 1970s to the late 1980s home computers based on 8 bit processors were very popular. Among the most well-known models were the TRS-80 by Tandy, the PET 2001,"],"ns:common.document.source_uri":["<http://wp/en/4753069>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["BASICODE"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257wf_0j"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}