{"ns:m.0p8g":{"ns:common.topic.alias":["ASM"],"ns:common.topic.description":["An assembly language is a low-level programming language for a computer, or other programmable device, in which there is a very strong correspondence between the language and the architecture's machine code instructions. Each assembly language is specific to a particular computer architecture, in contrast to most high-level programming languages, which are generally portable across multiple architectures, but require interpreting or compiling.\\nAssembly language is converted into executable machine code by a utility program referred to as an assembler; the conversion process is referred to as assembly, or assembling the code.\\nAssembly language uses a mnemonic to represent each low-level machine instruction or operation. Typical operations require one or more operands in order to form a complete instruction, and most assemblers can therefore take labels, symbols and expressions as operands to represent addresses and other constants, freeing the programmer from tedious manual calculations. Macro assemblers include a macroinstruction facility so that assembly language text can be represented by a name, and that name can be used to insert the expanded text into other code."],"rdfs:label":["Assembly language"],"key:en":["assembly_language"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["アセンブリげんご"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:base.ontologies.ontology_instance.equivalent_instances":[{"ns:base.ontologies.ontology_instance_mapping.uri":["<http://sw.opencyc.org/2008/06/10/concept/Mx4rvViH-5wpEbGdrcN5Y29ycA>"],"ns:base.ontologies.ontology_instance_mapping.ontology":["ns:m.04dm2p_"],"rdf:type":["ns:base.ontologies.ontology_instance_mapping"],"ns:base.ontologies.ontology_instance_mapping.freebase_topic":["ns:m.0p8g"]}],"ns:common.topic.image":[{"ns:type.content.length":["330158"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Swtpc6800"],"rdfs:label":["Motorola 6800 Assembly Language"],"ns:type.content.blob_id":["e8b5962e29459ec56291dc28033038accf85908d369a2a140180259316ebdcce"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:type.content.language":["ns:m.04l"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08y0"],"ns:common.image.size":["ns:m.0g_03kt"],"ns:type.content.source":["ns:m.0g_03l7"],"ns:type.object.name":["Motorola 6800 Assembly Language"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0p8g"]}],"ns:common.topic.article":[{"ns:common.document.text":["An assembly language is a low-level programming language for computers, microprocessors, microcontrollers, and other programmable devices in which each statement corresponds to a single machine language instruction. An assembly language is specific to a certain computer architecture, in contrast to most high-level programming languages, which may be more portable.\\nAssembly Language uses 'mnemonic codes' or 'symbols'. Instead of remembering the exact memory locations where data and instructions are stored, symbolic memory addresses are used for data.\\nA utility program called an assembler is used to translate assembly language statements into the target computer's machine code.\\nIn normal professional usage, the term assembler is used to refer both to an assembly language, and to software which assembles an assembly-language program. Thus: \\\"CP/CMS was written in S/360 assembler\\\" as well as \\\"ASM-H was a widely used S/370 assembler.\\\"\\nMany assemblers offer additional mechanisms to facilitate program development, control the assembly process, and aid debugging. Assemblers often include a macro facility (described below), and are called macro assemblers.\\nAn assembler creates object code by"],"ns:common.document.source_uri":["<http://wp/en/1368>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Assembly language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255vfvvt"],"ns:computer.programming_language.influenced":["ns:m.0gdxqx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.parent_language":["ns:m.08klpg"]}}