{"ns:m.0c7hj2":{"ns:common.topic.description":["FAUST is a domain-specific purely functional programming language for implementing signal processing algorithms in the form of libraries, audio plug-ins, or standalone applications. A FAUST program denotes a signal processor: a mathematical function that is applied to some input signal and then fed out."],"rdfs:label":["FAUST"],"ns:common.topic.official_website":["<http://faudiostream.sourceforge.net/>"],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://faudiostream.sourceforge.net/>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkl003"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0c7hj2"]}],"ns:common.topic.article":[{"ns:common.document.text":["FAUST (Functional AUdio STream) is a programming language that provides a purely functional approach to signal processing while offering a high level of performance. FAUST aims at being complementary to existing audio languages by offering a viable and efficient alternative to C/C++ to develop signal processing libraries, audio plug-ins or standalone applications. The language is based on a simple and well defined formal semantics. A FAUST program denotes a signal processor, a mathematical function that transforms input signals into output signals.\\nAs said in the introduction, the FAUST programming model combines a functional programming approach with a block-diagram syntax:\\nA FAUST program doesn’t describe a sound or a group of sounds, but a signal processor, something that transforms input signals and produces output signals. The program source is organized as a set of definitions with at least the definition of the keyword process (the equivalent of main in C):\\nThe FAUST compiler translates FAUST programs into equivalent C++ programs taking care of generating the most efficient code. The result can generally compete with, and sometimes even outperform, C++ code written by"],"ns:common.document.source_uri":["<http://wp/en/4532356>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FAUST"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255syccj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}