{"ns:m.03py_v":{"ns:common.topic.description":["Snowball is a small string processing programming language designed for creating stemming algorithms for use in information retrieval.\\nThe Snowball compiler translates a Snowball script into either a thread-safe ANSI C program or a Java program. For ANSI C, each Snowball script produces a program file and corresponding header file. The basic datatypes handled by Snowball are strings of characters, signed integers, and boolean truth values, or more simply strings, integers and booleans. Snowball's characters are either 8-bit wide, or 16-bit, depending on the mode of use. In particular, both 8-bit ASCII and 16-bit Unicode are supported. Like the SNOBOL programming language, the flow of control in Snowball is arranged by the implicit use of signals, rather than the explicit use of constructs such as if, then, and break found in C and many other programming languages.\\nThe name Snowball was chosen as a tribute to the SNOBOL programming language, with which it shares the concept of string patterns delivering signals that are used to control the flow of the program. The creator of Snowball, Dr."],"rdfs:label":["Snowball"],"key:en":["snowball_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Snowball is a small string-handling programming language whose name was chosen as a tribute to the SNOBOL programming language, with which it shares the concept of string patterns delivering signals that are used to control the flow of the program.\\nThe creator of Snowball, Dr. Martin Porter, \\\" toyed with the idea of calling it ‘strippergram’\\\", because it \\\"effectively provides a ‘suffix STRIPPER GRAMmar’\\\" (see the homepage). In an amusing coincidence, the SNOBOL programming language was originally named SEXI - String EXpression Interpreter.\\nThe basic datatypes handled by Snowball are strings of characters, signed integers, and boolean truth values, or more simply strings, integers and booleans. Snowball's characters are either 8-bit wide, or 16-bit, depending on the mode of use. In particular, both 8-bit ASCII and 16-bit Unicode are supported."],"ns:common.document.source_uri":["<http://wp/en/919808>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Snowball"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256dwvx_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}