{"ns:m.02vw5f":{"rdfs:label":["XSL Formatting Objects"],"ns:common.topic.description":["XSL Formatting Objects, or XSL-FO, is a markup language for XML document formatting which is most often used to generate PDFs. XSL-FO is part of XSL, a set of W3C technologies designed for the transformation and formatting of XML data. The other parts of XSL are XSLT and XPath. Version 1.1 of XSL-FO was published in 2006.\\nXSL-FO was discontinued: the last update for the Working Draft was in January 2012, and its Working Group closed in November 2013."],"key:en":["xsl_formatting_objects"],"ns:common.topic.article":[{"ns:common.document.text":["XSL Formatting Objects, or XSL-FO, is a markup language for XML document formatting which is most often used to generate PDFs. XSL-FO is part of XSL (Extensible Stylesheet Language), a set of W3C technologies designed for the transformation and formatting of XML data. The other parts of XSL are XSLT and XPath. Version 1.1 of XSL-FO was published in 2006.\\nUnlike the combination of HTML and CSS, XSL-FO is a unified presentational language. It has no semantic markup in the way it is meant in HTML. And, unlike CSS which modifies the default presentation of an external XML or HTML document, it stores all of the document's data within itself.\\nThe general idea behind XSL-FO's use is that the user writes a document, not in FO, but in an XML language. XHTML, DocBook, and TEI are all possible examples. Then, the user obtains an XSLT transform, either by writing one themselves or by finding one for the document type in question. This XSLT transform converts the XML into XSL-FO.\\nOnce the XSL-FO document is generated, it is then passed to an application called an FO processor. FO processors convert the XSL-FO document into something that is readable, printable or both. The most common output of"],"ns:common.document.source_uri":["<http://wp/en/606295>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.image":[{"ns:type.content.blob_id":["256cfa10062acdcca00486d9e102cadd6281c530800a822e9368e3a8242958a0"],"ns:type.content.length":["9980"],"rdfs:label":["Imagen:XSL-FO-workflow"],"ns:type.content.source":["ns:m.044m4g0"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08y0"],"ns:common.image.size":["ns:m.0kp9sw"],"ns:type.object.name":["Imagen:XSL-FO-workflow"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.02vw5f"]}],"ns:type.object.name":["XSL Formatting Objects"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fpl2lz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}