{"ns:m.0djtnc":{"ns:common.topic.description":["PROC is the name of Pick operating system's procedure language. PROC is comparable to a UNIX shell script or a DOS/Windows batch file, and has similar features such as control-flow constructs, file manipulation, subroutine calls, and terminal input and output. The PROC language itself consists of terse macro commands. A PROC script contains a sequence of PROC language macros and PICK TCL commands. A PROC script is often used as a \\\"front-end\\\" for a program or application, interactive or not.\\nThe original version of PROC utilizes two input buffers, and two output buffers. Some Pick emulations release extended versions of PROC, sometimes called New PROCs with an additional 9 file buffers. New PROCs are identified with a PQX or PQN on the first line of the script, whereas traditional PROCs commence with PQ.\\nIn about 1975 an expanded version of PROC called \\\"PORC\\\" was developed by John Timmons and Paul Desjardins. This was then further developed by Tim Holland under the employ of Systems Management, Inc. in Chicago, initially called \\\"SMILE\\\" and then renamed Realtime Programming Language. RPL was a compiled language featuring 250 input buffers but still recognisably derived from PROC."],"rdfs:label":["PROC procedure language"],"key:en":["proc_procedure_language"],"ns:common.topic.article":[{"ns:common.document.text":["PROC is the name of Pick operating system's procedure language. PROC is comparable to a UNIX shell script or a DOS/Windows batch file, and has similar features such as control-flow constructs, file manipulation, subroutine calls, and terminal input and output. The PROC language itself consists of terse macro commands. A PROC script contains a sequence of PROC language macros and PICK TCL (Terminal Control Language) commands. A PROC script is often used as a \\\"front-end\\\" for a program or application, interactive or not.\\nPROC utilizes two input buffers (primary and secondary) and two output buffers (primary and secondary). 9 file buffers. Some Pick emulations (e.g. Reality X) release extended versions of PROC, sometimes called New PROCs with an additional 9 file buffers. New PROCs are identified with a PQX or PQN on the first line of the script, whereas traditional PROCs commence with PQ.\\nIn about 1975 an expanded version of PROC called \\\"PORC\\\" was developed by John Timmons and Paul Desjardins. This was then further developed by Tim Holland under the employ of SMI in Chicago, initially called \\\"SMILE\\\" (SMI Language Extension?) and then renamed Realtime Programming Language (RPL). RPL"],"ns:common.document.source_uri":["<http://wp/en/5392840>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PROC procedure language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258mw7kg"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}