{"ns:m.03jzh1":{"ns:common.topic.description":["FOCUS is a computer programming language and development environment. It is a language used to build database queries, and is regarded as a fourth-generation programming language. Produced by Information Builders Inc., it was originally developed for data handling and analysis on the IBM mainframe. As newer systems were developed and smaller computers became more powerful, the available platforms for FOCUS were extended to personal computers and in 1997, to the World Wide Web in the WebFOCUS product."],"rdfs:label":["FOCUS"],"key:en":["focus"],"ns:common.topic.article":[{"ns:common.document.text":["FOCUS is a computer programming language. It is a language used to build database queries, and is regarded as a fourth-generation programming language(4GL). Produced by Information Builders Inc., it was originally developed for data handling and analysis on the IBM mainframe. As newer systems were developed and smaller computers became more powerful, the available platforms for FOCUS were extended to personal computers and in 1997, to the World Wide Web in the WebFOCUS product.\\nRAMIS, the first 4GL, was the direct ancestor of FOCUS, having been principally developed by Gerald Cohen and Peter Mittleman while working at Mathematica Products Group in 1970. The product was sold by Mathematica to a number of in-house clients (including Nabisco and AT&T), and was also offered by the National CSS timesharing company for use on their VP/CSS operating system (a derivation of IBM's CP/CMS which is now called VM/CMS). In 1970, Cohen decided to leave Mathematica and form Information Builders, after which he recreated the product he had built at Mathematica in the form of FOCUS which was released in 1975. The syntax of FOCUS in its simplest elements is almost a direct clone of the syntax of"],"ns:common.document.source_uri":["<http://wp/en/867853>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FOCUS"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dcyfj5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}