{"ns:m.03c2jcv":{"ns:common.topic.description":["Hindawi Programming System is a suite of open source programming languages. It allows non-English medium literates to learn and write computer programs. It is a scalable system which supports many programming paradigms.\\nShaili Prathmik or Indic BASIC and Indic LOGO are for beginners who want to start with computer programming.\\nOn the higher end it supports Shaili Guru, Shaili Shraeni, Shaili Yantrik, Shaily Shabda, Shaili Vyaakaran, and Shaili Kritrim, which is an Indic programming language targeting JVM."],"rdfs:label":["Hindawi Programming System"],"key:en":["hindawi_programming_system"],"ns:common.topic.article":[{"ns:common.document.text":["Hindawi Programming System (hereafter referred to as HPS) is a suite of open source programming languages. It allows non-English medium literates to learn and write computer programs. It is a scalable system which supports many programming paradigms.\\nShaili Prathmik or Indic BASIC and Indic LOGO are for beginners who want to start with computer programming.\\nOn the higher end it supports Shaili Guru (Indic C), Shaili Shraeni (Indic C++), Shaili Yantrik (Indic Assembly), Shaily Shabda (Indic Lex), Shaili Vyaakaran (Shaili Vyaaka/Indic Yacc), and Shaili Kritrim, which is an Indic programming language targeting JVM.\\nHPS uses Romenagri transliteration to first convert the high level source code into a compiler acceptable format and then uses an existing compiler to produce machine code.\\nComputer Society of India's National Young IT Professional Award 2005 Sarai / CSDS FLOSS fellowship  Hindawi is recognised by TDIL, Government of India. Hindawi was shortlisted for Manthan Award 2007"],"ns:common.document.source_uri":["<http://wp/en/29762278>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Hindawi Programming System"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256hsxk0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}