{"ns:m.023k72":{"ns:common.topic.description":["CLIPS is a public domain software tool for building expert systems. The name is an acronym for \\\"C Language Integrated Production System.\\\" The syntax and name was inspired by Charles Forgy's OPS. The first versions of CLIPS were developed starting in 1985 at NASA-Johnson Space Center until the mid-1990s when the development group's responsibilities ceased to focus on expert system technology. The original name of the project was NASA's AI Language.\\nCLIPS is probably the most widely used expert system tool. CLIPS incorporates a complete object-oriented language for writing expert systems. CLIPS itself is written in C, extensions can be written in C, and CLIPS can be called from C. Its user interface closely resembles that of the programming language Lisp. COOL combines the programming paradigms of procedural, object oriented and logical languages. A language with a similar approach is Planner, which also combines traits of logical languages like Prolog with the capabilities of procedural and OO-languages like C++."],"rdfs:label":["CLIPS"],"key:en":["clips_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["CLIPS is a public domain software tool for building expert systems. The name is an acronym for \\\"C Language Integrated Production System.\\\" The syntax and name was inspired by Charles Forgy's OPS (\\\"Official Production System,\\\" although there was nothing really official about it). The first versions of CLIPS were developed starting in 1985 at NASA-Johnson Space Center (as an alternative for existing system ART*Inference) until the mid 1990s when the development group's responsibilities ceased to focus on expert system technology. The original name of the project was NASA's AI Language (NAIL).\\nCLIPS is probably the most widely used expert system tools because it is fast, efficient and free. CLIPS incorporates a complete object-oriented language COOL for writing expert systems. CLIPS is written in C, extensions can be written in C, and CLIPS can be called from C. Its user interface more closely resembles that of the programming language LISP.\\nLike other expert system languages, CLIPS deals with rules and facts. Various facts can make a rule applicable. An applicable rule is then asserted. Facts and rules are created by first defining them, as shown below:\\nIn CLIPS, salience allows a"],"ns:common.document.source_uri":["<http://wp/en/418603>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1985"],"ns:type.object.name":["CLIPS"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259tdp0h"],"ns:computer.programming_language.influenced":["ns:m.010f6pwn"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.04kyw"]}}