{"ns:m.06rm6":{"ns:common.topic.description":["sed is a Unix utility that parses and transforms text, using a simple, compact programming language. sed was developed from 1973 to 1974 by Lee E. McMahon of Bell Labs, and is available today for most operating systems. sed was based on the scripting features of the interactive editor ed and the earlier qed. sed was one of the earliest tools to support regular expressions, and remains in use for text processing, most notably with the substitution command. Other options for doing \\\"stream editing\\\" include AWK and Perl."],"key:en":["sed"],"rdfs:label":["sed"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["セド"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["sed (stream editor) is a Unix utility that parses text and implements a programming language which can apply transformations to such text. It reads input line by line (sequentially), applying the operation which has been specified via the command line (or a sed script), and then outputs the line. It was developed from 1973 to 1974 as a Unix utility by Lee E. McMahon of Bell Labs, and is available today for most operating systems.\\nsed is one of the very early Unix commands built for command line processing of data files. It evolved as the natural successor to the popular grep command. Cousin to the later AWK, sed allows powerful and interesting data processing to be done by shell scripts.\\nsed and AWK are often cited as the progenitors and inspiration for Perl. The s / / / syntax shown below is part of Perl's syntax and originated with ed, the precursor to sed.\\nsed's language does not have variables and has only primitive GOTO and branching functionality; nevertheless, the language is Turing-complete. \\nGNU sed added several new features. The best-known is in-place editing of files (i.e., replace the original file with the result of applying the sed program), which was later included"],"ns:common.document.source_uri":["<http://wp/en/27163>"],"rdf:type":["ns:common.document"]}],"ns:base.ontologies.ontology_instance.equivalent_instances":[{"ns:base.ontologies.ontology_instance_mapping.uri":["<http://sw.opencyc.org/2008/06/10/concept/Mx4rvbFjo5wpEbGdrcN5Y29ycA>"],"ns:base.ontologies.ontology_instance_mapping.ontology":["ns:m.04dm2p_"],"rdf:type":["ns:base.ontologies.ontology_instance_mapping"],"ns:base.ontologies.ontology_instance_mapping.freebase_topic":["ns:m.06rm6"]}],"ns:type.object.name":["sed"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255tjjhd"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0q2c"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"]}}