{"ns:m.010py":{"ns:common.topic.description":["Atlas Autocode was a programming language developed around 1965 at Manchester University for the Atlas Computer. It was developed by Tony Brooker and Derrick Morris as a variant of the ALGOL programming language, removing some Algol features such as \\\"passing parameters by name\\\". It featured explicitly typed variables, subroutines, and functions. The AA compiler generated range-checking for array accesses, and allowed an array to have dimensions that were determined at run-time."],"rdfs:label":["Atlas Autocode"],"key:en":["atlas_autocode"],"ns:common.topic.article":[{"ns:common.document.text":["Atlas Autocode (AA) was a programming language developed around 1965 at Manchester University for the Atlas Computer. It was developed by Tony Brooker and Derrick Morris as a variant of the ALGOL programming language, removing some Algol features such as \\\"passing parameters by name\\\" (which in Algol 60 means passing the address of a short subroutine to recalculate the parameter each time it was mentioned). It featured explicitly typed variables, subroutines, and functions. The AA compiler generated range-checking for array accesses, and allowed an array to have dimensions that were determined at run-time (i.e. you could declare an array as integer array Thing (i:j), where i and j were calculated values).\\nMachine code could be included within the high-level AA routines either to make an inner loop more efficient or to effect some operation which could not easily be done otherwise.\\nAtlas Autocode included a complex data type which would support complex numbers, partly because of pressure from the electrical engineering department, as complex numbers are used to represent the behavior of alternating current. The square root of -1 was represented by i, which was treated as a fixed"],"ns:common.document.source_uri":["<http://wp/en/2726>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Atlas Autocode"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125gl7zcr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}