{"ns:m.04h5hy":{"ns:common.topic.description":["HAScript, or Host Access Script, is an IBM-developed macro language with an XML syntax designed for programmatic interaction with terminal-based applications. HAScript is based on a state machine principle. The first commercial implementation appeared in IBM's Host On-Demand in the late 1990s.\\nIBM software products that use HAScript include WebSphere Host On-Demand, Personal Communications, and WebSphere Host Access Transformation Services. When accessing the IBM Mainframe the HAScript API allows for Host emulation whereby information from the host screen can be retrieved and reformatted within a webpage, or other software application. There has been limited adoption of HAScript as it requires an intense amount of system resources, general process overhead and Java virtual machine resources. To date, the implementation of HAScript by other software companies has been mild as the language used for communication is not universally standardized."],"rdfs:label":["IBM HAScript"],"key:en":["hascript"],"ns:common.topic.article":[{"ns:common.document.text":["HAScript, or Host Access Script, is an IBM-developed macro language with an XML syntax designed for programmatic interaction with terminal-based applications. HAScript is based on a state machine principle. The first commercial implementation appeared in IBM's Host On-Demand in the late 1990s.\\nIBM software products that use HAScript include WebSphere Host On-Demand (HOD), Personal Communications, and WebSphere Host Access Transformation Services (HATS). At this writing (late 2004) there has been some adoption of HAScript by other host access software vendors, although the language is not yet universal."],"ns:common.document.source_uri":["<http://wp/en/1205430>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IBM HAScript"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255ny8nr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}