{"ns:m.02610w2":{"ns:common.topic.description":["FoxPro is a text-based procedurally oriented programming language and DBMS, and it is also an object-oriented software programming language, originally published by Fox Software and later by Microsoft, for MS-DOS, Windows, Macintosh, and UNIX. The final published release of FoxPro was 2.6. Development continued under the Visual FoxPro label, which in turn was discontinued in 2007.\\nAlthough FoxPro is a Database Management System and although it does support relationships between tables, it is not considered a Relational Database Management System, lacking transactional processing.\\nSold and supported by Microsoft, there is an active worldwide community of FoxPro users and programmers. FoxPro 2.6 for UNIX has even been successfully installed on Linux and FreeBSD using the Intel Binary Compatibility Standard support library."],"rdfs:label":["FoxPro"],"key:en":["foxpro_2"],"ns:common.topic.article":[{"ns:common.document.text":["FoxPro is a text-based procedurally oriented programming language and DBMS, originally published by Fox Software and later by Microsoft, for MS-DOS, MS Windows, Apple Macintosh, and UNIX.\\nAlthough FoxPro is a Database Management System (DBMS) and it does support relationships between tables, it is not considered a Relational Database Management System (RDBMS), lacking transactional processing.\\nThe final published release of FoxPro was 2.6, after which the name was changed to Visual FoxPro.\\nAlthough no longer sold or supported by Microsoft, there is still an active worldwide community of FoxPro users and programmers. FoxPro 2.6 for UNIX (FPU26) has even been successfully installed on Linux and FreeBSD using the Intel Binary Compatibility Standard (ibcs2) support library.\\nFoxPro 2 included \\\"Rushmore\\\" optimizing engine, which used indices to accelerate data retrieval and updating. Rushmore technology examined every data-related statement, and looked for filter expressions. If one was used, it looked for an index matching the same expression.\\nIn addition, FoxPro2 was originally built on WatCOM C++, which had its own memory extensor - at that time state-of-the-art. FoxPro2 could access"],"ns:common.document.source_uri":["<http://wp/en/7419372>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FoxPro"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258qwyjx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}