{"ns:m.04shbz":{"ns:common.topic.description":["Model 204 is a database management system for IBM and compatible mainframe computers, “born” 1965 October 13, and first deployed in 1972. It incorporates a programming language and an environment for application development. Implemented in assembly language for IBM System/360 and its successors, M204 can deal with very large databases and transaction loads of 1000 TPS.\\nModel 204 relies on its own type of bitmap index, originally devised by Professor Patrick E. O'Neil, and also combines the use of hash table, B-tree, and record list technologies to optimize speed and efficiency of database access.\\nAlthough M204 is a pre-SQL database product, it is possible to manually map the files of an M204 database to approximate SQL equivalents and provide some limited SQL functionality using Model 204 SQL Server.\\nModel 204 is most commonly used in government and military applications. Among other things, it runs Australia's social security system. It is used commercially in the UK by Marks & Spencer."],"rdfs:label":["Model 204"],"key:en":["model_204"],"ns:common.topic.article":[{"ns:common.document.text":["Model 204 is a Database management system for IBM and compatible mainframes, which was first deployed in 1972. It incorporates a programming language and an environment for application development. It can deal with very large databases and very high transaction loads.\\nModel 204 relies on its own type of bitmap index, originally devised by Professor Patrick E. O'Neil, and also combines the use of hash table, B-tree, and record list technologies to optimize speed and efficiency of database access.\\nModel 204 is most commonly used in government and military applications. Among other things, it runs Australia's social security system (Centrelink). It is used commercially in the UK by Marks & Spencer. It is also used at the Ventura County Property Tax system in California, and in the New York City Department of Education's Automate The Schools system.\\nIt is a product of Computer Corporation of America (CCA). In April 2010, CCA was acquired by Rocket Software, a Boston-based developer of Enterprise Infrastructure products.\\nAdd-on products are available from Sirius Software, Inc.\\nDatabase Programmer's Toolkit is a freeware PC-based emulation."],"ns:common.document.source_uri":["<http://wp/en/1318381>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Model 204"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12589mwc4"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}