{"ns:m.05f_x0":{"rdfs:label":["LOOM"],"ns:common.topic.description":["Loom is a knowledge representation language developed by researchers in the Artificial Intelligence research group at the University of Southern California's Information Sciences Institute. The leader of the Loom project and primary architect for Loom was Robert Macgregor. The research was primarily sponsored by the Defense Advanced Research Projects Agency.\\nLoom is a Frame based language in the tradition of KL-ONE. As with KL-ONE, Loom has a formal semantics that maps declarations in Loom to statements in set theory and First Order Logic. This formal semantics enables a type of theorem prover engine called a classifier. The classifier can analyze Loom models and deduce various things about the model. For example, the classifier can discover new classes or change the subclass/superclass relations in the model. The classifier can also detect inconsistencies in the model declaration. This is a very powerful and fairly unique capability in that it is capable of doing analysis at the ontology level, the level of declarations rather than at the implementation level as most inference engines do."],"ns:common.topic.article":[{"ns:common.document.text":["Loom or LOOM is a knowledge representation language developed by researchers in the Artificial Intelligence research group at the University of Southern California's Information Sciences Institute. The Loom project's goal is the development and fielding of advanced tools for knowledge representation and reasoning in Artificial Intelligence.\\nLoom is a language and environment for constructing intelligent applications. At its heart is a knowledge representation system that is used to provide deductive support for the declarative portion of the Loom language. Declarative knowledge in Loom consists of definitions, rules, facts, and default rules. A deductive engine called a classifier utilizes forward-chaining, semantic unification and object-oriented truth maintenance technologies in order to compile the declarative knowledge into a network designed to efficiently support on-line deductive query processing.\\nThe Loom system implements a logic-based pattern matcher that drives a production rule facility and a pattern-directed method dispatching facility that supports the definition of object-oriented methods. The high degree of integration between Loom's declarative and procedural"],"ns:common.document.source_uri":["<http://wp/en/1604673>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["LOOM"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256y234m"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.0dn3p3x"]}}