{"ns:m.01xc3x":{"ns:common.topic.description":["Lexico is a programming language in Spanish for learning and teaching object-oriented programming.\\nIt compiles on the .Net Framework"],"rdfs:label":["Lexico"],"key:dataworld.freeq":["job_26bb9675-8b4d-4e50-834d-57d5b518c0e4_var_en_wikipedia_org_wiki_Lexico"],"key:en":["lexico"],"ns:common.topic.article":[{"ns:common.document.text":["Lexico is a Spanish language object-oriented educational programming language based on the .NET Framework.\\nCreated to facilitate the programming education, specifically object-oriented programming techniques, Lexico has been shown to be successful in introducing Spanish-speaking students to the design of algorithms and data structures. Lexico was created by Pretends and other researchers, who verified that it does indeed help students learn faster and keeps them motivated. They hypothesize that this is because students can experiment with algorithm design from the start of their journey in the programming world.\\nBeing an educational language, Lexico's structure is simple: simplicity was chosen before performance. It's sufficiently simple to allow a person to learn the basic concepts of logic, algorithms, data structures. Object-oriented concepts have been simplified by the authors making students' introduction to OO paradigms easier.\\nLexico's blocks are delimited by { ... } like C#, but conditional execution is done with the keyword es? ([it] is [true]?) and iteration with the loop mientras (while). Lexico's two fundamental types are numbers and strings, but it also supports the"],"ns:common.document.source_uri":["<http://wp/en/334948>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Lexico"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258ph_46"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}