{"ns:m.0137z3":{"ns:common.topic.description":["Microsoft BASIC is the foundation product of the Microsoft company. It first appeared in 1975 as Altair BASIC, which was the first BASIC by Microsoft and the first high level programming language available for the Altair 8800 microcomputer."],"rdfs:label":["Microsoft BASIC"],"key:en":["microsoft_basic"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["マイクロソフト ベーシック"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["Microsoft BASIC was the foundation product of the Microsoft company. It first appeared in 1975 as Altair BASIC, which was the first BASIC and the first high level programming language available for the Altair 8800 microcomputer.\\nThe Altair BASIC interpreter was developed by Microsoft founders Paul Allen and Bill Gates with help from Monte Davidoff, using a self made Intel 8080 software simulator running on a PDP-10 minicomputer. The dialect of BASIC was similar to Digital Equipment Corporation interpreters, especially in string operations, which varied between BASIC implementations. BASIC used dynamically allocated strings which stored their size. Early BASIC only supported single letter and digit names, but Microsoft BASIC supported long variable names. Only two characters were significant though; AD, ADDRESS1, and ADDRESS2 would all point to the same value. The runtime symbol table, used a linear search so that a program which used many distinct variables would run much slower than a program which used a single array for all its variables.\\nIt was delivered on paper tape and in its original version took 4 KB of memory. The extended 8 KB version was then generalized into BASIC-80"],"ns:common.document.source_uri":["<http://wp/en/149766>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Microsoft Corporation"],"ns:type.object.name":["Microsoft BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259s01cy"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}