{"ns:m.012c64":{"ns:common.topic.description":["GRASS was a programming language created to script 2D vector graphics animations. GRASS was similar to BASIC in syntax, but added numerous instructions for specifying 2D object animation, including scaling, translation, rotation and color changes over time. It quickly became a hit with the artistic community who were experimenting with the new medium of computer graphics, and will remain most famous for its use by Larry Cuba to create the original \\\"attacking the death star will not be easy\\\" animation in Star Wars. A later version that was adapted to support raster graphics was known as ZGrass."],"rdfs:label":["GRASS"],"key:en":["grass_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["GRASS (GRAphics Symbiosis System) was a programming language created to script 2D vector graphics animations. GRASS was similar to BASIC in syntax, but added numerous instructions for specifying 2D object animation, including scaling, translation, rotation and color changes over time. It quickly became a hit with the artistic community who were experimenting with the new medium of computer graphics, and will remain most famous for its use by Larry Cuba to create the original \\\"attacking the death star will not be easy\\\" animation in Star Wars. A later version that was adapted to support raster graphics was known as ZGrass.\\nThe original version of GRASS was developed by Tom DeFanti for his 1974 Ohio State University Ph.D. thesis. It was developed on a PDP-11/45 driving a Vector General 3DR display, and as the name implies, this was a purely vector graphics machine. GRASS included a number of vector-drawing commands, and could organize collections of them into a hierarchy, applying the various animation effects to whole \\\"trees\\\" of the image at once (stored in arrays). It was this version that was used for the Star Wars animation, if you re-watch this portion of the film you can see"],"ns:common.document.source_uri":["<http://wp/en/144766>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["GRASS"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cdbw0b"],"ns:computer.programming_language.influenced_by":["ns:m.019p2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}