{"ns:m.03cbl66":{"ns:common.topic.description":["Baby Modula-3 is a functional programming sublanguage of Modula-3 programming language based on ideals invented by Martín Abadi. It is an object oriented language for studying programming language design; one part of it is implicitly prototype-oriented programming language, and the other is explicitly statically typed designed for studying computer science type theories. It has been checked as a formal language of metaprogramming systems. It comes from the \\\"Scandinavian School\\\" of object-oriented programming languages.\\nMartín Abadi tried to give an example of pure object-oriented language which would allow the studying of formal semantics of objects. \\\"Baby Modula-3 is defined with a structured operational semantics and with a set of static type rules. A denotational semantics guarantees the soundness of this definition.\\\" This object model has been shown to have well definiteness decidability.\\nThe inventor of Baby Modula-3 worked at Systems Research Center of Digital Equipment Corporation in Palo Alto, California. As DEC was bought by Compaq and Compaq itself was bought by Hewlett-Packard the SRC-report 95 was made available to the public by HP."],"rdfs:label":["Baby modula-3"],"key:en":["baby_modula_3"],"ns:common.topic.article":[{"ns:common.document.text":["Baby Modula-3 is a functional programming sublanguage of Modula-3 (safe subset) programming language based on ideals invented by Martín Abadi. It is a language for studying object oriented design; part of it is implicitly prototype-oriented programming language, explicitly statically typed and designed for studying computer science type theories. It has been checked as a formal language of metaprogramming systems . It comes from the \\\"Scandinavian School\\\" of object-oriented programming languages.\\nMartín Abadi tried to give an example of pure object-oriented language which would allow the studying of formal semantics of objects. \\\"Baby Modula-3 is defined with a structured operational semantics and with a set of static type rules. A denotational semantics guarantees the soundness of this definition.\\\"\\nThe inventor of Baby Modula-3 worked at Systems Research Center (SRC) of Digital Equipment Corporation (DEC) in Palo Alto, California. As DEC was bought by Compaq and Compaq itself was bought by Hewlett-Packard the SRC-report 95 was made available to the public by HP.\\nLuca Cardelli and Martín Abadi wrote the book A Theory of Objects in 1997 laying out formal calculi for the semantics of"],"ns:common.document.source_uri":["<http://wp/en/13603363>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Baby modula-3"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257xhkxl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}