{"ns:m.08_qp2":{"ns:common.topic.description":["GNU Pascal is a Pascal compiler composed of a frontend to GNU Compiler Collection, similar to the way Fortran and other languages were added to GCC. GNU Pascal is ISO 7185 compatible, and it implements \\\"most\\\" of the ISO 10206 Extended Pascal standard.\\nThe major advantage of piggybacking GNU Pascal on the GCC compiler is that it is instantly portable to any platform the GCC compiler supports. However since GPC is a frontend, it does have to adapt if major changes are done to GCC. Typically, new major versions are adopted only slowly. This is probably one of the reasons why developers are looking at a C targeting backend.\\nIn July 2010 a developer publicly asked opinion on the future of GNU Pascal, due to developer shortage and maintenance issues as a GCC port. There was a lively discussion on the maillist where the developers seemed to lean towards reimplementing in C++ with a C code generating backend. The maillist went to sleep again, and as of July 2015 no further releases or announcements had been made.\\nDev-Pascal is a graphical IDE that supports GNU Pascal."],"rdfs:label":["GNU Pascal"],"key:en":["gnu_pascal"],"ns:common.topic.image":[{"ns:type.content.length":["10198"],"ns:type.content.blob_id":["3806e43067e5997bb663ac22d4997b34284bfd8540544d46190c1ac1eec0055b"],"rdfs:label":["Blaise pascal"],"ns:common.licensed_object.provenance":["wikipedia,commons,209146"],"ns:common.image.size":["ns:m.01x49rt"],"ns:type.content.source":["ns:m.02chhpw"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["Blaise pascal"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0dpl83"]}],"ns:common.topic.article":[{"ns:common.document.text":["GNU Pascal (GPC) is a Pascal compiler composed of a frontend to GNU Compiler Collection (GCC), similar to the way Fortran and other languages were added to GCC. GNU Pascal is ISO 7185 compatible, and it implements \\\"most\\\" of the ISO 10206 Extended Pascal standard.\\nThe major advantage of piggybacking GNU Pascal on the GCC compiler is that it is instantly portable to any platform the GCC compiler supports.\\nIn July 2010 a developer publicly asked opinion on the future of GNU Pascal, due to developer shortage and maintenance issues as a GCC port. There was a lively discussion on the maillist where the developers seemed to lean towards reimplementing in C++ with a C code generating backend. The maillist went to sleep again, and as of November 2011 no further releases or announcements had been made."],"ns:common.document.source_uri":["<http://wp/en/3227186>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["GNU Pascal"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fxmnw7"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}