{"ns:m.01p6ck":{"key:user.avh.ellerdale":["0081-0b65"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0081-0b65"],"key:authority.google.google_plus_page":["103998509273059754527"],"ns:common.topic.description":["wxWidgets is a widget toolkit and tools library for creating graphical user interfaces for cross-platform applications. wxWidgets enables a program's GUI code to compile and run on several computer platforms with minimal or no code changes. It covers systems such as Microsoft Windows, OS X, iOS, Linux/Unix, OpenVMS, OS/2 and AmigaOS. A version for embedded systems is under development.\\nwxWidgets is used across many industry sectors, most notably by Xerox, Advanced Micro Devices, Lockheed Martin, NASA and the Center for Naval Analyses. It is also used in the public sector and education by, for example, Dartmouth Medical School, National Human Genome Research Institute, National Center for Biotechnology Information, and many others. wxWidgets is used in many open source projects, and by individual developers. A wide choice of compilers and other tools to use with wxWidgets allows development of highly sophisticated applications.\\nIt is free and open source software, distributed under the terms of the wxWidgets License, which satisfies those who wish to produce for GPL and proprietary software."],"rdfs:label":["wxWidgets"],"key:en":["wxwidgets"],"ns:common.topic.social_media_presence":["<http://plus.google.com/103998509273059754527>"],"ns:common.topic.official_website":["<http://www.wxwidgets.org/>"],"ns:common.topic.article":[{"ns:common.document.text":["wxWidgets (formerly wxWindows) is a widget toolkit and tools library for creating graphical user interfaces (GUIs) for cross-platform applications. wxWidgets enables a program's GUI code to compile and run on several computer platforms with minimal or no code changes. It covers systems such as Microsoft Windows, OS X (Carbon and Cocoa), iOS (Cocoa Touch), Linux/Unix (X11, Motif, and GTK+), OpenVMS, OS/2 and AmigaOS. A version for embedded systems is under development.\\nwxWidgets is used across many industry sectors, most notably by Xerox, Advanced Micro Devices (AMD), Lockheed Martin, NASA and the Center for Naval Analyses. It is also used in the public sector and education by, for example, Dartmouth Medical School, National Human Genome Research Institute, National Center for Biotechnology Information, and many others. wxWidgets is used in many open source projects, and by individual developers. A wide choice of compilers and other tools to use with wxWidgets, allows development of highly sophisticated applications on a tight budget.\\nIt is free and open source software, distributed under the terms of the wxWidgets License, which satisfies those who wish to produce for GPL and"],"ns:common.document.source_uri":["<http://wp/en/274947>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkwqkc"],"ns:common.webpage.uri":["<http://www.wxwidgets.org/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.01p6ck"]}],"ns:common.topic.image":[{"ns:type.content.blob_id":["3b020163fe2d4bbd257d959c00f4c2eeb8ad8bee8f5e2d191c16cab65ec8876b"],"ns:type.content.length":["64072"],"ns:common.image.rights_holder_text_attribution":["Robin Dunn"],"rdfs:label":["WxPython-logo"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:common.image.size":["ns:m.04pjqjq"],"ns:type.content.source":["ns:m.04r3306"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["WxPython-logo"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.043rd4"]}],"ns:type.object.name":["wxWidgets"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bl_rh8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}