{"ns:m.09q0wb":{"rdfs:label":["Advanced Continuous Simulation Language"],"ns:common.topic.description":["The Advanced Continuous Simulation Language, or ACSL, is a computer language designed for modelling and evaluating the performance of continuous systems described by time-dependent, nonlinear differential equations. Like SIMCOS and TUTSIM, ACSL is a dialect of the Continuous System Simulation Language, originally designed by the Simulations Council Inc in 1967 in an attempt to unify the continuous simulations field."],"key:en":["advanced_continuous_simulation_language"],"ns:common.topic.article":[{"ns:common.document.text":["The Advanced Continuous Simulation Language, or ACSL (pronounced \\\"axle\\\"), is a computer language designed for modelling and evaluating the performance of continuous systems described by time-dependent, nonlinear differential equations. It is a dialect of the Continuous System Simulation Language (CSSL), originally designed by the Simulations Council Inc (SCI) in 1967 in an attempt to unify the continuous simulations field.\\nACSL is an equation-oriented language consisting of a set of arithmetic operators, standard functions, a set of special ACSL statements, and a MACRO capability which allows extension of the special ACSL statements.\\nACSL is intended to provide a simple method of representing mathematical models on a digital computer. Working from an equation description of the problem or a block diagram, the user writes ACSL statements to describe the system under investigation.\\nAn important feature of ACSL is its sorting of the continuous model equations, in contrast to general purpose programming languages such as Fortran where program execution depends critically on statement order.\\nApplications of ACSL in new areas are being developed constantly. Typical areas in which ACSL is"],"ns:common.document.source_uri":["<http://wp/en/3614270>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Advanced Continuous Simulation Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255d_sk0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}