{"ns:m.05cntt":{"ns:common.topic.description":["JSON canonically pronounced /ˈdʒeɪsən/ JAY-sən; sometimes JavaScript Object Notation, is an open standard format that uses human-readable text to transmit data objects consisting of attribute–value pairs. It is used primarily to transmit data between a server and web application, as an alternative to XML.\\nAlthough originally derived from the JavaScript scripting language, JSON is a language-independent data format. Code for parsing and generating JSON data is readily available in many programming languages.\\nThe JSON format was originally specified by Douglas Crockford. It is currently described by two competing standards, RFC 7159 and ECMA-404. The ECMA standard is minimal, describing only the allowed grammar syntax, whereas the RFC also provides some semantic and security considerations. The official Internet media type for JSON is application/json. The JSON filename extension is .json."],"rdfs:label":["JSON"],"ns:common.topic.alias":["JavaScript Object Notation"],"ns:user.joehughes.default_domain.data_format.mime_type":["application/json"],"key:en":["json"],"ns:computer.internet_protocol.software_used_by":["Almansur"],"ns:internet.protocol.api":[{"rdfs:label":["Hi5 API"],"ns:common.topic.description":["The Hi5 API provides basic access to Hi5 information via standard protocols like Atom and FOAF. Registered applications can also update and insert information for a user."],"key:en":["hi5_api"],"ns:common.topic.topical_webpage":["<http://api.hi5.com/>"],"ns:common.topic.webpage":["ns:m.02_46fg"],"ns:common.topic.article":["ns:m.02_46jg"],"ns:internet.api.protocols":["ns:m.05cntt"],"ns:type.object.name":["Hi5 API"],"rdf:type":["ns:internet.api"],"ns:common.topic.notable_for":["ns:g.125b_vjz9"],"ns:kg.object_profile.prominent_type":["ns:internet.api"],"ns:common.topic.notable_types":["ns:m.02h7kzv"],"ns:internet.api.site":["ns:m.0bx7jv8"]}],"ns:user.joehughes.default_domain.data_format.media_type":[{"rdfs:label":["application/json"],"ns:type.object.permission":["ns:m.041"],"ns:type.object.name":["application/json"],"key:media_type.application":["json"],"rdf:type":["ns:type.media_type"]}],"ns:common.topic.article":[{"ns:common.document.text":["JSON ( /ˈdʒeɪsən/), or JavaScript Object Notation, is a lightweight text-based open standard designed for human-readable data interchange. It is derived from the JavaScript scripting language for representing simple data structures and associative arrays, called objects. Despite its relationship to JavaScript, it is language-independent, with parsers available for many languages.\\nThe JSON format was originally specified by Douglas Crockford, and is described in RFC 4627. The official Internet media type for JSON is application/json. The JSON filename extension is .json.\\nThe JSON format is often used for serializing and transmitting structured data over a network connection. It is used primarily to transmit data between a server and web application, serving as an alternative to XML.\\nDouglas Crockford was the first to specify and popularize the JSON format.\\nJSON was used at State Software, a company co-founded by Crockford, starting around 2001. The JSON.org website was launched in 2002. In December 2005, Yahoo! began offering some of its web services in JSON. Google started offering JSON feeds for its GData web protocol in December 2006.\\nAlthough JSON was based on a subset of the"],"ns:common.document.source_uri":["<http://wp/en/1575082>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["2002"],"ns:type.object.name":["JSON"],"rdf:type":["ns:user.sandos.computation.serialization"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125c79yfd"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.06kw5"]}}