{"ns:m.01jh8h":{"ns:common.topic.description":["Malbolge is a public domain esoteric programming language invented by Ben Olmstead in 1998, named after the eighth circle of hell in Dante's Inferno, the Malebolge.\\nMalbolge was specifically designed to be almost impossible to use, via a counter-intuitive 'crazy operation', base-three arithmetic and self-altering code. It builds on the difficulty of earlier, challenging esolangs, but takes this aspect to the extreme, playing on the entangled histories of computer science and encryption. Weaknesses in the design have been found that make it possible to write useful Malbolge programs."],"rdfs:label":["Malbolge"],"key:en":["malbolge"],"ns:common.topic.article":[{"ns:common.document.text":["Malbolge is a public domain esoteric programming language invented by Ben Olmstead in 1998, named after the eighth circle of hell in Dante's Inferno, the Malebolge.\\nThe peculiarity of Malbolge is that it was specifically designed to be impossible to write useful programs in. However, weaknesses in this design have been found that make it possible (though still very difficult) to write Malbolge programs in an organized fashion.\\nMalbolge was so difficult to understand when it arrived that it took two years for the first Malbolge program to appear. The program was not even written by a human being: it was generated by a beam search algorithm designed by Andrew Cooke and implemented in Lisp.\\nLater, Lou Scheffer posted a cryptanalysis of Malbolge and provided a program to copy its input to its output.\\nOlmstead believed Malbolge to be a linear bounded automaton. There is a more interesting discussion about whether one can implement sensible loops in Malbolge — it took many years before the first non-terminating one was introduced. A correct 99 Bottles of Beer program, which deals with non-trivial loops and conditions, was not announced for seven years; the first correct one was by"],"ns:common.document.source_uri":["<http://wp/en/237720>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Ben Olmstead"],"ns:computer.programming_language.introduced":["1998"],"ns:type.object.name":["Malbolge"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1254y3f6x"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}