{"ns:m.05967y":{"ns:common.topic.description":["PL/pgSQL is a procedural programming language supported by the PostgreSQL ORDBMS. It closely resembles Oracle's PL/SQL language. Implemented by Jan Wieck, PL/pgSQL first appeared with PostgreSQL 6.4, released on October 30, 1998. Version 9 also implements some ISO SQL/PSM features, like overloading of SQL-invoked functions and procedures.\\nPL/pgSQL, as a fully featured programming language, allows much more procedural control than SQL, including the ability to use loops and other control structures. SQL statements and triggers can call functions created in the PL/pgSQL language.\\nThe design of PL/pgSQL aimed to allow Postgresql users to perform more complex operations and computations than SQL, while providing ease of use. The language is able to be defined as trusted by the server.\\nPL/pgSQL is the only programming language installed by default for PostgreSQL, but many others are available, including PL/Java, PL/Perl, PL/pgPSM, PL/php, PL/Python, PL/R, PL/Ruby, PL/sh, PL/Tcl, and PL/Lua. PostgreSQL uses Bison as its parser, making it easy to port many open-source languages, as well as to reuse code."],"rdfs:label":["PL/pgSQL"],"key:en":["pl_pgsql"],"ns:computer.programming_language.language_designers":["PostgreSQL Global Development Group"],"ns:common.topic.article":[{"ns:common.document.text":["PL/pgSQL (Procedural Language/PostgreSQL Structured Query Language) is a procedural programming language supported by the PostgreSQL ORDBMS. It closely resembles Oracle's PL/SQL language.\\nPL/pgSQL, as a fully featured programming language, allows much more procedural control than SQL, including the ability to use loops and other control structures. Functions created in the PL/pgSQL language can be called from an SQL statement, or as the action that a trigger performs.\\nPL/pgSQL was created to be able to perform more complex operations and computations than SQL, while being easy to use, and is able to be defined as trusted by the server.\\nPL/pgSQL is the only \\\"PL\\\" language installed by default for PostgreSQL, but many others are available, including PL/Java, PL/Perl, PL/php, PL/Python, PL/R, PL/Ruby, PL/sh, PL/Tcl, and PL/Lua."],"ns:common.document.source_uri":["<http://wp/en/1545014>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PL/pgSQL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125ck6_q7"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0609p"]}}