{"ns:m.0bxmp4":{"ns:common.topic.description":["OpenMusic is an object-oriented visual programming environment for musical composition based on Common Lisp. It may also be used as an all-purpose visual interface to Lisp programming."],"rdfs:label":["OpenMusic"],"key:en":["openmusic"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["オープンミュージック"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.image":[{"ns:type.content.length":["9717"],"ns:type.content.blob_id":["9ee38444664b34328fecfa58f468d7b08093c3b58381d713766c8e2e6242e442"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user SecretTheatre"],"rdfs:label":["Om patch"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:type.content.source":["ns:m.0bn6tz8"],"ns:common.image.size":["ns:m.05ply2f"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08wq"],"ns:type.object.name":["Om patch"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0bxmp4"]}],"ns:common.topic.article":[{"ns:common.document.text":["OpenMusic (OM) is an object-oriented visual programming environment for musical composition based on Common Lisp. It may also be used as an all-purpose visual interface to Lisp programming.\\nOpenMusic is a descendant of PatchWork, a computer-assisted composition environment for the Macintosh first developed at IRCAM in the early 1990s. PatchWork was developed primarily by Mikael Laurson, and also OpenMusic owns much of his design indirectly to him. Versions of OpenMusic are currently available for Mac OS X (PowerPC and Intel), Windows. The source code has been released under the GNU Lesser General Public License (LGPL).\\nPrograms in OpenMusic are created by connecting together (a process known as 'patching') either pre-defined or user-defined modules, in a similar manner to graphical signal-processing environments such as Max/MSP or Pd. Unlike such environments, however, the result of an OpenMusic computation will typically be displayed in conventional music notation, which can then be directly manipulated, if so required, via an editor. A substantial body of specialized libraries has been contributed by users, which extends OpenMusic's functionality into such areas as constraint"],"ns:common.document.source_uri":["<http://wp/en/4333062>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["OpenMusic"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255smk65"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}