{"ns:m.01fln6":{"ns:common.topic.description":["Gambas is the name of an object-oriented dialect of the BASIC programming language as well as the integrated development environment that accompanies it. Designed to run on Linux and other Unix-like computer operating systems, its name is a recursive acronym for Gambas Almost Means Basic. Gambas is also the word for prawns in the Spanish and Portuguese language, from which the project's logos are derived."],"rdfs:label":["Gambas"],"key:en":["gambas"],"ns:common.topic.official_website":["<http://gambas.sourceforge.net/>"],"ns:common.topic.article":[{"ns:common.document.text":["Gambas is the name of an object-oriented dialect of the BASIC programming language as well as the integrated development environment that accompanies it. Designed to run on Linux and other Unix-like computer operating systems, its name is a recursive acronym for Gambas Almost Means Basic. Gambas is also the word for prawns in the Spanish language, from which the project's logos are derived.\\nGambas is included in a number of Linux distributions' repositories, such as Debian's, Fedora's, Mandriva Linux's and Ubuntu's. There is a Windows version of Gambas which can run under the Cygwin environment, although this version is significantly less tested than its Linux counterparts and is command line only; coLinux and derivatives have also been used. Development version (since rev 4679) of Gambas can run on Raspberry Pi.\\nGambas was developed by the French programmer Benoît Minisini with its first release coming in 1999. Benoît had grown up with the BASIC language, and decided to make a free software development environment that could quickly and easily make programs with user interfaces.\\nThe Gambas 1.x versions featured an interface made up of several different separate windows for forms"],"ns:common.document.source_uri":["<http://wp/en/215824>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bll_0l"],"ns:common.webpage.uri":["<http://gambas.sourceforge.net/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.01fln6"]}],"ns:computer.programming_language.introduced":["1999"],"ns:type.object.name":["Gambas"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125grm63q"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0fp_1y"]}}