{"ns:m.08bnzs":{"ns:common.topic.description":["Uniface is a development and deployment platform for enterprise applications that can run in a large range of runtime environments, including mobile, mainframe, web, Service-oriented architecture, Windows, Java EE and .NET. Uniface is a model-driven, Rapid Application Development environment used to create mission-critical applications.\\nUniface applications are database- and platform-independent. Uniface provides an integration framework that enables Uniface applications to integrate with all major DBMS products such as Oracle, Microsoft SQL Server, MySQL and IBM DB2. In addition, Uniface also supports file systems such as RMS, Sequential files, operating system text files and a wide range of other technologies, such as mainframe-based products, web services, SMTP and POP email, LDAP directories, .NET, ActiveX, Component Object Model, C programs, and Java. Uniface operates under Microsoft Windows, Windows Mobile, various flavors of Unix and Linux, VMS, IBM iSeries, and z/OS."],"rdfs:label":["Uniface"],"ns:common.topic.article":[{"ns:common.document.text":["Uniface is a development and deployment platform for enterprise applications that can run in a large range of runtime environments, including mobile, mainframe, web, Service-oriented architecture (SOA), Windows, Java EE and .NET. It has been described as a 4GL RDBMS Rapid Application Development (RAD) environment.\\nUniface applications are database- and platform-independent. Uniface provides an integration framework that enables Uniface applications to integrate with all major DBMS products, and a wide range of other technologies, such as mainframe-based products (CICS, IMS), web services, SMTP and POP email, LDAP directories, .NET, ActiveX, Component Object Model (COM), C(++) programs, and Java. Uniface operates under Microsoft Windows, Windows Mobile, various flavors of Unix and Linux, VMS, IBM iSeries, and z/OS.\\nUniface can be used in complex systems that maintain critical enterprise data supporting vital business processes, such as web-based online shopping, financial transactions, salary administration, and inventory control. It is currently used by thousands of companies in more than 30 countries, with an effective installed base of millions. Uniface applications range from"],"ns:common.document.source_uri":["<http://wp/en/2905637>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Uniface"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12561y609"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}