{"ns:m.02m590":{"ns:common.topic.description":["SabreTalk was a dialect of PL/I for the S/360 IBM mainframes running the TPF platform. SabreTalk was developed jointly by American Airlines, Eastern Air Lines and IBM. SabreTalk is known as PL/TPF.\\nSabreTalk programs are still running in the British Airways Flight Operations system, although a commercially available automatic converter is being used to translate SabreTalk programs to C programs. Both the Reservations and Operations Support System of Delta Air Lines were developed using both SabreTalk and IBM 360 Assembler. Although development is currently restricted to C++, the majority of Delta's programming platform remained in Sabretalk until recently in the 2010s.\\nBecause of the translator from SabreTalk to C and because it is no longer supported by the original developers, several companies are beginning the move away from SabreTalk to purely C-based programs.\\nCode Sample:"],"rdfs:label":["SabreTalk"],"key:en":["sabretalk"],"ns:common.topic.article":[{"ns:common.document.text":["SabreTalk is a dialect of PL/I for the S/360 IBM mainframes running the TPF platform. SabreTalk was developed jointly by American Airlines, Eastern Air Lines and IBM.\\nSabreTalk programs are still running in the British Airways Flight Operations system (FICO), although a commercially available automatic converter is being used to translate SabreTalk programs to C programs. Both the Reservations and Operations Support System (OSS) of Delta Air Lines were developed using both SabreTalk and IBM 360 Assembler. Although development is currently restricted to C++, the majority of Delta's programming platform remains in SabreTalk.\\nBecause of the translator from SabreTalk to C and because it is no longer supported by the original developers, several companies are beginning the move away from SabreTalk to purely C-based programs.\\nCode Sample:"],"ns:common.document.source_uri":["<http://wp/en/531030>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["SabreTalk"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125f13snt"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}