{"ns:m.0cvcp":{"ns:common.topic.description":["Lisp Machine Lisp is a dialect of the Lisp programming language. A direct descendant of Maclisp, it was initially developed in the mid to late 1970s as the systems programming language for the MIT Lisp machines. Lisp Machine Lisp was also the Lisp dialect with the most influence on the design of Common Lisp.\\nLisp Machine Lisp itself branched into three dialects. Symbolics named their variant ZetaLisp. Lisp Machines, Inc. and later Texas Instruments would share a common code base, but their dialect of Lisp Machine Lisp would differ from the version maintained at the MIT AI Lab by Richard Stallman and others.\\nThe Lisp Machine Manual describes the Lisp Machine Lisp language in detail. The manual was popularly known as the \\\"Chine Nual\\\", because the full title was printed across the front and back covers such that only those letters appeared on the front. This name is sometimes further abbreviated by blending the two words into \\\"Chinual\\\".\\nSome Lisp Machine Lisp features:\\nit supports object-oriented programming with Flavors\\nit has dynamic binding, but supports closures with a special construct\\ninteger numbers were read and printed in base 8 by default"],"rdfs:label":["Lisp Machine Lisp"],"key:en":["lisp_machine_lisp"],"ns:common.topic.article":[{"ns:common.document.text":["Lisp Machine Lisp is a dialect of the Lisp programming language, a direct descendant of Maclisp, and was initially developed in the mid to late 1970s as the systems programming language for the MIT Lisp machines. Lisp Machine Lisp was also the Lisp dialect with the most influence on the design of Common Lisp.\\nLisp Machine Lisp itself branched into 3 dialects. Symbolics named their variant ZetaLisp. Lisp Machines, Inc. and later Texas Instruments (with the TI Explorer) would share a common code base, but their dialect of Lisp Machine Lisp would differ from the version maintained at the MIT AI Lab by Richard Stallman and others.\\nThe Lisp Machine Manual (also known as the Chinual) describes the Lisp Machine Lisp language in detail.\\nSome Lisp Machine Lisp features:"],"ns:common.document.source_uri":["<http://wp/en/47775>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Lisp Machine Lisp"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d7_1m3"],"ns:computer.programming_language.influenced":["ns:m.01tlw"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}