{"ns:m.05sfxb":{"rdfs:label":["Visual Prolog"],"ns:common.topic.description":["Visual Prolog, also formerly known as PDC Prolog and Turbo Prolog, is a strongly typed object-oriented extension of Prolog. As Turbo Prolog it was marketed by Borland, but it is now developed and marketed by the Danish firm Prolog Development Center that originally developed it. Visual Prolog can build Microsoft Windows GUI-applications, console applications, DLLs, and CGI-programs. It can also link to COM components and to databases by means of ODBC.\\nLogic languages are traditionally interpreted, but Visual Prolog is compiled. This provides the important improvement of converting traditional Prolog-typical run-time errors to compiler warnings, which ensures a better robustness of the finished applications.\\nThe core of Visual Prolog are Horn clauses, algebraic datatypes, pattern matching and controlled non-determinism like in traditional Prolog, but unlike traditional Prolog, Visual Prolog has always been strongly and statically typed."],"key:en":["visual_prolog"],"ns:common.topic.official_website":["<http://www.visual-prolog.com/>"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bl7xmj"],"ns:common.webpage.uri":["<http://www.visual-prolog.com/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.05sfxb"]}],"ns:common.topic.image":[{"ns:type.content.blob_id":["00a66caa08603fc1b0099c8328c3996cd7290ecb5a056d4eb0053136416d7510"],"ns:type.content.length":["74453"],"rdfs:label":["Visual Prolog IDE Screenshot"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.source":["ns:m.03s2c_4"],"ns:common.image.size":["ns:m.03s2cy_"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["Visual Prolog IDE Screenshot"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.05sfxb"]}],"ns:common.topic.article":[{"ns:common.document.text":["Visual Prolog, also formerly known as PDC Prolog and Turbo Prolog, is a strongly typed object-oriented extension of Prolog. As Turbo Prolog it was marketed by Borland, but it is now developed and marketed by the Danish firm Prolog Development Center (PDC) that originally developed it. Visual Prolog can build Microsoft Windows GUI-applications, console applications, DLLs (dynamic link libraries), and CGI-programs. It can also link to COM components and to databases by means of ODBC.\\nVisual Prolog is compiled rather than interpreted, as is traditional for logic languages. This provides the important improvement of converting traditional Prolog-typical run-time errors to compiler warnings, which ensures a better robustness of the finished applications.\\nThe core of Visual Prolog are Horn clauses, pattern matching and controlled non-determinism like in traditional Prolog, but unlike traditional Prolog, Visual Prolog has always been strongly and statically typed.\\nSince version 6.0 the language has been fully object-oriented.\\nVersion 7.0 introduced parametric polymorphism.\\nVersion 7.2 introduced anonymous predicates (a logical pendant to anonymous functions) and namespaces (see also New"],"ns:common.document.source_uri":["<http://wp/en/1741668>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Visual Prolog"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cyg838"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.05vpz"],"ns:computer.programming_language.parent_language":["ns:m.05vpz"]}}