{"ns:m.02544s":{"rdfs:label":["IBM RPG II"],"ns:common.topic.description":["RPG II is a version of the IBM RPG programming language. It was developed in the late 1960s and was offered on a number of different computers, including the IBM 1130, IBM System/3, System/32, System/34, System/36, System/370, The Singer System 10, Univac 90/25, 90/30, 90/40 and the Wang VS Series. ICL also produced versions for its ICL 2903 system and for the VME/K operating system. Further, Burroughs Corporation produced an RPG II compiler with database extensions for its B1700 series of computers.\\nRPG stands for Report Program Generator. RPG is a fixed-format programming language, which means that code must be placed in exact column locations in order to generate correct results. COBOL and BASIC are considered free-format to some extent because the code can be placed variously and still generate correct results.\\nRPG also incorporates fixed logic, which means that files are opened when the program begins and closed when the program ends, even though this is not explicitly stated; special variables such as UDATE, UYEAR, PAGE, and so forth, are filled when the program begins or when page overflow occurs, even though there is no explicit instruction for these activities."],"key:en":["rpg_ii"],"ns:common.topic.article":[{"ns:common.document.text":["RPG II is a version of the IBM RPG programming language. It was developed in the late 1960s and was offered on a number of different computers, including the IBM System/3, System/32, System/34, System/36, System/370, The Singer System 10, and the Wang VS Series. ICL also produced versions for its ICL 2903 system and for the VME/K operating system. Further, Burroughs Corporation produced an RPG II compiler with database extensions for its B1700 series of computers.\\nRPG stands for Report Program Generator. RPG is a fixed-format programming language, which means that code must be placed in exact column locations in order to generate correct results. COBOL and BASIC are considered free-format to some extent because the code can be placed variously and still generate correct results.\\nRPG also incorporates fixed logic, which means that files are opened when the program begins and closed when the program ends, even though this is not explicitly stated; special variables such as UDATE, UYEAR, PAGE, and so forth, are filled when the program begins or when page overflow occurs, even though there is no explicit instruction for these activities. Total calculations and output are done at \\\"total"],"ns:common.document.source_uri":["<http://wp/en/411454>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IBM RPG II"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bxt5bx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.02yrkx"]}}