{"ns:m.03crjgp":{"ns:common.topic.description":["CGOL is an alternative syntax featuring an extensible algebraic notation for the Lisp programming language. It was designed for MACLISP by Vaughan Pratt and subsequently ported to Common Lisp.\\nThe notation of CGOL is a traditional algebraic notation, in the style of ALGOL, rather than Lisp's traditional, uniformly-parenthesized prefix notation syntax. The CGOL parser is based on Pratt's design for top-down operator precedence parsing, sometimes informally referred to as a \\\"Pratt parser\\\".\\nSemantically, CGOL is essentially just Common Lisp, with some additional reader and printer support."],"rdfs:label":["CGOL"],"key:en":["cgol"],"ns:common.topic.article":[{"ns:common.document.text":["CGOL (pronounced \\\"see goll\\\") is an alternative syntax for the MACLISP programming language, featuring an extensible algebraic notation. It was created by Vaughan Pratt.\\nThe notation of CGOL is a traditional algebraic notation (sometimes called \\\"infix syntax\\\"), in the style of ALGOL, rather than Lisp's traditional, uniformly-parenthesized syntax. The CGOL parser is based on Pratt's design for top-down operator precedence parsing, sometimes informally referred to as a \\\"Pratt parser\\\".\\nSemantically, CGOL is essentially just MACLISP, with some additional reader and printer support.\\nSpecial notations are available for many commonly used MACLISP operations. For example, one can write a matrix multiply routine as:\\nCGOL has an infix . operation (referring to MACLISP's cons function) and the infix @ operation (referring to MACLISP's append function):\\nThe preceding example corresponds to this text in native MACLISP:\\nCGOL uses of to read and set properties:\\nThe preceding example corresponds to this text in native MACLISP:\\nThis illustrates how CGOL notates a function of two arguments:\\nThe preceding example corresponds to this text in native MACLISP:\\nThe syntax of CGOL is data-driven and so both"],"ns:common.document.source_uri":["<http://wp/en/14030444>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1973"],"ns:type.object.name":["CGOL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256dx3z_"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}