{"ns:m.04dxh8":{"ns:common.topic.description":["IronPython is an implementation of the Python programming language targeting the .NET Framework and Mono. Jim Hugunin created the project and actively contributed to it up until Version 1.0 which was released on September 5, 2006. Thereafter, it was maintained by a small team at Microsoft until the 2.7 Beta 1 release; Microsoft abandoned IronPython in late 2010, after which Hugunin left to work at Google. IronPython 2.0 was released on December 10, 2008. The project is currently maintained by a group of volunteers at Microsoft's CodePlex open-source repository. It is free and open-source software, and can be implemented with Python Tools for Visual Studio, which is a free and open-source extension for free, isolated, and commercial versions of Microsoft's Visual Studio IDE.\\nIronPython is written entirely in C#, although some of its code is automatically generated by a code generator written in Python.\\nIronPython is implemented on top of the Dynamic Language Runtime, a library running on top of the Common Language Infrastructure that provides dynamic typing and dynamic method dispatch, among other things, for dynamic languages. The DLR is part of the ."],"rdfs:label":["IronPython"],"key:en":["ironpython"],"ns:common.topic.official_website":["<http://ironpython.codeplex.com/>"],"ns:computer.programming_language.developers":["Jim Hugunin"],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://ironpython.net/>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0blv7dp"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.04dxh8"]}],"ns:common.topic.article":[{"ns:common.document.text":["IronPython is an implementation of the Python programming language targeting the .NET Framework and Mono. Jim Hugunin created the project and actively contributed to it up until Version 1.0 which was released on September 5, 2006. Thereafter, it was maintained by a small team at Microsoft until the 2.7 Beta 1 release; Microsoft abandoned IronPython (and its sister project IronRuby) in late 2010, after which event Hugunin left to work at Google. IronPython 2.0 was released on December 10, 2008.\\nIronPython is written entirely in C#, although some of its code is automatically generated by a code generator written in Python.\\nIronPython is implemented on top of the Dynamic Language Runtime (DLR), a library running on top of the Common Language Infrastructure that provides dynamic typing and dynamic method dispatch, among other things, for dynamic languages. The DLR is part of the .NET Framework 4.0 and is also a part of trunk builds of Mono. The DLR can also be used as a library on older CLI implementations.\\nRelease 2.0, released on December 10, 2008, and updated as 2.0.3 on October 23, 2009, targets CPython 2.5. IronPython 2.0.3 is only compatible up to .NET Framework 3.5.\\nRelease 2.6,"],"ns:common.document.source_uri":["<http://wp/en/1179348>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IronPython"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259212_j"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.parent_language":["ns:m.05z1_"]}}