{"ns:m.03gxv97":{"rdfs:label":["Cool"],"ns:common.topic.description":["Cool, an acronym for Classroom Object Oriented Language, is a computer programming language designed by Alexander Aiken for use in an undergraduate compiler course project. While small enough for a one term project, Cool still has many of the features of modern programming languages, including objects, automatic memory management, strong static typing and simple reflection.\\nThe reference Cool compiler is written in C++, built fully on the public domain tools. It generates code for a MIPS simulator, SPIM. Thus, the language should port easily to other platforms. It has been used for teaching compilers at many institutions and the software is stable.\\nThis language is unrelated to the COOL language included in CLIPS."],"ns:common.topic.article":[{"ns:common.document.text":["Cool, an acronym for Classroom Object Oriented Language, is a computer programming language designed by Alexander Aiken for use in an undergraduate compiler course project. While small enough for a one term project, Cool still has many of the features of modern programming languages, including objects, automatic memory management, strong static typing and simple reflection.\\nThe reference Cool compiler is written in C++, built fully on public domain tools. It generates code for a MIPS simulator, SPIM. Thus, the language should port easily to other platforms. It has been used for teaching compilers at many institutions (such as the University of California at Berkeley, where it was first used) and the software is stable.\\nOther lecturers such as John Tang Boyland (author of the Sather164 language, precursor of Cool) and Allan Jost have developed some dialects of Cool to be used in their own classes.\\nThis language is unrelated to the COOL language included in CLIPS.\\nAs the primary purpose of Cool is instruction, it lacks many of the features common to other, more general programming languages. For instance, the language supports less than comparisons but not greater than. The syntax is"],"ns:common.document.source_uri":["<http://wp/en/14782123>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1996"],"ns:type.object.name":["Cool"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12588_zvk"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.07sbkfb"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}