{"ns:m.070m83":{"ns:common.topic.description":["AutoIt /ɔːtoʊ ɪt/ is a freeware automation language for Microsoft Windows. In its earliest release, the software was primarily intended to create automation scripts for Microsoft Windows programs but has since grown to include enhancements in both programming language design and overall functionality.\\nWhile the scripting language in AutoIt 1 and 2 was statement-driven, designed primarily for simulating user interaction, from version 3 onwards the AutoIt syntax is similar to that found in the BASIC family of languages. In this form, AutoIt is a general-purpose, third-generation programming language with a classical data model and a variant data type that can store several types of data, including arrays. While version 1 and 2 were compatible with Windows 95, 98, ME, NT4, 2000, XP, 2003, Vista and Windows 7, support for operating systems older than Windows 2000 was discontinued with the release of v3.3.0 in December 2008.\\nAn AutoIt automation script can be converted into a compressed, stand-alone executable which can be run on computers that do not have the AutoIt interpreter installed."],"rdfs:label":["AutoIt"],"key:en":["autoit"],"ns:common.topic.official_website":["<http://www.autoitscript.com/autoit3/>"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["オートイット"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bjftvp"],"ns:common.webpage.uri":["<http://www.autoitscript.com/autoit3/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.070m83"]}],"ns:common.topic.image":[{"ns:type.content.length":["130322"],"ns:type.content.blob_id":["6234fc1e775a9c2f107d9eeee9e7a6f5857cc04fa092144b1b935f8058a20c03"],"rdfs:label":["The AutoIt SciTE editor."],"ns:common.licensed_object.license":["ns:m.03mtdvv"],"ns:common.image.size":["ns:m.03t5vqn"],"ns:type.content.source":["ns:m.04rxhpv"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["The AutoIt SciTE editor."],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.070m83"]}],"ns:common.topic.article":[{"ns:common.document.text":["AutoIt (pronounced aw-tow-it) is a freeware automation language for Microsoft Windows. In its earliest release, the software was primarily intended to create automation scripts (sometimes called macros) for Microsoft Windows programs but has since grown to include enhancements in both programming language design and overall functionality.\\nWith the release of Version 3, the syntax of AutoIt has been restructured to be more like the BASIC family of languages. It is a third-generation programming language using a classical data model, utilizing a variant data type that can store several types of data, including arrays. It is compatible with Windows 95, 98, ME, NT4, 2000, XP, 2003, Vista and Windows 7 (however, support for operating systems older than Windows 2000 was discontinued with the release of v3.3.0).\\nAn AutoIt automation script can be compiled into a compressed, stand-alone executable which can be run on computers that do not have the AutoIt interpreter installed. A wide range of function libraries (known as UDF's, or \\\"User Defined Functions\\\") are also included as standard or are available from the website to add specialized functionality. AutoIt is also distributed with an"],"ns:common.document.source_uri":["<http://wp/en/2281448>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["AutoIt"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bl7yk_"],"ns:computer.programming_language.influenced_by":["ns:m.019p2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.02r5chy"]}}