{"ns:m.08k27x":{"ns:common.topic.description":["NGL is a function-level array programming language featuring an iconical mathematical notation and tuple pattern matching.\\nNGL was the result of research performed during 2001-2004 by Ernst Herrera Legorreta looking for ways to apply function-level programming languages to bioinformatics, large scale multidimensional data warehouses and data mining algorithms. Initially, the J language was used, but soon it was decided to create a new language atop it, one that would support a different notation style, plus pattern matching and related syntax. NGL compiles to J, but an NGL-to-J function is also available at run-time, to provide dynamic behavior.\\nNGL incorporates the FL language's user-defined datatype features that were not implemented in J.\\nNGL is intended to support and extend Kenneth E. Iverson's and John Backus' ideas that programming language notation is an important factor in determining the expressive power of a language."],"rdfs:label":["NGL"],"key:en":["ngl_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["NGL (short for aNGeL) is a function-level array programming language featuring an iconical mathematical notation and tuple pattern matching.\\nNGL was the result of research performed during 2001-2004 by Ernst Herrera Legorreta looking for ways to apply function-level programming languages to bioinformatics, large scale multidimensional data warehouses and data mining algorithms. Initially, the J language was used, but soon it was decided to create a new language atop it, one that would support a different notation style, plus pattern matching and related syntax. NGL compiles to J, but an NGL-to-J J function is also available at run-time, to provide dynamic behavior.\\nNGL incorporates the FL language's user-defined datatype features that were not implemented in J.\\nNGL is intended to support and extend Kenneth E. Iverson's and John Backus' ideas that programming language notation is an important factor in determining the expressive power of a language."],"ns:common.document.source_uri":["<http://wp/en/3005665>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["NGL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258vfwfc"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}