{"ns:m.0bgj_v":{"ns:common.topic.description":["ToonTalk is a computer programming system intended to be programmed by children. The \\\"Toon\\\" part stands for cartoon. The system's presentation is in the form of animated characters, including robots that can be trained by example. It is one of the few successful implementations outside academia of the concurrent constraint logic programming paradigm.\\nIt was created by Kenneth M. Kahn in 1995, and implemented as part of the ToonTalk IDE, a software package distributed worldwide between 1996 and 2009. Since 2009, its specification is scholarly published and its implementation is freely available.\\nBeyond its life as a commercial product, ToonTalk evolved via significant academic use in various research projects, notably at the London Knowledge Lab and the Institute of Education - projects Playground and WebLabs, which involved research partners from Cambridge, Portugal, Sweden, Slovakia, Bulgaria, Cyprus, and Italy. It was also source of academic interest in Finland, where Mikael Kindborg proposed a static representation of ToonTalk programs and in Portugal, where Leonel Morgado studied its potential to enable computer programming by preliterate children."],"rdfs:label":["ToonTalk"],"key:en":["toontalk_computer_programming_language"],"ns:computer.programming_language.language_designers":["Ken Kahn"],"ns:common.topic.article":[{"ns:common.document.text":["ToonTalk is a computer programming system intended to be programmed by children. The \\\"Toon\\\" part stands for cartoon. The system's presentation is in the form of animated characters, including robots that can be trained by example. It is one of the few successful implementations outside academia of the concurrent constraint logic programming paradigm.\\nIt was created by Kenneth M. Kahn in 1995, and implemented as part of the ToonTalk IDE, a software package distributed worldwide between 1996 and 2009. Since 2009, its specification is scholarly published and its implementation is freely available.\\nBeyond its life as a commercial product, ToonTalk evolved via significant academic use in various research projects, notably at the London Knowledge Lab and the Institute of Education - projects Playground and WebLabs, which involved research partners from Cambridge (Logotron), Portugal (Cnotinfor and the University of Lisbon), Sweden (Royal Institute of Technology), Slovakia (Comenius University), Bulgaria (Sofia University), Cyprus (University of Cyprus), and Italy (Institute for Educational Technology of the Consiglio Nazionale delle Ricerche). It was also source of academic interest in"],"ns:common.document.source_uri":["<http://wp/en/4070265>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.toontalk.com>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0bgj_v"]}],"ns:computer.programming_language.introduced":["1995"],"ns:type.object.name":["ToonTalk"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255tpdyl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0bfn7f"]}}