{"ns:m.01zpg":{"ns:common.topic.description":["COBOL is a compiled English-like computer programming language designed for business use. It is imperative, procedural and, since 2002, object-oriented. COBOL is primarily used in business, finance, and administrative systems for companies and governments. In 1997, Gartner Group estimated that there were a total of 200 billion lines of COBOL in existence, which ran 80% of all business programs. COBOL is still widely used in legacy applications deployed on mainframe computers, such as large-scale batch and transaction processing jobs. But due to its declining popularity and the retirement of experienced COBOL programmers, programs are being migrated to new platforms, rewritten in modern languages or replaced with software packages. Most programming in COBOL is now purely to maintain existing applications.\\nCOBOL was designed in 1959 by the Conference on Data Systems Languages and was partly based on previous programming language design work by Grace Hopper, commonly referred to as \\\"the mother of COBOL\\\". It was created as part of a US Department of Defense effort to create a portable programming language for data processing."],"rdfs:label":["COBOL"],"ns:common.topic.alias":["COmmon Business-Oriented Language"],"key:en":["cobol"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["コボル"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:computer.programming_language.language_designers":["Grace Hopper"],"ns:common.topic.article":[{"ns:common.document.text":["COBOL ( /ˈkoʊbɒl/) is one of the oldest programming languages. Its name is an acronym for COmmon Business-Oriented Language, defining its primary domain in business, finance, and administrative systems for companies and governments.\\nThe COBOL 2002 standard includes support for object-oriented programming and other modern language features.\\nThe COBOL specification was created by a committee of researchers from private industry, universities, and government during the second half of 1959. The specifications were to a great extent inspired by the FLOW-MATIC language invented by Grace Hopper - commonly referred to as \\\"the mother of the COBOL language.\\\" The IBM COMTRAN language invented by Bob Bemer was also drawn upon, but the FACT language specification from Honeywell was not distributed to committee members until late in the process and had relatively little impact. FLOW-MATIC's status as the only language of the bunch to have actually been implemented made it particularly attractive to the committee.\\nThe scene was set on April 8, 1959 at a meeting of computer manufacturers, users, and university people at the University of Pennsylvania Computing Center. The United States Department"],"ns:common.document.source_uri":["<http://wp/en/6799>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.developers":["Grace Hopper"],"ns:base.ontologies.ontology_instance.equivalent_instances":[{"ns:base.ontologies.ontology_instance_mapping.uri":["<http://sw.opencyc.org/concept/Mx4rvVjH05wpEbGdrcN5Y29ycA>"],"ns:base.ontologies.ontology_instance_mapping.ontology":["ns:m.04dm2p_"],"rdf:type":["ns:base.ontologies.ontology_instance_mapping"],"ns:base.ontologies.ontology_instance_mapping.freebase_topic":["ns:m.01zpg"]}],"ns:computer.programming_language.introduced":["1959"],"ns:type.object.name":["COBOL"],"rdf:type":["ns:user.uoa_it.uoa_it.uoa_technology"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dr6crp"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:computer.programming_language.influenced":["ns:m.05xjv"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.01xrtrs"],"ns:user.uoa_it.uoa_it.uoa_technology.used_for":["ns:m.04j4vtn"],"ns:computer.programming_language.influenced_by":["ns:m.0l6nk"]}}