{"ns:m.03v8l9":{"ns:common.topic.description":["Datalog is a truly declarative logic programming language that syntactically is a subset of Prolog. It is often used as a query language for deductive databases. In recent years, Datalog has found new application in data integration, information extraction, networking, program analysis, security, and cloud computing.\\nIts origins date back to the beginning of logic programming, but it became prominent as a separate area around 1977 when Hervé Gallaire and Jack Minker organized a workshop on logic and databases. David Maier is credited with coining the term Datalog."],"rdfs:label":["Datalog"],"key:en":["datalog"],"ns:computer.programming_language.language_designers":["Herve Gallaire"],"ns:common.topic.article":[{"ns:common.document.text":["Datalog is a query and rule language for deductive databases that syntactically is a subset of Prolog. Its origins date back to the beginning of logic programming, but it became prominent as a separate area around 1977 when Hervé Gallaire and Jack Minker organized a workshop on logic and databases. David Maier is credited with coining the term Datalog.\\nIn recent years, Datalog has found new application in data integration, information extraction, networking, program analysis, security, and cloud computing.\\nQuery evaluation with Datalog is based on first order logic, and is thus sound and complete. It can be done efficiently even for large databases. Query evaluation is usually done using bottom-up strategies.\\nIn contrast to Prolog, it\\nA benefit of these constraints is that datalog queries on finite sets always terminate (unlike Prolog programs). Another is that statements and predicates of a program can be stated in any order (unlike Prolog). Various methods have been proposed to efficiently perform queries, e.g. the Magic Sets algorithm, or tabled logic programming.\\nDatalog engines are behind specialised database systems such as Intellidimension's database for the semantic web."],"ns:common.document.source_uri":["<http://wp/en/968357>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1978"],"ns:type.object.name":["Datalog"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256prny_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.075st"],"ns:computer.programming_language.language_paradigms":["ns:m.04k52"],"ns:computer.programming_language.influenced_by":["ns:m.05vpz"],"ns:computer.programming_language.parent_language":["ns:m.05vpz"]}}