{"ns:m.02x8svn":{"ns:common.topic.description":["lolcode\\nThe idiosyncratic conventions of lolcat captions are echoed in the esoteric programming language called LOLCode. For example, a simple hello world demonstration reads:\\nHAI\\nCAN HAS STDIO?\\nVISIBLE \\\"HAI WORLD!\\\"\\nKTHXBYE"],"rdfs:label":["LOLCODE"],"key:en":["lolcode"],"ns:common.topic.article":[{"ns:common.document.updated":["\"2008-04-30T17:31:13.106480Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime>"],"ns:common.document.text":["LOLCODE is an esoteric programming language inspired by the language expressed in examples of the lolcat Internet meme. The language was created in 2007 by Adam Lindsay, researcher at the Computing Department of Lancaster University.\\nThe language is not clearly defined in terms of operator priorities and correct syntax, but several functioning interpreters and compilers already exist. One interpretation of the language has been proven Turing-complete.\\nLOLCODE's keywords are drawn from the heavily compressed (shortened) patois of the lolcat Internet meme. Here follows a Hello world program and a simple program to output a file to a monitor. Similar code was printed in the Houston Chronicle.\\nIn this example, commands to open a file (PLZ OPEN FILE \\\"NAME\\\"? — \\\"Please try to open a file?\\\"), and error handling (AWSUM THX — \\\"Awesome, thanks!\\\", and O NOES — \\\"Oh no!\\\") are introduced.\\nOther commands include I HAS A variable for declaring variables, variable R value (\\\"variable [is/are/being] value\\\") for assigning them, sending error messages to the front end via INVISIBLE instead of VISIBLE, and BTW (\\\"by the way\\\") to denote a comment, making the parser ignore the rest of the line. Loops are"],"ns:common.document.content":["ns:m.040_fb0"],"rdf:type":["ns:common.document"],"ns:common.document.source_uri":["<http://wp/en/15450778>"]}],"ns:computer.programming_language.introduced":["2007"],"ns:type.object.name":["LOLCODE"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257bn7zq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.02v8bwg"],"ns:computer.programming_language.dialects":["ns:m.0lnrh6h"]}}