{"ns:m.04q2br":{"ns:common.topic.description":["Esterel is a synchronous programming language for the development of complex reactive systems. The imperative programming style of Esterel allows the simple expression of parallelism and preemption. As a consequence, it is well suited for control-dominated model designs.\\nThe development of the language started in the early 1980s, and was mainly carried out by a team of Ecole des Mines de Paris and INRIA led by Gérard Berry. Current compilers take Esterel programs and generate C code or hardware implementations.\\nThe language is still under development, with several compilers out. The commercial version of Esterel is the development environment Esterel Studio. The company that commercialize it initiated a normalization process with the IEEE in April 2007 however the working group dissolved March 2011. The Esterel v7 Reference Manual Version v7 30 – initial IEEE standardization proposal is publicly available."],"rdfs:label":["Esterel"],"key:en":["esterel"],"ns:common.topic.article":[{"ns:common.document.text":["Esterel is a synchronous programming language for the development of complex reactive systems. The imperative programming style of Esterel allows the simple expression of parallelism and preemption. As a consequence, it is very well suited for control-dominated model designs.\\nThe development of the language started in the early 1980s, and was mainly carried out by a team of Ecole des Mines de Paris and INRIA led by Gérard Berry. Current compilers take Esterel programs and generate C code or hardware (RTL) implementations (VHDL or Verilog).\\nThe language is still under development, with several compilers out. The commercial version of Esterel is the development environment Esterel Studio. The company that commercialize it (Synfora) has initiated a normalization process with the IEEE. The Esterel v7 Reference Manual Version v7 30 – initial IEEE standardization proposal is publicly available.\\nThe notion of time used in Esterel differs from that of non-synchronous languages in the following way: The notion of physical time is replaced with the notion of order. Only the simultaneity and presence of events are considered. This means that the physical time does not play any special role."],"ns:common.document.source_uri":["<http://wp/en/1285078>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Esterel"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125ccl073"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}