{"ns:m.05p0d":{"ns:common.topic.description":["occam is a concurrent programming language that builds on the communicating sequential processes process algebra, and shares many of its features. It is named after William of Ockham of Occam's Razor fame.\\noccam is an imperative procedural language. It was developed by David May and others at INMOS, advised by Tony Hoare, as the native programming language for their transputer microprocessors, but implementations for other platforms are available. The most widely known version is occam 2; its programming manual was written by Steven Ericsson-Zenith and others at INMOS."],"key:en":["occam"],"rdfs:label":["occam"],"ns:common.topic.article":[{"ns:common.document.text":["occam is a concurrent programming language that builds on the Communicating Sequential Processes (CSP) process algebra, and shares many of its features. It is named after William of Ockham of Occam's Razor fame.\\noccam is an imperative procedural language (such as Pascal). It was developed by David May and others at INMOS, advised by Tony Hoare, as the native programming language for their transputer microprocessors, but implementations for other platforms are available. The most widely known version is occam 2; its programming manual was written by Steven Ericsson-Zenith and others at INMOS.\\nIn the following examples indentation and formatting are critical for parsing the code: expressions are terminated by the end of the line, lists of expressions need to be on the same level of indentation. This feature, named the off-side rule, is also found in other languages such as Haskell and Python.\\nCommunication between processes work through named channels. One process outputs data to a channel via \\\"!\\\" while another one inputs data with \\\"?\\\". Input and output will block until the other end is ready to accept or offer data. Examples (c is a variable):\\nSEQ introduces a list of expressions"],"ns:common.document.source_uri":["<http://wp/en/22660>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1983"],"ns:type.object.name":["occam"],"rdf:type":["ns:symbols.namesake"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257jmd_t"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"],"ns:computer.programming_language.influenced_by":["ns:m.01ksbf"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.09gjwxg"],"ns:computer.programming_language.dialects":["ns:m.06krns"],"ns:symbols.namesake.named_after":["ns:m.0848q"]}}