{"ns:m.0268yl":{"ns:common.topic.alias":["J Sharp"],"rdfs:label":["J#"],"ns:common.topic.description":["Visual J# programming language was a transitional language for programmers of Java and Visual J++ languages, so they could use their existing knowledge and applications on .NET Framework.\\nJ# worked with Java bytecode as well as source so it could be used to transition applications that used third-party libraries even if their original source code was unavailable. It was developed by the Hyderabad-based Microsoft India Development Center at HITEC City in India."],"ns:common.topic.article":[{"ns:common.document.text":["Visual J# (pronounced 'jay-sharp') programming language is a discontinued transitional language for programmers of Java and Visual J++ languages, so they may use their existing knowledge and applications on .NET Framework.\\nIn programming, J# can work with Java bytecode as well as source so it can be used to transition applications that use third-party libraries even if their original source code is unavailable. It was developed by the Hyderabad-based Microsoft India Development Center at HITEC City in India.\\nJava and J# use the same general syntax but there are non-Java conventions in J# to support the .NET environment. For example, to use .NET \\\"properties\\\" with a standard JavaBean class, it is necessary to prefix getXxx and setXxx methods with the Javadoc-like annotation:\\n...and change the corresponding private variable name to be different from the suffix of the getXxx/setXxx names.\\nJ# does not compile Java-language source code to Java bytecode (.class files), and does not support Java applet development or the ability to host applets directly in a web browser, although it does provide a wrapper called Microsoft J# Browser Controls for hosting them as ActiveX objects. Finally,"],"ns:common.document.source_uri":["<http://wp/en/419765>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Microsoft Corporation"],"ns:computer.programming_language.introduced":["2002"],"ns:type.object.name":["J#"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259dwc9z"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.07sbkfb"]}}