{"ns:m.0cgkpd":{"ns:common.topic.description":["QVT is a standard set of languages for model transformation defined by the Object Management Group."],"rdfs:label":["QVT"],"key:en":["qvt"],"ns:common.topic.image":[{"ns:type.content.length":["45665"],"rdfs:label":["QVT Architecture"],"ns:type.content.blob_id":["f5d2607931bfea9ab0a54adda30db5825e7342ab6bd293cf8aa0c2f5927c4304"],"ns:common.licensed_object.provenance":["wikipedia,en,5455367"],"ns:type.content.source":["ns:m.02f0srx"],"ns:common.image.size":["ns:m.02f0ss1"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["QVT Architecture"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0cgkpd"]}],"ns:common.topic.article":[{"ns:common.document.text":["QVT (Query/View/Transformation) is a standard set of languages for model transformation defined by the Object Management Group .\\nModel transformation is a key technique used in model-driven architecture. As the name QVT indicates, the OMG standard covers transformations, views and queries together. Model queries and model views can be seen as special kinds of model transformation, provided that we use a suitably broad definition of model transformation: a model transformation is a program which operates on models.\\nThe QVT standard defines three model transformation languages. All of them operate on models which conform to MOF 2.0 metamodels; the transformation states which metamodels are used. A transformation in any of the three QVT languages can itself be regarded as a model, conforming to one of the metamodels specified in the standard. The QVT standard integrates the OCL 2.0 standard and also extends it with imperative features.\\nFinally there is a mechanism called QVT-BlackBox for invoking transformation facilities expressed in other languages (for example XSLT or XQuery).\\nAlthough QVT has a broad scope, it does not cover everything that has been considered as a model"],"ns:common.document.source_uri":["<http://wp/en/4672713>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["QVT"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256q6wjy"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}