{"ns:m.0bgsgk":{"rdfs:label":["Apple Media Tool"],"ns:common.topic.description":["The Apple Media Tool was a multimedia authoring tool and associated programming environment sold by Apple in the late 1990s. It was primarily aimed at producing multimedia presentations for distribution on CD-ROM and was aimed at graphic designers who did not have programming experience. It featured an advanced user interface with an object-oriented user model that made production of rich and complex presentations easy."],"key:en":["apple_media_tool"],"ns:common.topic.article":[{"ns:common.document.text":["The Apple Media Tool was a multimedia authoring tool and associated programming environment sold by Apple in the late 1990s. It was primarily aimed at producing multimedia presentations for distribution on CD-ROM and was aimed at graphic designers who did not have programming experience. It featured an advanced user interface with an object-oriented user model that made production of rich and complex presentations easy.\\nThe AMT system was developed by Patrick Soquet, a developer in Belgium working for Arborescence a French company that was later acquired by Havas. From 1993 onwards it was marketed by Apple but all development was done by the independent team led by M. Soquet. In 1996 development of the tool was taken over by Apple and the 2.1 version of the program was developed in house by a team of engineers in California led by Dan Crow. In 1997 Apple decided to concentrate its multimedia offerings on QuickTime and HyperCard and the rights to AMT returned to Havas. Patrick Soquet acquired these rights and co-founded Tribeworks and developed a new tool based on AML, called iShell.\\nThe major features of the Apple Media Tool were a graphical authoring tool (AMT itself) and an"],"ns:common.document.source_uri":["<http://wp/en/4074240>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Apple Media Tool"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259zlytl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}