{"ns:m.03s_02":{"ns:common.topic.description":["Edinburgh IMP is a development of ATLAS Autocode, initially developed around 1966-1969 at Edinburgh University, Scotland. IMP was a general-purpose programming language which was used heavily for systems programming.\\nExpressively, IMP is extremely similar to Algol and includes all the Algol-style block structure, reserved keywords, and datatypes such as arrays and records. It adds to Algol-style languages a string type and built-in operators for string manipulation and character handling.\\nIMP provides significant control over the storage mapping of data, plus commands for addressing within parts of words. Most Imp compilers offer compiler-generated run-time checks and a backtrace facility by default, even in production code. IMP allows the programmer to inline machine language instructions in the IMP source code.\\nEarly IMP compilers were developed for the ICL System 4, UNIVAC 1108, IBM 360, DEC PDP-9, DEC PDP-15 and CTL Modular One computers. IMP was used to implement the EMAS operating system."],"rdfs:label":["Edinburgh IMP"],"key:en":["edinburgh_imp"],"ns:common.topic.article":[{"ns:common.document.text":["Edinburgh IMP is a development of ATLAS Autocode, initially developed around 1966-1969 at Edinburgh University, Scotland. IMP was a general-purpose programming language which was used heavily for systems programming.\\nExpressively, IMP is extremely similar to Algol and includes all the Algol-style block structure, reserved keywords, and datatypes such as arrays and records. It adds to Algol-style languages a string type (akin to a flex array of char) and built-in operators for string manipulation and character handling.\\nIMP provides significant control over the storage mapping of data, plus commands for addressing within parts of words. Most Imp compilers offer compiler-generated run-time checks and a backtrace facility by default, even in production code. IMP allows the programmer to inline machine language instructions in the IMP source code.\\nEarly IMP compilers were developed for the ICL System 4, UNIVAC 1108, IBM 360, DEC PDP-9, DEC PDP-15 and CTL Modular One computers. IMP was used to implement the EMAS operating system. In later years a version of IMP called IMP77 was developed by Peter Robertson within the Computer Science department at Edinburgh which was a portable compiler"],"ns:common.document.source_uri":["<http://wp/en/953419>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Edinburgh IMP"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257fk248"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}