{"ns:m.01h67x":{"ns:common.topic.description":["Inform is a programming language and design system for interactive fiction originally created in 1993 by Graham Nelson. Inform can generate programs designed for the Z-code or Glulx virtual machines. Versions 1 through 5 were released between 1993 and 1996. Around 1996, Nelson rewrote Inform from first principles to create version 6. Over the following decade, version 6 became reasonably stable and a popular language for writing interactive fiction. In 2006, Nelson released Inform 7, a completely new language based on principles of natural language and a new set of tools based around a book-publishing metaphor."],"rdfs:label":["Inform"],"key:en":["inform"],"ns:common.topic.topical_webpage":["<http://www.inform-fiction.org/>"],"ns:common.topic.official_website":["<http://inform7.com/sources/i6n/>"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["テキストアドベンチャー"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["Inform is a programming language and design system for interactive fiction originally created in 1993 by Graham Nelson. Inform can generate programs designed for the Z-code or Glulx virtual machines. Versions 1 through 5 were released between 1993 and 1996. Around 1996, Nelson rewrote Inform from first principles to create version 6 (or Inform 6). Over the following decade, version 6 became reasonably stable and a popular language for writing interactive fiction. In 2006, Nelson released Inform 7 (briefly known as Natural Inform), a completely new language based on principles of natural language and a new set of tools based around a book-publishing metaphor.\\nAll versions of Inform generate files in Z-code (also called story files) from source code. These files can then be run by any Z-code interpreter – that is, by any program which properly implements the Z-code virtual machine (or Z-machine) specification. The Z-machine was originally developed by Infocom in 1979 for their interactive fiction titles. Because there is at least one such interpreter for nearly every major and minor platform, this means that the same Z-code file can be run on a multitude of platforms with no"],"ns:common.document.source_uri":["<http://wp/en/227989>"],"rdf:type":["ns:common.document"]}],"ns:cvg.computer_game_engine.used_for_computer_games":["Journey to Alpha Centauri (In Real Time)"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkpz7t"],"ns:common.webpage.uri":["<http://inform7.com/sources/i6n/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.01h67x"]}],"ns:computer.programming_language.introduced":["2006"],"ns:type.object.name":["Inform"],"rdf:type":["ns:cvg.computer_game_engine"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125g4pfd3"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0csw7l"]}}