{"ns:m.03rky7":{"ns:common.topic.alias":["Godel programming language"],"ns:common.topic.description":["Gödel is a declarative, general-purpose programming language that adheres to the logic programming paradigm. It is a strongly typed language, the type system being based on many-sorted logic with parametric polymorphism. It is named after logician Kurt Gödel."],"rdfs:label":["Gödel"],"key:en":["godel_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Gödel is a declarative, general-purpose programming language that adheres to the logic programming paradigm. It is a strongly typed language, the type system being based on many-sorted logic with parametric polymorphism. It is named after logician Kurt Gödel.\\nGödel has a module system, and it supports arbitrary precision integers, arbitrary precision rationals, and also floating-point numbers. It can solve constraints over finite domains of integers and also linear rational constraints. It supports processing of finite sets. It also has a flexible computation rule and a pruning operator which generalises the commit of the concurrent logic programming languages.\\nGödel's meta-logical facilities provide support for meta-programs that do analysis, transformation, compilation, verification, and debugging, among other tasks.\\nThe following Gödel module is a specification of the greatest common divisor (GCD) of two numbers. It is intended to demonstrate the declarative nature of Gödel, not to be particularly efficient. The CommonDivisor predicate says that if i and j are not zero, then d is a common divisor of i and j if it lies between 1 and the smaller of i and j and divides both i and j"],"ns:common.document.source_uri":["<http://wp/en/936719>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1992"],"ns:type.object.name":["Gödel"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255whj35"],"ns:computer.programming_language.language_paradigms":["ns:m.04k52"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}