{"ns:m.0gmz9":{"ns:common.topic.description":["ObjectPAL is short for Object-Oriented Paradox Application Language, which is the programming language used by the Borland Paradox database application.\\nParadox, now in its 11th version, is a constituent of Corel's Word Perfect X3 office suite, for 32-bit Microsoft Windows. The language is tightly-bound to the application's forms, and provides a very rapid and robust development environment for creating database applications for Windows. ObjectPAL is not a full free-standing object-oriented language. It belongs to the family of languages inspired by Hypercard, with influences from PAL, Smalltalk, and Garnet. While its objects do encapsulate source code, there is no support for polymorphism, and only a very limited inheritance concept, which is wedded to objects on a form which can be controlled by code placed on a higher object in a form's object hierarchy. However, for what it is, ObjectPAL provides a wideranging and versatile language for creating Paradox applications. The syntax and structure of the language resembles Visual Basic, but knowing Visual Basic would only help someone new to ObjectPAL in the sense that any other programming skill would be transferable to ObjectPAL."],"rdfs:label":["ObjectPAL"],"key:en":["objectpal"],"ns:common.topic.article":[{"ns:common.document.text":["ObjectPAL is short for Object-Oriented Paradox Application Language, which is the programming language used by the Borland Paradox database application (now owned by Corel).\\nParadox, now in its 11th version, is a constituent of Corel's Word Perfect X3 office suite, for 32-bit Microsoft Windows. The language is tightly-bound to the application's forms, and provides a very rapid and robust development environment for creating database applications for Windows. ObjectPAL is not a full free-standing object-oriented language. It belongs to the family of languages inspired by Hypercard, with influences from PAL (wherever functionality could be kept the same), Smalltalk, and Garnet (a UI language created by Brad Myers). While its objects do encapsulate source code, there is no support for polymorphism, and only a very limited inheritance concept, which is wedded to objects on a form which can be controlled by code placed on a higher object in a form's object hierarchy. However, for what it is, ObjectPAL provides a wideranging and versatile language for creating Paradox applications. The syntax and structure of the language resembles Visual Basic, but knowing Visual Basic would only help"],"ns:common.document.source_uri":["<http://wp/en/61379>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["ObjectPAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d9bwjm"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}