{"ns:m.0d1w0w":{"ns:common.topic.description":["PLANC is a high level computer programming language. The acronym stands for Programming LAnguage for Nd Computers.\\nCompilers were developed by Norsk Data for several architectures, including the Motorola 68000, 88000, x86, and the Norsk Data NORD-10 minicomputer architecture and ND-500 supermini.\\nThe language was designed to be platform independent. It was mainly used internally at Norsk Data for writing high level systems software such as the upper parts of the operating systems and compilers."],"rdfs:label":["PLANC"],"key:en":["planc"],"ns:common.topic.article":[{"ns:common.document.text":["PLANC (pronounced as \\\"plank\\\") is a high level computer programming language. The acronym stands for Programming LAnguage for Nd Computers.\\nCompilers were developed by Norsk Data for several architectures, including the Motorola 68000, 88000, x86, and the Norsk Data NORD-10 minicomputer architecture and ND-500 supermini.\\nThe language was designed to be platform independent. It was mainly used internally at Norsk Data for writing high level systems software such as the upper parts of the operating systems and compilers.\\nPLANC programs are structured into modules and routines.\\nA very simple example of a PLANC program is as follows:\\nA difference from popular programming languages is that the assignment operator goes from left to right: First you compute the value, then you store it. Compile-time initialization of variables, on the other hand, went from right to left.\\nThe assignment operator returns the stored value, so you could store it multiple times: 5 =: a =: b would store 5 into both the A and B variables. It shares this direction with Plankalkül, early ALGOL drafts, and Mary, another little known programming language developed in Norway, but also the popular C programming"],"ns:common.document.source_uri":["<http://wp/en/5081365>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PLANC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cr6wgl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}