{"ns:m.0l6nk":{"ns:common.topic.alias":["B-0"],"rdfs:label":["FLOW-MATIC"],"ns:common.topic.description":["FLOW-MATIC, originally known as B-0, was the first English-like data processing language. It was developed for the UNIVAC I at Remington Rand under Grace Hopper during the period from 1955 until 1959."],"key:en":["flow-matic"],"ns:computer.programming_language.developers":["Grace Hopper"],"ns:computer.programming_language.language_designers":["Grace Hopper"],"ns:common.topic.article":[{"ns:common.document.text":["FLOW-MATIC, originally known as B-0 (Business Language version 0), was the first English-like data processing language. It was developed for the UNIVAC I at Remington Rand under Grace Hopper.\\nHopper had found that business data processing customers were uncomfortable with mathematical notation. In late 1953 she proposed that data processing problems should be expressed using English keywords, but Rand management considered the idea unfeasible. In early 1955, she and her team wrote a specification for such a programming language and implemented a prototype. The FLOW-MATIC compiler became publicly available in early 1958 and was substantially complete in 1959.\\nFirst, FLOW-MATIC was the first programming language to express operations using English-like statements.\\nSecond, FLOW-MATIC was the first system to distinctly separate the description of data from the operations on it. Its data definition language, unlike its executable statements, was not English-like; rather, data structures were defined by filling in pre-printed forms.\\nFlow-Matic was a major influence in the design of COBOL, since only it and its direct descendent AIMACO were in actual use at the time. Several elements of"],"ns:common.document.source_uri":["<http://wp/en/82760>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1955"],"ns:type.object.name":["FLOW-MATIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12589nmd6"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0bvh22"]}}