{"ns:m.01ksbf":{"rdfs:label":["Communicating sequential processes"],"ns:common.topic.description":["In computer science, communicating sequential processes is a formal language for describing patterns of interaction in concurrent systems. It is a member of the family of mathematical theories of concurrency known as process algebras, or process calculi, based on message passing via channels. CSP was highly influential in the design of the occam programming language, and also influenced the design of programming languages such as Limbo and Go.\\nCSP was first described in a 1978 paper by C. A. R. Hoare, but has since evolved substantially. CSP has been practically applied in industry as a tool for specifying and verifying the concurrent aspects of a variety of different systems, such as the T9000 Transputer, as well as a secure ecommerce system. The theory of CSP itself is also still the subject of active research, including work to increase its range of practical applicability."],"key:en":["communicating_sequential_processes"],"ns:common.topic.article":[{"ns:common.document.text":["In computer science, Communicating Sequential Processes (CSP) is a formal language for describing patterns of interaction in concurrent systems. It is a member of the family of mathematical theories of concurrency known as process algebras, or process calculi. CSP was highly influential in the design of the occam programming language, and also influenced the design of programming languages such as Limbo and Go.\\nCSP was first described in a 1978 paper by C. A. R. Hoare, but has since evolved substantially. CSP has been practically applied in industry as a tool for specifying and verifying the concurrent aspects of a variety of different systems, such as the T9000 Transputer, as well as a secure ecommerce system. The theory of CSP itself is also still the subject of active research, including work to increase its range of practical applicability (e.g., increasing the scale of the systems that can be tractably analyzed).\\nThe version of CSP presented in Hoare's original 1978 paper was essentially a concurrent programming language rather than a process calculus. It had a substantially different syntax than later versions of CSP, did not possess mathematically defined semantics, and was"],"ns:common.document.source_uri":["<http://wp/en/247370>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Tony Hoare"],"ns:type.object.name":["Communicating sequential processes"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125989gj5"],"ns:computer.programming_language.influenced":["ns:m.09gqld2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}