{"ns:m.09tp36":{"ns:common.topic.description":["APT or Automatically Programmed Tool is a high-level computer programming language used to generate instructions for numerically controlled machine tools. Douglas T. Ross is considered by many to be the father of APT: as head of the newly created Computer Applications Group of the Servomechanisms Laboratory at MIT in 1956 he led its technical effort. APT is a language and system that makes numerically controlled manufacturing possible. This early language was used widely into the 1970s and is still a standard internationally. Derivatives of APT were later developed."],"rdfs:label":["APT"],"key:en":["apt_programming_language"],"ns:common.topic.image":[{"ns:type.content.length":["83092"],"rdfs:label":["APT-1"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Daniel Xu"],"ns:type.content.blob_id":["d9c68a70de04bc2a4cfcfe59c31af02a965858dcf6d3d63152480175fb52466e"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:common.image.size":["ns:m.02935dg"],"ns:common.licensed_object.license":["ns:m.03mtw5_"],"ns:type.content.source":["ns:m.05lb_2k"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["APT-1"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.09tp36"]}],"ns:common.topic.article":[{"ns:common.document.text":["APT or Automatically Programmed Tool is a high-level computer programming language used to generate instructions for numerically controlled machine tools. Douglas T. Ross is considered by many to be the father of APT. APT is a language and system that makes numerically controlled manufacturing possible. This early language was used widely into the 1970s and is still a standard internationally.\\nAPT is used to program CNC machine tools to create complex parts using a cutting tool moving in space. It is used to calculate a path that a tool must follow to generate a desired form. APT is a special-purpose language and the predecessor to modern CAM systems. It was created and refined during the late 1950s and early 1960s to simplify the task of calculating geometry points that a tool must traverse in space to cut the complex parts required in the aerospace industry. It was a direct result of the new numerical control technology becoming available at that time and the daunting task that a machinist or engineer faced calculating the movements of the machine for the complex parts for which it was capable. APT was created before graphical interfaces were available, and so it relies on text"],"ns:common.document.source_uri":["<http://wp/en/3673047>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["APT"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125c35w5_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}