{"ns:m.03h2dj4":{"ns:common.topic.description":["BANCStar is a specialist computer programming language for financial applications. The language is an internal language for the National Financial Computer Services, Inc BANCStar application, which is software to automate the operations of a bank branch.\\nThe language is a fixed format four integer command language NFCS internally referred to as \\\"Screen Code\\\". It resembles an esoteric programming language; so much so that it has sometimes been mistaken for a joke language. Conceptually the BANCStar application executed \\\"Screen Code\\\" much like a primitive Virtual Machine. In the 5.1c release the only legal characters are the numerals 0–9, the comma, the minus sign and the carriage return. However, it is used in real commercial applications. It was originally intended as generated code from a user interface-building tool — similar to bytecode rendered in ASCII — but due to limitations in the tool, it became a directly programmed language in itself.\\nThe BANCStar 10.0 release changed the \\\"Screen Code\\\" format to binary, and rearranged the numeric codes into an opcode with a variable number of parameter integers."],"rdfs:label":["BANCStar programming language"],"key:en":["bancstar_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["In computing, BANCStar is a specialist programming language for financial applications. The language is an internal language for the National Financial Computer Services, Inc (later Broadway & Seymour) BANCStar application, which is software to automate the operations of a bank branch.\\nThe language resembles an esoteric programming language; so much so that it has sometimes been mistaken for a joke language. The only legal characters are the numerals 0-9, the comma, the minus sign and the carriage return. However, it is used in real commercial applications. It was originally intended as generated code from a user interface-building tool — similar to bytecode rendered in ASCII — but due to limitations in the tool, it became a directly programmed language in itself."],"ns:common.document.source_uri":["<http://wp/en/14938248>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["BANCStar programming language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12571h0bc"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}