{"ns:m.09f4b_":{"ns:common.topic.description":["Asymptote is a descriptive vector graphics language — developed by Andy Hammerlindl, John C. Bowman, and Tom Prince — which provides a natural coordinate-based framework for technical drawing. Asymptote runs on all major platforms. It is free software, available under the terms of the GNU Lesser General Public License."],"rdfs:label":["Asymptote"],"ns:common.topic.official_website":["<http://www.asymptote.sourceforge.net/>"],"ns:common.topic.article":[{"ns:common.document.text":["Asymptote is a descriptive vector graphics language, developed by Andy Hammerlindl, John C. Bowman (University of Alberta), and Tom Prince, that provides a natural coordinate-based framework for technical drawing. Asymptote runs on all major platforms (UNIX, Mac OS, Microsoft Windows). It is free software, available under the terms of the GNU Lesser General Public License.\\nAsymptote typesets labels and equations with LaTeX, producing high-quality PostScript, PDF, SVG, or 3D PRC output. It is inspired by Metapost, but has a C++-like syntax. It provides a standard for typesetting mathematical figures, just as TeX/LaTeX has become the standard for typesetting equations. It is mathematically oriented (e.g. rotation of vectors by complex multiplication), and uses the simplex method and deferred drawing to solve overall size constraint issues between fixed-sized objects (labels and arrowheads) and objects that should scale with figure size. Asymptote fully generalizes MetaPost path construction algorithms to three dimensions, and compiles commands into virtual machine code for speed without sacrificing portability. High-level graphics commands are implemented in the Asymptote language"],"ns:common.document.source_uri":["<http://wp/en/3469522>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://asymptote.sourceforge.net/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.09f4b_"]}],"ns:type.object.name":["Asymptote"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255c08vy"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:computer.programming_language.influenced_by":["ns:m.01q7b0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}