{"ns:m.04m_ztl":{"rdfs:label":["DECLAN Pro"],"key:en":["declan_pro"],"ns:common.topic.official_website":["<http://www.declanpro.com/>"],"ns:common.topic.article":[{"ns:common.document.text":["DECLAN is a decisioning language; is both procedural and an object-oriented programming language built for data analysis across a wide range of operating systems and computer hardware. G.E. Ozz Nixon Jr, the lead developer of the DECLAN Pro language and environment strives to provide a commercial grade language built for the average business person.\\nDECLAN Pro shall provide end-user programmers with\\nDECLAN Pro started as a collection of (or Best Of) different scripting solutions; Blaise (2003) from David Butler, DXJavaScript (2001) from G.E. Ozz Nixon Jr. and Alexander Baranovski. The initial intention was to allow C++ and PASCAL programmers to co-exist on the same project, by providing an environment which used Windows DLL files to extend the capabilities of their project while providing a mechanism for interpretation and later just-in-time compilation. This approach to modular development and implementation is how DECLAN Pro grew so quickly; as the core language provides standard variable management, logic comparisons, loops, etc. while keeping hardware and operating system specific calls external of DECLAN Pro itself."],"ns:common.document.source_uri":["<http://wp/en/19329314>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0blwk2r"],"ns:common.webpage.uri":["<http://www.declanpro.com/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.04m_ztl"]}],"ns:computer.programming_language.introduced":["2008"],"ns:type.object.name":["DECLAN Pro"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258956d9"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.02yjg_"]}}