{"ns:m.063cr":{"ns:common.topic.description":["A page description language is a language that describes the appearance of a printed page in a higher level than an actual output bitmap. An overlapping term is printer control language, which includes Hewlett-Packard's PCL. PostScript is one of the most noted page description languages. The markup language adaption of the PDL is the page description markup language.\\nPage description languages are textual or binary data streams. In principle, the same data stream could be rendered multiple times to generate multiple copies of the same image. They are distinct from graphics APIs such as GDI and OpenGL that can be called by software to generate graphical output."],"rdfs:label":["Page description language"],"key:en":["page_description_language"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ページきじゅつげんご"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["A page description language (PDL) is a language that describes the appearance of a printed page in a higher level than an actual output bitmap. An overlapping term is printer control language, but it should not be confused as referring solely to Hewlett-Packard's PCL. PostScript, one of the most noted page description languages, is a fully fledged programming language, but many PDLs are not complete enough to be considered a programming language. The markup language adaption of the PDL is the page description markup language.\\nPage description languages are textual or binary data streams. In principle, the same data stream could be rendered multiple times to generate multiple copies of the same image. They are distinct from graphics APIs such as GDI and OpenGL that can be called by software to generate graphical output.\\nVarious page description languages exist:\\nSome of these languages are or have been made open standards. There are also other proprietary languages whose details are not publicly disclosed."],"ns:common.document.source_uri":["<http://wp/en/24444>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Page description language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257cwgm9"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}