{"ns:m.0cjt0w":{"ns:common.topic.description":["A model transformation, in model-driven engineering, is an automatable way of ensuring that a family of models is consistent, in a precise sense which the software engineer can define. The aim of using a model transformation is to save effort and reduce errors by automating the building and modification of models where possible."],"rdfs:label":["Model transformation"],"key:en":["model_transformation"],"ns:common.topic.article":[{"ns:common.document.text":["A model transformation, in model-driven engineering, is an automatable way of ensuring that a family of models is consistent, in a precise sense which the software engineer can define. The aim of using a model transformation is to save effort and reduce errors by automating the building and modification of models where possible.\\nModel transformations can be thought of as programs that take models as input. There is a wide variety of kinds of model transformation and uses of them, which differ in their inputs and outputs and also in the way they are expressed.\\nA model transformation usually specifies which models are acceptable as input, and if appropriate what models it may produce as output, by specifying the metamodel to which a model must conform.\\nModel transformations and languages for them have been classified in many ways. Some of the more common distinctions drawn are:\\nIn principle a model transformation may have many inputs and outputs of various types; the only absolute limitation is that a model transformation will take at least one model as input. However, a model transformation that did not produce any model as output would more commonly be called a model analysis or"],"ns:common.document.source_uri":["<http://wp/en/4716117>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Model transformation"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255v8q9z"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}