{"ns:m.022l8q":{"ns:common.topic.description":["Ratfor is a programming language implemented as a preprocessor for Fortran 66. It provided modern control structures, unavailable in Fortran 66, to replace GOTOs and statement numbers."],"rdfs:label":["Ratfor"],"key:en":["ratfor"],"ns:common.topic.official_website":["<http://www.sepwww.stanford.edu/doku.php?id=sep:software:ratfor>"],"ns:common.topic.article":[{"ns:common.document.text":["Ratfor (short for Rational Fortran) is a programming language implemented as a preprocessor for Fortran 66. It provided modern control structures, unavailable in Fortran 66, to replace GOTOs and statement numbers.\\nRatfor provides the following kinds of flow-control statements, described by Kernighan and Plauger as \\\"shamelessly stolen from the language C, developed for the UNIX operating system by D.M. Ritchie\\\" (\\\"Software Tools\\\", p. 318):\\nFor example, the following code\\nmight be translated as\\nThe version of Ratfor in Software Tools is itself written in Ratfor, as are the sample programs, and inasmuch as its own translation to Fortran is available, it can be ported to any Fortran system. Ratfor source code file names end in .r or .rat.\\nIt basically took the flow control statements and generated regular fortran which then could be compiled. It allowed you to use structured programming in writing the code.\\nRatfor was designed and implemented by Brian Kernighan at Bell Telephone Laboratories in 1974, and described in Software—Practice & Experience in 1975. It was used in the book \\\"Software Tools\\\" (Kernighan and Plauger, 1976).\\nIn 1977, at Purdue University, an improved version of the"],"ns:common.document.source_uri":["<http://wp/en/390257>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://sepwww.stanford.edu/doku.php?id=sep:software:ratfor>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.022l8q"]}],"ns:type.object.name":["Ratfor"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12585pd86"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0gdxqx"]}}