{"ns:m.02k681":{"rdfs:label":["IDL"],"ns:common.topic.description":["IDL, short for Interactive Data Language, is a programming language used for data analysis. It is popular in particular areas of science, such as astronomy, atmospheric physics and medical imaging. IDL shares a common syntax with PV-Wave and originated from the same codebase, though the languages have subsequently diverged in detail. There are also two free implementations, GNU Data Language and Fawlty Language."],"key:en":["idl_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["IDL, short for Interactive Data Language, is a programming language used for data analysis. It is popular in particular areas of science, such as astronomy and medical imaging. IDL shares a common syntax with PV-Wave and originated from the same codebase, though the languages have subsequently diverged in detail. There is also a free implementation, GNU Data Language (GDL).\\nIDL is vectorized, numerical, and interactive, and is commonly used for interactive processing of large amounts of data (including image processing). The syntax includes many constructs from Fortran and some from C.\\nIDL originated from early VAX/VMS/Fortran, and its syntax still shows its heritage:\\nThe findgen function in the above example returns a one-dimensional array of floating point numbers, with values equal to a series of integers starting at 0.\\nNote that the operation in the second line applies in a vectorized manner to the whole 100-element array created in the first line, analogous to the way general-purpose array programming languages (such as APL, J or K) would do it. This example contains a divide by zero; IDL will report an arithmetic overflow, and store a NaN value in the corresponding element of"],"ns:common.document.source_uri":["<http://wp/en/512587>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1977"],"ns:type.object.name":["IDL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dtpff0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.03m62t"],"ns:computer.programming_language.influenced":["ns:m.03nyxs"]}}