{"ns:m.0fl2d":{"ns:common.topic.description":["BBC BASIC is a programming language, developed in 1981 as a native programming language for the MOS Technology 6502 based Acorn BBC Micro home/personal computer, mainly by Sophie Wilson. It is a version of the BASIC programming language adapted for a UK computer literacy project of the BBC.\\nBBC BASIC, based on the older Atom BASIC, extended traditional BASIC with named DEF PROC/DEF FN procedures and functions, REPEAT UNTIL loops, and IF THEN ELSE structures inspired by COMAL. The interpreter also included powerful statements for controlling the BBC Micro's four-channel sound output and its low-/high-resolution eight-mode graphics display.\\nOne of the unique features of BBC BASIC was the presence of an inline assembler allowing users to write 6502 assembly language programs. The assembler was fully integrated into the BASIC interpreter and shared variables with it, which could be included between the [ and ] characters, saved via *SAVE and *LOAD, and called via the CALL or USR commands."],"rdfs:label":["BBC BASIC"],"key:en":["bbc_basic"],"ns:common.topic.article":[{"ns:common.document.text":["BBC BASIC is a programming language, developed in 1981 as a native programming language for the MOS Technology 6502 based Acorn BBC Micro home/personal computer, mainly by Sophie Wilson. It is a version of the BASIC programming language adapted for a UK computer literacy project of the BBC.\\nBBC BASIC, based on the older Atom BASIC (for the Acorn Atom), extended traditional BASIC with named DEF PROC/DEF FN procedures and functions, REPEAT UNTIL loops, and IF THEN ELSE structures inspired by COMAL. The interpreter also included powerful statements for controlling the BBC Micro's four-channel sound output and its low / high-resolution eight mode graphics display.\\nOne of the unique features of BBC BASIC was the presence of an inline assembler allowing users to write 6502 assembly language programs. The assembler was fully integrated into the BASIC interpreter and shared variables with it. This allowed developers to write not just assembly language code, but also BASIC code to emit assembly language, making it possible to use code generation techniques and even write simple compilers in BASIC.\\nIn 1978 Hermann Hauser and Andy Hopper (while at Cambridge University), founded Acorn"],"ns:common.document.source_uri":["<http://wp/en/56273>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.bbcbasic.org>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0fl2d"]}],"ns:computer.programming_language.introduced":["1981"],"ns:type.object.name":["BBC BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125csws48"],"ns:computer.programming_language.influenced_by":["ns:m.019wx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"]}}