{"ns:m.0hgnb":{"ns:common.topic.alias":["Plankalkul"],"ns:common.topic.description":["Plankalkül is a programming language designed for engineering purposes by Konrad Zuse between 1943 and 1945. It was the first high-level non-von Neumann programming language to be designed for a computer. Also, notes survive with scribblings about such a plan calculation dating back to 1941. Plankalkül was not published at that time owing to a combination of factors such as conditions in wartime and postwar Germany and his efforts to commercialise the Z3 computer and its successors. In 1944 Zuse met with the German logician and philosopher Heinrich Scholz and they discussed Zuse's Plankalkül. In March 1945 Scholz expressed his deep appreciation to Zuse for his utilization of the logical calculus.\\nBy 1946, Zuse had written a book on the subject but this remained unpublished. In 1948 Zuse published a paper about the Plankalkül in the \\\"Archiv der Mathematik\\\" but still did not attract much feedback – for a long time to come programming a computer would only be thought of as programming with machine code. The Plankalkül was eventually more comprehensively published in 1972 and the first compiler for it was implemented in 1975 in a dissertation by Joachim Hohmann."],"rdfs:label":["Plankalkül"],"key:en":["plankalkul"],"ns:base.firsts.first.achievements":[{"ns:base.firsts.first_achievement.achievement":["ns:m.019zjd"],"ns:base.firsts.first_achievement.category":[{"key:user.avh.ellerdale":[[]],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":[[]],"ns:common.topic.description":[[]],"rdfs:label":[[]],"ns:freebase.linguistic_hint.subject_form":[[]],"key:en":[[]],"ns:base.schemastaging.context_name.pronunciation":[[]],"ns:common.topic.subject_of":[],"ns:freebase.equivalent_topic.equivalent_type":[[]],"ns:common.topic.image":[[]],"ns:education.field_of_study.students_majoring":[[]],"ns:book.book_subject.works":[[]],"ns:common.topic.article":[[]],"ns:base.ontologies.ontology_instance.equivalent_instances":[[]],"ns:base.skosbase.vocabulary_equivalent_topic.equivalent_concept":[[]],"ns:media_common.literary_genre.books_in_this_genre":[[]],"ns:education.field_of_study.journals_in_this_discipline":[[]],"ns:type.object.name":["Programming language"],"rdf:type":["ns:people.person"],"ns:kg.object_profile.prominent_type":["ns:computer.software_genre"],"ns:common.topic.notable_for":["ns:g.125h3zlx6"],"ns:computer.software_genre.software_in_genre":["ns:m.0wxq_l1"],"ns:common.topic.notable_types":["ns:m.01xrvxj"],"ns:base.firsts.first_achievement_category.firsts":["ns:m.052kr89"]}],"rdf:type":["ns:base.firsts.first_achievement"],"ns:base.firsts.first_achievement.first":["ns:m.0hgnb"]}],"ns:common.topic.article":[{"ns:common.document.text":["Plankalkül (German pronunciation: [ˈplaːnkalkyːl], \\\"Plan Calculus\\\") is a computer language designed for engineering purposes by Konrad Zuse between 1943 and 1945. It was the first high-level non-von Neumann programming language to be designed for a computer. Also, notes survive with scribblings about such a plan calculation dating back to 1941. Plankalkül was not published at that time owing to a combination of factors such as conditions in wartime and postwar Germany and his efforts to commercialise the Z3 computer and its successors. By 1946, Zuse had written a book on the subject but this remained unpublished. In 1948 Zuse published a paper about the Plankalkül in the \\\"Archiv der Mathematik\\\" but still did not attract much feedback - for a long time to come programming a computer would only be thought of as programming with machine code. The Plankalkül was eventually more comprehensively published in 1972 and the first compiler for it was implemented in 1998. Another independent implementation followed in the year 2000 by the Free University of Berlin.\\n\\\"Kalkül\\\" means formal system – the Hilbert-style deduction system is for example originally called \\\"Hilbert-Kalkül\\\", so"],"ns:common.document.source_uri":["<http://wp/en/65944>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Plankalkül"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12552n1wx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.03s53r"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"]}}