{"ns:m.0267bm6":{"ns:common.topic.description":["Modula-2+ is a programming language descended from the Modula-2 language. It was developed at DEC Systems Research Center and Acorn Computers Ltd Research Centre in Palo Alto, California. Modula-2+ is Modula-2 with exceptions and threads. The group who developed the language was led by P. Rovner in 1984.\\nMain differences with Modula-2:\\nConcurrency\\nException handling\\nGarbage collection"],"rdfs:label":["Modula-2+"],"key:en":["modula_2plus"],"ns:common.topic.article":[{"ns:common.document.text":["Modula-2+ is a programming language descended from the Modula-2 language. It was developed at DEC Systems Research Center (SRC) and Acorn Computers Ltd Research Centre in Palo Alto, California. Modula-2+ is Modula-2 with exceptions and threads. The group who developed the language was led by P. Rovner in 1984.\\nMain differences with Modula-2:\\nModula-2+ has been used to develop Topaz, an operating system for the DEC SRC Firefly Multiprocessor. Most Topaz applications were written in the Modula-2+ programming language which grew along with the development of the system. Also to build a programming environment for it in the Acorn Research Center ARC . The language has now completely disappeared but was of great influence to other programming languages such as Modula-3.\\nThe original developers of Modula-2+ were both bought; Acorn by Olivetti and Digital Equipment Corporation by Compaq. Compaq itself was bought by Hewlett-Packard. Olivetti also sold the Olivetti Research Center and Olivetti Software Technology Laboratory (after bought Acorn ARC) to Oracle and was later absorbed by AT&T. DEC have made the SRC-reports available to the public."],"ns:common.document.source_uri":["<http://wp/en/7632959>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Modula-2+"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dm_vkb"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:computer.programming_language.influenced":["ns:m.01k159"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"]}}