{"ns:m.030dg9":{"ns:common.topic.description":["FOCAL is the language used to program the HP-41 range of expandable science/engineering calculators from Hewlett-Packard.\\nAs with most other calculator programming languages of the 1980s, a FOCAL program is a linear list of instructions. Each instruction roughly correspond to a key press, and thus correspond to what the user would do if he was to perform the computation himself on the calculator. This paradigm made FOCAL programming relatively easy for the newcomer, but program maintenance could be a nightmare. Add to that the use of GOTO instructions—including going to a program step based on a value in a data register, a technique known as computed goto—and you had all the ingredients for the dreaded spaghetti code syndrome.\\nProgram steps are numbered starting from 1, but this numbering has no intrinsic meaning, and can change as new instructions are added or removed in the middle of a program. A special instruction LBL is used to create a label, that can be used by the user to invoke the program, or by the program itself, as target of a GTO or XEQ instruction.\\nHere's a very simple FOCAL program:"],"rdfs:label":["Focal"],"ns:common.topic.article":[{"ns:common.document.text":["The Forty-one calculator language (Focal) is the language used to program the HP-41 range of expandable science/engineering calculators from Hewlett-Packard.\\nAs with most other calculator programming languages of the 1980s, a Focal program is a linear list of instructions. Each instruction (or step) roughly correspond to a key (or key combination) press, and thus correspond to what the user would do if he was to perform the computation himself on the calculator. This paradigm made Focal programming relatively easy for the newcomer, but program maintenance could be a nightmare. Add to that the use of GOTO instructions—including going to a program step based on a value in a data register (\\\"GTO IND\\\"), a technique known as computed goto—and you had all the ingredients for the dreaded spaghetti code syndrome.\\nProgram steps are numbered starting from 1, but this numbering has no intrinsic meaning, and can change as new instructions are added or removed in the middle of a program. A special instruction LBL is used to create a label, that can be used by the user to invoke the program, or by the program itself, as target of a GTO (unconditional go-to) or XEQ (execute) instruction.\\nHere's a"],"ns:common.document.source_uri":["<http://wp/en/658542>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Focal"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cqrlwq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}