{"ns:m.080l1":{"ns:common.topic.description":["VBScript is an Active Scripting language developed by Microsoft that is modeled on Visual Basic. It is designed as a \\\"lightweight\\\" language with a fast interpreter for use in a wide variety of Microsoft environments. VBScript uses the Component Object Model to access elements of the environment within which it is running; for example, the FileSystemObject is used to create, read, update and delete files.\\nVBScript has been installed by default in every desktop release of Microsoft Windows since Windows 98; in Windows Server since Windows NT 4.0 Option Pack; and optionally with Windows CE.\\nA VBScript script must be executed within a host environment, of which there are several provided with Microsoft Windows, including: Windows Script Host, Internet Explorer, and Internet Information Services. Additionally, the VBScript hosting environment is embeddable in other programs, through technologies such as the Microsoft Script Control."],"rdfs:label":["VBScript"],"key:en":["vbscript"],"ns:common.topic.article":[{"ns:common.document.text":["VBScript (Visual Basic Scripting Edition) is an Active Scripting language developed by Microsoft that is modeled on Visual Basic. It is designed as a “lightweight” language with a fast interpreter for use in a wide variety of Microsoft environments. VBScript uses the Component Object Model to access elements of the environment within which it is running; for example, the FileSystemObject (FSO) is used to create, read, update and delete files.\\nVBScript has been installed by default in every desktop release of Microsoft Windows since Windows 98; in Windows Server since Windows NT 4.0 Option Pack; and optionally with Windows CE (depending on the device it is installed on).\\nA VBScript script must be executed within a host environment, of which there are several provided with Microsoft Windows, including: Windows Script Host (WSH), Internet Explorer (IE), and Internet Information Services (IIS). Additionally, the VBScript hosting environment is embeddable in other programs, through technologies such as the Microsoft Script Control (msscript.ocx).\\nVBScript began as part of the Microsoft Windows Script Technologies, launched in 1996. This technology (which also included JScript) was"],"ns:common.document.source_uri":["<http://wp/en/32716>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1996"],"ns:type.object.name":["VBScript"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258bk208"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.03790v"],"ns:computer.programming_language.language_paradigms":["ns:m.03x10"],"ns:computer.programming_language.influenced_by":["ns:m.0fp_1y"]}}