{"ns:m.02fj94":{"ns:common.topic.description":["MUSIC-N refers to a family of computer music programs and programming languages descended from or influenced by MUSIC, a program written by Max Mathews in 1957 at Bell Labs. MUSIC was the first computer program for generating digital audio waveforms through direct synthesis. It was one of the first programs for making music on a digital computer, and was certainly the first program to gain wide acceptance in the music research community as viable for that task. The world's first computer-controlled music was generated in Australia by programmer Geoff Hill on the CSIRAC computer which was designed and built by Trevor Pearcey and Maston Beard. However, CSIRAC produced sound by sending raw pulses to the speaker, it did not produce standard digital audio with PCM samples, like the MUSIC-series of programs.\\nMUSIC had a number of descendants, e.g.:\\nMUSIC II, MUSIC III, MUSIC IV\\nMUSIC IV-B\\nMUSIC IV-BF\\nMUSIC V\\nMUSIC V was considerably augmented at IRCAM in Paris by John Gardner and Jean-Louis Richer to enable it to process digitized sounds as well as to synthesize sounds"],"rdfs:label":["MUSIC-N"],"key:en":["music-n"],"ns:common.topic.article":[{"ns:common.document.text":["MUSIC-N refers to a family of computer music programs and programming languages descended from or influenced by MUSIC, a program written by Max Mathews in 1957 at Bell Labs. MUSIC was the first computer program for generating digital audio waveforms through direct synthesis. It was one of the first programs for making music (in actuality, sound) on a digital computer, and was certainly the first program to gain wide acceptance in the music research community as viable for that task. The world's first computer-controlled music was generated in Australia by programmer Geoff Hill on the CSIRAC computer which was designed and built by Trevor Pearcey and Maston Beard. However, CSIRAC did not produce digital audio, like the MUSIC-series of programs.\\nMUSIC had a number of descendants, e.g.:\\nLess obviously, MUSIC can be seen as the parent program for:\\nAll MUSIC-N derivative programs have a (more-or-less) common design, made up of a library of functions built around simple signal-processing and synthesis routines (written as opcodes or unit generators). These simple opcodes are then constructed by the user into an instrument (usually through a text-based instruction file, but increasingly"],"ns:common.document.source_uri":["<http://wp/en/479761>"],"rdf:type":["ns:common.document"]}],"ns:projects.project.participants":[{"ns:projects.project_participation.from_date":["1957"],"ns:projects.project_participation.participant":["ns:m.0179y"],"ns:projects.project_participation.role":["ns:m.0c5kfn1"],"ns:projects.project_participation.project":["ns:m.02fj94"],"rdf:type":["ns:projects.project_participation"]}],"ns:type.object.name":["MUSIC-N"],"rdf:type":["ns:projects.project"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125h50mj8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}