{"ns:m.0t43v":{"rdfs:label":["Amiga E"],"ns:common.topic.description":["Amiga E, or very often simply E, is a programming language created by Wouter van Oortmerssen on the Amiga. He has since moved on to develop the SHEEP programming language for the new AmigaDE platform and the CryScript language used during the development of the video game Far Cry.\\nAmiga E is a combination of many features from a number of languages, but follows the original C programming language most closely in terms of basic concepts. Amiga E's main benefits are fast compilation, very readable source code, flexible type system, powerful module system, exception handling and Object oriented programming.\\nA \\\"hello world\\\" program in Amiga E looks like:\\nAmiga E was used to create the core of the popular Amiga graphics software Photogenics."],"key:en":["amigae"],"ns:common.topic.article":[{"ns:common.document.text":["Amiga E, or very often simply E, is a programming language created by Wouter van Oortmerssen on the Amiga. He has since moved on to develop the SHEEP programming language for the new AmigaDE platform and the CryScript language (also known as DOG) used during the development of the video game Far Cry.\\nAmiga E is a combination of many features from a number of languages, but follows the original C programming language most closely in terms of basic concepts. Amiga E's main benefits are fast compilation (allowing it to be used in place of a scripting language), very readable source code, flexible type system, powerful module system, exception handling (not C++ variant) and Object oriented programming.\\nA \\\"hello world\\\" program in Amiga E looks like:\\nAmiga E was used to create the core of the popular Amiga graphics software Photogenics.\\n1993: The first public release of Amiga E.\\n1997: The last version of Amiga E is released (3.3a).\\n1999: Unlimited compiler executable of Amiga E is released.\\n1999: Source code of the Amiga E compiler in M68K assembler is released under the GPL.\\n1999: First version of CreativE is released. Based on Sourcecode of Amiga E.\\n1999: First version of PowerD is"],"ns:common.document.source_uri":["<http://wp/en/114313>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Amiga E"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255dl3rk"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}