{"ns:m.047r16w":{"rdfs:label":["PCASTL"],"ns:common.topic.description":["The PCASTL is an interpreted high-level programming language. It was created in 2008 by Philippe Choquette. The PCASTL is designed to ease the writing of self-modifying code. The language has reserved words parent and childset to access the nodes of the syntax tree of the currently written code."],"key:en":["pcastl"],"ns:common.topic.official_website":["<http://www.pcosmos.ca/pcastl/>"],"ns:computer.programming_language.language_designers":["Philippe Choquette"],"ns:common.topic.article":[{"ns:common.document.text":["The PCASTL (an acronym for by Parent and Childset Accessible Syntax Tree Language) is an interpreted high-level programming language. It was created in 2008 by Philippe Choquette. The PCASTL is designed to ease the writing of self-modifying code. The language has reserved words parent and childset to access the nodes of the syntax tree of the currently written code.\\nThe \\\"Hello world program\\\" is quite simple:\\nor\\nwill do the same.\\nThe syntax of PCASTL is derived from programming languages C and R. The source of R version 2.5.1 has been studied to write the grammar and the lexer used in the PCASTL interpreter.\\nLike in R, statements can, but do not have to, be separated by semicolons. Like in R, a variable can change type in a session. Like in C and R, PCASTL uses balanced brackets ({ and }) to make blocks.\\nOperators found in PCASTL have the same precedence and associativity as their counterparts in C. for loops are defined like in C. ++ and -- operators are used like in C to increment or decrement a variable before or after it is used in its expression.\\nAn example of PCASTL using the for reserved word and the ++ operator:\\nFunctions and comments in PCASTL are defined like in R:\\nThose"],"ns:common.document.source_uri":["<http://wp/en/17955097>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkpq9m"],"ns:common.webpage.uri":["<http://www.pcosmos.ca/pcastl/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.047r16w"]}],"ns:computer.programming_language.introduced":["2008"],"ns:type.object.name":["PCASTL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d646cq"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:computer.programming_language.influenced_by":["ns:m.0212jm"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}