{"ns:m.02ldnl":{"ns:common.topic.description":["Lasso is an application server and server management interface used for developing internet applications as well as a general-purpose, high-level programming language. Born as a web datasource connection tool for Filemaker and later included in Apple Computer's FileMaker 4.0 and Claris Homepage as CDML, it has since evolved into a complex language used to develop and serve large-scale internet applications and web pages.\\nLasso includes a simple template system allowing code to control the generation of HTML and other content types. As the Lasso language is object-oriented, every value is an object; but it also supports procedural programming through \\\"unbound\\\" methods. The language uses traits and multiple dispatch extensively.\\nLasso features a dynamic type system, where objects can be loaded and augmented at runtime, automatic memory management and has a comprehensive standard library. Lasso has three compilation methodologies: dynamic, just-in-time compilation, and pre-compiled. Lasso also supports Query Expressions, allowing elements within arrays and other types of sequences to be iterated, filtered, and manipulated using a natural language syntax similar to SQL."],"rdfs:label":["Lasso"],"key:en":["lasso_programming_language"],"ns:common.topic.official_website":["<http://www.lassosoft.com/>"],"ns:common.topic.article":[{"ns:common.document.text":["Lasso Professional is an interpreted programming language and server for developing internet applications which use web browsers for the client user interface to connect to HTTP and database servers. Lasso is developed by LassoSoft Inc.\\nLasso provides administration management over Lasso (via its internal users and groups) to control explicit access permissions-based to data sources and language features to improve security and data integrity in a multi-author web application development environment. Lasso Server provides access to MySQL and many other databases via JDBC, ODBC, and FileMaker Pro. Lasso Server runs on Mac OS X, Windows 2000, Windows 2003 and Red Hat Linux.\\nLasso's language, Lasso Dynamic Markup Language (LDML), can be written in a square bracket tag format which resembles HTML, or in a LassoScript format similar to many other scripting languages such as PHP, Perl, WebDNA and Python. LDML can be written with procedural or object-oriented techniques and structures, and supports many data types including arrays (indexed lists) and maps (name referenced lists).\\nLasso is an extendable language. It currently includes the ImageMagick suite of image manipulation tools, the"],"ns:common.document.source_uri":["<http://wp/en/524247>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.lassosoft.com>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bl7hnx"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.02ldnl"]}],"ns:computer.programming_language.language_designers":["LassoSoft"],"ns:type.object.name":["Lasso"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12564hvhk"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.091hdj"]}}