{"ns:m.064011l":{"rdfs:label":["Whizbase"],"ns:common.topic.article":[{"ns:common.document.text":["WBSP, (WhizBase Server Pages) is a general-purpose scripting tool (hypertext preprocessor) for Web development and can be embedded into HTML, XHTML, XML, RTF, ASCII, JavaScript, VBScript and any other text based file format.\\nIts syntax is different from any programming language like C, Java, Perl, VB, and also form other hypertext preprocessors like PHP or ASP. It is easy to learn, and has very short learning curve before one can produce useful results.\\nIt was developed by Faik and Tarik Djikic, owners of the web and software development company, Djikic Ltd.. It's main goal is to allow web developers to write dynamically generated web pages quickly and easily with no limits in terms of contents, database formats, graphic layout design, embedded technologies, etc.\\nOperation of WhizBase can be compared to mail merge function of any text processor. When deploying mail merge, user must create a standard letter with spaces left where mail-merge function will put contents of database fields. In such a fashion - user can create thousands of personalised letters, each one created by merging contents of database fields and specially prepared text document.\\nWhizBase works very much like"],"ns:common.document.source_uri":["<http://wp/en/22945307>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.image":[{"ns:type.content.length":["14295"],"ns:type.content.blob_id":["8b58a553d908c581e98d3689281eb0fb49cdb9d16b27afd3bf632e1d72ccf0d4"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user NurAzije"],"rdfs:label":["The usual CGI way"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.source":["ns:m.077_kmr"],"ns:common.image.size":["ns:m.077_knn"],"ns:type.content.media_type":["ns:m.08wq"],"ns:type.object.name":["The usual CGI way"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.064011l"]}],"ns:type.object.name":["Whizbase"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12565kwwt"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}