{"ns:m.06zrb":{"key:user.avh.ellerdale":["009a-0f06"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["009a-0f06"],"ns:common.topic.description":["Scheme and Common Lisp are the two principal dialects of the computer programming language Lisp. Unlike Common Lisp, however, Scheme follows a minimalist design philosophy that specifies a small standard core accompanied by powerful tools for language extension.\\nScheme was created during the 1970s at the MIT AI Lab and released by its developers, Guy L. Steele and Gerald Jay Sussman, via a series of memos now known as the Lambda Papers. It was the first dialect of Lisp to choose lexical scope and the first to require implementations to perform tail-call optimization, giving stronger support for functional programming and associated techniques such as recursive algorithms. It was also one of the first programming languages to support first-class continuations. It had a significant influence on the effort that led to the development of Common Lisp.\\nThe Scheme language is standardized in the official IEEE standard and a de facto standard called the Revisedⁿ Report on the Algorithmic Language Scheme. The most widely implemented standard is R5RS; a new standard, R6RS, was ratified in 2007."],"rdfs:label":["Scheme"],"key:en":["scheme"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["スキーム"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:computer.programming_language.language_designers":["Gerald Jay Sussman"],"ns:book.book_subject.works":[{"key:authority.openlibrary.book":["OL9802596M"],"rdfs:label":["Structure and Interpretation of Computer Programs"],"key:en":["structure_and_interpretation_of_computer_programs"],"ns:book.book.genre":[],"ns:book.written_work.subjects":["ns:m.06zrb"],"ns:book.book.editions":["ns:m.0c7p1dn"],"ns:book.book.interior_illustrations_by":["ns:m.048zsl7"],"ns:book.written_work.author":["ns:m.0nwzb"],"ns:type.object.name":["Structure and Interpretation of Computer Programs"],"rdf:type":["ns:media_common.quotation_source"],"ns:kg.object_profile.prominent_type":["ns:book.book"],"ns:common.topic.notable_for":["ns:g.12597l7n_"],"ns:common.topic.notable_types":["ns:m.01xryvm"],"ns:book.written_work.date_of_first_publication":["1984"],"ns:book.written_work.copyright_date":["1985"],"ns:common.topic.alias":["The Wizard Book"],"ns:common.topic.description":["Structure and Interpretation of Computer Programs is a textbook aiming to teach the principles of computer programming, such as abstraction in programming, metalinguistic abstraction, recursion, interpreters, and modular programming. It is widely considered a classic text in computer science, and is colloquially known as the wizard book, due to the wizard on the jacket. It was first published in 1985 by MIT Press and written by Massachusetts Institute of Technology professors Harold Abelson and Gerald Jay Sussman, with Julie Sussman. It was formerly used as the textbook of MIT introductory programming class and at other schools. Before SICP, the introductory courses were almost always filled with learning the details of some programming language, while SICP focuses on finding general patterns from specific problems and building software tools that embody each pattern."],"ns:common.topic.image":["ns:m.0291h7s"],"ns:book.written_work.original_language":["ns:m.02h40lc"],"ns:media_common.quotation_source.quotations":["ns:m.02s4spy"],"ns:common.topic.article":["ns:m.0l4pc"]}],"ns:common.topic.article":[{"ns:common.document.text":["Scheme is a functional programming language and one of the two main dialects of the programming language Lisp. Unlike Common Lisp, the other main dialect, Scheme follows a minimalist design philosophy specifying a small standard core with powerful tools for language extension. Its compactness and elegance have made it popular with educators, language designers, programmers, implementors, and hobbyists. The language's diverse appeal is seen as a strong point, though the consequently wide divergence between implementations is seen as one of the language's weak points.\\nScheme was developed at the MIT AI Lab by Guy L. Steele and Gerald Jay Sussman who introduced it to the academic world via a series of memos, now referred to as the Lambda Papers, over the period 1975–1980. The Scheme language is standardized in the official IEEE standard, and a de facto standard called the Revised Report on the Algorithmic Language Scheme (RnRS). The most widely implemented standard is R5RS (1998), and a new standard R6RS was ratified in 2007.\\nScheme was the first dialect of Lisp to choose lexical scope and the first to require implementations to perform tail-call optimization. It was also one of the"],"ns:common.document.source_uri":["<http://wp/en/28119>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.developers":["John W. Cowan"],"ns:computer.programming_language.introduced":["1975"],"ns:type.object.name":["Scheme"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125524w7_"],"ns:computer.programming_language.influenced":["ns:m.0qs9cg0"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1x"],"ns:computer.programming_language.dialects":["ns:m.0c00_c"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}