{"ns:m.0csw7l":{"ns:common.topic.description":["CorVision is a fourth generation programming tool currently owned by Attunity, Inc. CorVision was developed by Cortex Corporation for the VAX/VMS ISAM environment. Although Cortex beta tested CorVision-10 which was generated for PCs but CorVision itself stayed anchored on VMS. CorVision-10 proved more difficult than hoped, and was never released."],"rdfs:label":["CorVision"],"key:en":["corvision"],"ns:common.topic.article":[{"ns:common.document.text":["CorVision is a fourth generation programming tool (4GL) currently owned by Attunity, Inc. CorVision was developed by Cortex Corporation for the VAX/VMS ISAM environment. Although Cortex beta tested CorVision-10 which generated for PCs but CorVision itself stayed anchored on VMS. CorVision-10 proved more difficult than hoped, and was never released.\\nCorVision can be traced back to 1972 when Lou Santoro and Mike Lowery created INFORM for the newly formed time-sharing company Standard Information Systems (SIS). INFORM contained some of CorVisions basic utility commands such as SORT, REPORT, LIST and CONSOLIDATE. Some of the first users of INFORM were New England Telephone, Polaroid and Temple Barker & Sloan. By 1972 SIS had offices in Los Angeles, Garden Grove CA, Minneapolis, Chicago, Boston, New York City, Washington DC, Charlotte, Raleigh, Atlanta and Phoenix.\\nBetween 1976 and 1977 Ken Levitt and Dick Berthold of SIS ported INFORM from the CDC-3600 to the PDP-11/70 under IAS. They called this new tool INFORM-11. Cortex was founded in 1978 by Sherm Uchill, Craig Hill, Mike Lowery, and Dick Berthold to market INFORM-11. INFORM-11 was first used to deliver a 20 user order entry system"],"ns:common.document.source_uri":["<http://wp/en/4891630>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["CorVision"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125f58w6q"],"ns:computer.programming_language.influenced_by":["ns:m.01h67x"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}