{"ns:m.070qh1":{"rdfs:label":["Agilent VEE"],"ns:common.topic.description":["Keysight VEE is a graphical dataflow programming software development environment from Keysight Technologies for automated test, measurement, data analysis and reporting. VEE originally stood for Visual Engineering Environment and developed by HP designated as HP VEE; it has since been officially renamed to Keysight VEE. Keysight VEE has been widely used in various industries, serving the entire stage of a product lifecycle, from design, validation to manufacturing. It is optimized in instrument control and automation with test and measurement devices such as data acquisition instruments like digital voltmeters and oscilloscopes, and source devices like signal generators and programmable power supplies."],"key:en":["agilent_vee"],"ns:common.topic.official_website":["<http://www.agilent.com/find/vee>"],"ns:common.topic.article":[{"ns:common.document.text":["Agilent VEE is a graphical dataflow programming software development environment from Agilent Technologies for automated test, measurement, data analysis and reporting. VEE originally stood for Visual Engineering Environment and developed by HP designated as HP VEE; it has since been officially renamed to Agilent VEE. Agilent VEE has been widely used in various industries, serving the entire stage of a product lifecycle, from design, validation to manufacturing. It is optimized in instrument control and automation with test and measurement devices such as data acquisition instruments like digital voltmeters and oscilloscopes, and source devices like signal generators and programmable power supplies.\\nA detailed list of features for each version can be found under the References section.\\nA VEE program consists of multiple connected VEE objects (sometimes called devices). Each VEE object consists of different types of pins, namely data pins, sequence pins, execute pins (XEQ), control pins and error pins. Data pins govern the data flow propagation while sequence pins determine object execution order.\\nThe pins on the left side of an object are called input pins, whereas the pins on the"],"ns:common.document.source_uri":["<http://wp/en/2282754>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.agilent.com/find/vee>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.070qh1"]}],"ns:type.object.name":["Agilent VEE"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259_nk0y"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}