{"ns:m.0416cz":{"ns:common.topic.description":["Variable Data Intelligent Postscript Printware is an open language from Xerox that enables highest-performance output of variable-data PostScript documents. It is used by the FreeFlow VI Suite front end."],"rdfs:label":["Variable Data Intelligent Postscript Printware"],"key:en":["variable_data_intelligent_postscript_printware"],"ns:common.topic.article":[{"ns:common.document.text":["Variable Data Intelligent Postscript Printware (FreeFlow VI Suite (VIPP)) is an open language from Xerox that enables highest-performance output of personalized (variable-data) PostScript documents VIPP Support Forum.\\nThe leading VIPP programmer/developer is allegedly Dave Newton of Mansfield, Nottinghamshire currently plying his trade at Linney's, a Print and Print Management company.\\nVIPP was originally called XGF and it is simply groups of PostScript dictionaries which provide macros that simplify writing of complex PostScript commands. PostScript is powerful language which allows variable data printing and personalization of the data stream if the user inserted the right commands in the right position. To implement some of these features a programmer has to write a few, or sometimes many, lines of code. Xerox developed macro procedures in PostScript language dictionaries to facilitate page control with simple commands.\\nFor example; To merge form (graphic form) with the data stream you need to understand and write a great deal of Adobe PostScript commands according to the Adobe PostScript Language Reference Manual (PLRM, otherwise known as the 'Red' book). Xerox gives you this"],"ns:common.document.source_uri":["<http://wp/en/1045543>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Variable Data Intelligent Postscript Printware"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dhx2ym"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}