{"ns:m.01z5j9":{"ns:common.topic.description":["Programming Language for Business or PL/B is a business-oriented programming language originally called DATABUS and designed by Datapoint in the early 1970s as an alternative to COBOL because Datapoint's 8-bit computers could not fit COBOL into their limited memory, and because COBOL did not at the time have facilities to deal with Datapoint's built-in keyboard and screen.\\nA version of DATABUS became an ANSI standard, and the name PL/B came about when Datapoint refused to release its trademark on the DATABUS name."],"rdfs:label":["Programming Language for Business"],"key:en":["programming_language_for_business"],"ns:common.topic.article":[{"ns:common.document.text":["Programming Language for Business or PL/B is a business-oriented programming language originally called DATABUS and designed by Datapoint in the early 1970s as an alternative to COBOL because its 8-bit computers could not fit COBOL into their limited memory, and because COBOL did not at the time have facilities to deal with Datapoint's built-in keyboard and screen.\\nA version of DATABUS became an ANSI standard, and the name PL/B was adopted when Datapoint refused to release its trademark on the DATABUS name.\\nMuch like Java and .NET, PL/B programs are compiled into an intermediate byte-code, which is then interpreted by a runtime library. Because of this, many PL/B programs can run on DOS, Unix, Linux, and Windows operating systems. The PL/B development environments are influenced by Java and Visual Basic, and offer many of the same features found in those languages. PL/B (Databus) is actively used all over the world, and has several forums on the Internet dedicated to supporting software developers.\\nSince its inception, PL/B has been enhanced and adapted to keep it modernized and able to access various data sources. It has a database capability built-in with ISAM and Associative"],"ns:common.document.source_uri":["<http://wp/en/350323>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Programming Language for Business"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fkm2tq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}