{"ns:m.02qlwn8":{"ns:common.topic.description":["FOCAL-69 was the landmark version of the FOCAL programming language, more widely publicized than the original version of the language created in 1968. FOCAL-69, created by Richard Merrill is important because:\\nIt was the basis for all later derivatives of the language\\nIt was the language the classic BASIC game Hamurabi was first written in\\nIt became a popular language on Russian microcomputers."],"rdfs:label":["FOCAL-69"],"key:en":["focal_69"],"ns:common.topic.article":[{"ns:common.document.text":["FOCAL-69 was the landmark version of the FOCAL programming language, more widely publicized than the original version of the language created in 1968. FOCAL-69, created by Richard Merrill is important because:\\nVariable names may start with any letter except F (F is reserved for functions) and may contain any sequence of letters and numbers. However, only the first two characters are significant. For instance, the following code sample from FOCAL: A New Conversational Language refers to the same variable as DESTINATION and then DES:\\nAny variable may be treated as an array, taking subscripts from -2048 through 2047.\\nFOCAL-69 contained only five mathematical operators:\\nFOCAL-69 was unusual in that mathematical expressions could use (), [] and <> interchangeably in matched pairs to establish precedence.\\nThe language did not support any relative operators (e.g., greater than, .GT., >, etc.).\\nThe language contained the following built-in functions:\\nEvery line in a FOCAL-69 program must start with a line number. As with JOSS, and unlike BASIC, line numbers are real numbers. In FOCAL-69, integers are not allowed. Line numbers may range from 1.01 through 31.99. The whole number is referred"],"ns:common.document.source_uri":["<http://wp/en/10674468>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FOCAL-69"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256b8sz9"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}