{"ns:m.05fxv0":{"rdfs:label":["IPTSCRAE"],"ns:common.topic.description":["Iptscrae is a stack-oriented scripting language used to give additional functionality to The Palace software and servers. Its name comes from the pronunciation of \\\"script\\\" in Pig Latin.\\nThe language was created by Jim Bumgardner, who in turn was inspired by Forth, another stack-based language. Bumgardner chose this style of language because it is extremely easily to implement an interpreter, since there is no need to support parenthetical groupings or operator precedence.\\nThe name \\\"iptScrae\\\" was borrowed by Bumgardner from a former colleague and mentor, Kevin Bjorke, who came up with the name \\\"iptscray\\\" for a freeware Forth interpreter a few years previously. Bumgardner originally created Iptscrae for Idaho, an in-house multi-media authoring system, similar to HyperCard, which he created while an employee at Warner New Media. He then reused and modified the IptScrae compiler for the Palace project, which was developed in 1994.\\nAlthough it is a scripting language, many have used it to provide additional functionality to many other programs and functions. Forums can be created with Iptscrae while embedding it with JavaScript, as many factions of Iptscrae fans have done in the past."],"key:en":["iptscrae"],"ns:common.topic.article":[{"ns:common.document.text":["Iptscrae is the scripting language used to give additional functionality to The Palace software and servers. Its name comes from the pronunciation of \\\"script\\\" in Pig Latin. \\nAlthough it is a scripting language, many have used it to provide additional functionality to many other programs and functions. Forums can be created with Iptscrae while embedding it with JavaScript, as many factions of Iptscrae fans have done in the past.\\nIt's fully possible to implement Iptscrae with other languages, even if they're not on the same dynamic principles. For example, Iptscrae has, in the past, been webbed together with Java, JavaScript, HTML, and other artificial languages, including other scripting languages, programming languages, specification languages, query languages, and markup languages to add more end-user interactions and commands to other programs, without sacrificing user-friendliness. In the past years, Iptscrae has even been utilized in computer peer groups through open-source language compilers, using not only transformation and hardware description languages, but also combining it with several other genres of computer languages to create an intertwined web of user-friendliness"],"ns:common.document.source_uri":["<http://wp/en/1603407>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IPTSCRAE"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12582gdkq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}