{"ns:m.0h22q":{"key:user.avh.ellerdale":["0080-18ec"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-18ec"],"ns:common.topic.description":["Microsoft QuickBASIC is an Integrated Development Environment and compiler for the BASIC programming language that was developed by Microsoft. QuickBASIC runs mainly on DOS, though there was a short-lived version for Mac OS. It is loosely based on GW-BASIC but adds user-defined types, improved programming structures, better graphics and disk support and a compiler in addition to the interpreter. Microsoft marketed QuickBASIC as the introductory level for their BASIC Professional Development System."],"rdfs:label":["QuickBASIC"],"key:en":["quickbasic"],"ns:common.topic.official_website":["<http://www.microsoft.com/>"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkgq7t"],"ns:common.webpage.uri":["<http://www.microsoft.com/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0h22q"]}],"ns:computer.programming_language.language_designers":["Microsoft Corporation"],"ns:common.topic.article":[{"ns:common.document.text":["Microsoft QuickBASIC (also QB; not to be confused with \\\"QBasic\\\") is an Integrated Development Environment (or IDE) and compiler for the BASIC programming language that was developed by Microsoft. QuickBASIC runs mainly on DOS, though there was a short-lived version for Mac OS. It is loosely based on GW-BASIC but adds user-defined types, improved programming structures, better graphics and disk support and a compiler in addition to the interpreter. Microsoft marketed QuickBASIC as the introductory level for their BASIC Professional Development System.\\nMicrosoft released the first version of QuickBASIC on August 18, 1985 on a single 5.25\\\" 360kB floppy disk. QuickBASIC version 2.0 and later contained an Integrated Development Environment (IDE), allowing users to edit directly in its on-screen text editor.\\nAlthough still supported in QuickBASIC, line numbers became optional. Program jumps also worked with named labels. Later versions also added control structures, such as multiline conditional statements and loop blocks.\\nMicrosoft's \\\"PC BASIC Compiler\\\" was included for compiling programs into DOS executables. Beginning with version 4.0, the editor included an interpreter that allowed"],"ns:common.document.source_uri":["<http://wp/en/63569>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["QuickBASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125f590pq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0zrplby"],"ns:computer.programming_language.influenced_by":["ns:m.03fc6"]}}