{"ns:m.03jdp":{"key:user.avh.ellerdale":["0099-cbfa"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0099-cbfa"],"ns:common.topic.description":["HyperCard is an application program and programming tool for Apple Macintosh and Apple IIGS computers, that is among the first successful hypermedia systems before the World Wide Web.\\nIt combines database capabilities with a graphical, flexible, user-modifiable interface. HyperCard also features HyperTalk, a programming language for manipulating data and the user interface.\\nThis combination of features – simple form layout, database capabilities and ease of programming – led to widespread use in many different roles. Some HyperCard users employed it as a programming system for rapid application development of applications and databases, others for building interactive applications with no database requirements, command and control systems, and many examples in the demoscene.\\nHyperCard was originally released in 1987 for $49.95 and was included for free with all new Macs sold at the time. After no updates for years, it was withdrawn from sale in March 2004. HyperCard has not been ported to Mac OS X but ran in the Classic environment."],"rdfs:label":["HyperCard"],"key:en":["hypercard"],"ns:cvg.computer_game_engine.used_for_computer_games":["Cosmic Osmo and the Worlds Beyond the Mackerel"],"ns:common.topic.article":[{"ns:common.document.text":["HyperCard is an application program for Apple Computer, Inc. that was among the first successful hypermedia systems before the World Wide Web. It combines database capabilities with a graphical, flexible, user-modifiable interface. HyperCard also features HyperTalk, a programming language for manipulating data and the user interface.\\nThis combination of features - simple form layout, database capabilities and ease of programming - led to widespread use in many different roles. Some HyperCard users employed it as a programming system for Rapid Application Development of applications and databases, others for building interactive applications with no database requirements, command and control systems, and many examples in the demoscene.\\nHyperCard was originally released in 1987 for $49.95, and was included for free with all new Macs sold at the time. It was withdrawn from sale in March 2004, although by then it had not been updated for many years.\\nHyperCard is based on the concept of a \\\"stack\\\" of virtual \\\"cards\\\". Cards hold data, just as they would in a rolodex. Each card contains a number of interactive objects, including text fields, check boxes, buttons, and similar common GUI"],"ns:common.document.source_uri":["<http://wp/en/13567>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["HyperCard"],"rdf:type":["ns:cvg.computer_game_engine"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259jvd40"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0m4ps"]}}