{"ns:m.02rn6ww":{"ns:common.topic.description":["SQL/PSM is an ISO standard mainly defining an extension of SQL with a procedural language for use in stored procedures. Initially published in 1996 as an extension of SQL-92, SQL/PSM was later incorporated into the multi-part SQL:1999 standard, and has been part 4 of that standard since then, most recently in SQL:2011. The SQL:1999 part 4 covered less than the original PSM-96 because the SQL statements for defining, managing, and invoking routines were actually incorporated into part 2 SQL/Foundation, leaving only the procedural language itself as SQL/PSM. The SQL/PSM facilities are still optional as far as the SQL standard is concerned; most of them are grouped in Features P001-P008.\\nSQL/PSM standardizes syntax and semantics for control flow, exception handling, local variables, assignment of expressions to variables and parameters, and use of cursors. It also defines an information schema for stored procedures. SQL/PSM is one language in which methods for the SQL:1999 structured types can be defined. The other is Java, via SQL/JRT."],"rdfs:label":["SQL/PSM"],"key:en":["sql_psm"],"ns:common.topic.article":[{"ns:common.document.text":["SQL/PSM stands for SQL/Persistent Stored Modules, and was developed by the American National Standards Institute (ANSI) as an extension to SQL. It was first adopted in 1996, and it provides procedural programmability in addition to the querying commands of SQL.\\nThe SQL/PSM extension is defined by ISO/IEC 9075-4:2003. SQL/PSM standardizes procedural extensions for SQL, including flow of control, condition handling, statement condition signals and resignals, cursors and local variables, and assignment of expressions to variables and parameters. In addition, SQL/PSM formalizes declaration and maintenance of persistent database language routines (e.g., \\\"stored procedures\\\").\\nSome samples of SQL/PSM functions"],"ns:common.document.source_uri":["<http://wp/en/11665200>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1996"],"ns:type.object.name":["SQL/PSM"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255hg0jj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0n6y"]}}