{"ns:m.06bf5y":{"ns:common.topic.description":["Chinese BASIC is the name given to several Chinese-localized versions of the BASIC programming language in the early 1980s."],"rdfs:label":["Chinese BASIC"],"key:en":["chinese_basic"],"ns:common.topic.image":[{"ns:type.content.length":["6110"],"rdfs:label":["Keyboard layout Chinese Traditional"],"ns:type.content.blob_id":["f43e440e392135c209149ae2f35f2da12a5d101a9644875aac5d83ea269c71f1"],"ns:common.licensed_object.provenance":["wikipedia,commons,479188"],"ns:common.image.size":["ns:m.029152z"],"ns:type.content.source":["ns:m.02ccy8x"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["Keyboard layout Chinese Traditional"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.06bf5y"]}],"ns:common.topic.article":[{"ns:common.document.text":["Chinese BASIC (Chinese: 中文培基; pinyin: Zhōngwén Péijī) is the name given to several Chinese-localized versions of the BASIC programming language in the early 1980s.\\nAt least two versions of Chinese BASIC were modified Applesoft BASIC that accepted Chinese commands and variables. They were built into some Taiwan-made Apple II clones. One of these was shipped with the best-selling Multitech Microprofessor II (known as Acer today). Another version was shipped with MiTAC's Little Intelligent Computer (小神通) .\\nIn addition to Apple II clones, Multitech also developed a Zilog Z80-based port of the Chinese BASIC for its own line of high-end computers.\\nIn a typical Chinese BASIC environment, Chinese and English commands are interchangeable. It may also accept Chinese and Latin alphabet variables. For example you may use PRINT A in line 50, 印 A in line 200 and ? A in line 250. They all do the same thing -- to print out the value of A on screen.\\nThis program calculates the sum of log (E) + log (E+1) + log (E+2) + ... + log (F). The Chinese characters used as variables are the 24 radicals of the Cangjie method, one of the earliest QWERTY keyboard-compatible Chinese input methods. The author of"],"ns:common.document.source_uri":["<http://wp/en/1977500>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Chinese BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258vr3hs"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}