{"ns:m.0bw_9z":{"ns:common.topic.description":["Basic Assembly Language is the commonly used term for a low-level programming language used on IBM System/360 and successor mainframes. Originally \\\"Basic Assembly Language\\\" applied only to an extremely restricted dialect designed to run under control of IBM Basic Programming Support on systems with only 8KB of main memory, and only a card reader, a card punch, and a printer for input/output — thus the word \\\"Basic\\\". However, the full name and the initialism \\\"BAL\\\" almost immediately attached themselves in popular use to all assembly-language dialects on the System/360 and its descendants. BAL for BPS/360 was introduced with the System/360 in 1964.\\nAssemblers on other System/360 operating systems through System/370, System/390, and System z, as well as the UNIVAC Series 90 mainframes made by Sperry Corporation, and the BS2000 Mainframes currently made by Fujitsu, inherited and extended its syntax. The latest derived language is known as the IBM High-Level Assembler. Programmers utilizing this family of assemblers also refer to them as ALC, or simply \\\"assembler\\\".\\nBAL is also the mnemonic of the \\\"Branch And Link\\\" instruction."],"rdfs:label":["IBM Basic assembly language and successors"],"key:en":["basic_assembly_language"],"ns:common.topic.article":[{"ns:common.document.text":["BAL (Basic Assembly Language) is a low-level language used on IBM mainframes from the earliest 360 series, through systems 370, 390, zSeries and System z, as well as the Univac 90/60, 90/70 and 90/80 mainframes made by Sperry Corporation. The earliest version was provided with the System/360 in 1964; the latest version is known as the IBM High Level Assembler (HLASM). Programmers utilizing this family of assemblers refer to them as ALC, for Assembly Language Coding, or simply \\\"assembler\\\".\\nProperly speaking, \\\"Basic Assembly Language\\\" was the name of the extremely restricted dialect designed to be assembled on early System/360 machines with only 8KiB of main memory, and only a card reader, a card punch, and a printer for input/output: thus the word \\\"Basic\\\". However, the full name and the initialism \\\"BAL\\\" somehow almost immediately attached themselves in popular use to all assembly-language dialects on the System/360 and its descendants.\\nThe architecture of IBM mainframes has taken many forms over the years, including System/360, System/370 XA, ESA/390, and z/Architecture. Each of these architectures has retained compatibility with most of the features of its predecessor. BAL uses the"],"ns:common.document.source_uri":["<http://wp/en/4321536>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IBM Basic assembly language and successors"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258ymztm"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}