{"ns:m.02_94":{"key:user.avh.ellerdale":["0080-678c"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-678c"],"ns:common.topic.alias":["The IBM Mathematical Formula Translating System"],"ns:common.topic.description":["Fortran is a general-purpose, imperative programming language that is especially suited to numeric computation and scientific computing. Originally developed by IBM in the 1950s for scientific and engineering applications, Fortran came to dominate this area of programming early on and has been in continuous use for over half a century in computationally intensive areas such as numerical weather prediction, finite element analysis, computational fluid dynamics, computational physics and computational chemistry. It is one of the most popular languages in the area of high-performance computing and is the language used for programs that benchmark and rank the world's fastest supercomputers.\\nFortran encompasses a lineage of versions, each of which evolved to add extensions to the language while usually retaining compatibility with previous versions. Successive versions have added support for structured programming and processing of character-based data, array programming, modular programming and generic programming, high performance Fortran, object-oriented programming and concurrent programming."],"rdfs:label":["Fortran"],"key:en":["fortran"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["フォートラン"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["Fortran (previously FORTRAN) is a general-purpose, procedural, imperative programming language that is especially suited to numeric computation and scientific computing. Originally developed by IBM at their campus in south San Jose, California in the 1950s for scientific and engineering applications, Fortran came to dominate this area of programming early on and has been in continual use for over half a century in computationally intensive areas such as numerical weather prediction, finite element analysis, computational fluid dynamics, computational physics and computational chemistry. It is one of the most popular languages in the area of high-performance computing  and is the language used for programs that benchmark and rank the world's fastest supercomputers.\\nFortran (a blend derived from The IBM Mathematical Formula Translating System) encompasses a lineage of versions, each of which evolved to add extensions to the language while usually retaining compatibility with previous versions. Successive versions have added support for processing of character-based data (FORTRAN 77), array programming, modular programming and object-oriented programming (Fortran 90 / 95), and generic"],"ns:common.document.source_uri":["<http://wp/en/11168>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.developers":["IBM"],"ns:computer.programming_language.language_designers":["John Backus"],"ns:law.invention.inventor":["IBM"],"ns:base.ontologies.ontology_instance.equivalent_instances":[{"ns:base.ontologies.ontology_instance_mapping.uri":["<http://sw.opencyc.org/concept/Mx4rvVjHkZwpEbGdrcN5Y29ycA>"],"ns:base.ontologies.ontology_instance_mapping.ontology":["ns:m.04dm2p_"],"rdf:type":["ns:base.ontologies.ontology_instance_mapping"],"ns:base.ontologies.ontology_instance_mapping.freebase_topic":["ns:m.02_94"]}],"ns:computer.programming_language.introduced":["1957-04"],"ns:type.object.name":["Fortran"],"rdf:type":["ns:law.invention"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125hbcjb5"],"ns:computer.programming_language.influenced":["ns:m.0j3djl7"],"ns:computer.programming_language.language_paradigms":["ns:m.0qjrr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.01xrtkv"],"ns:computer.programming_language.influenced_by":["ns:m.0kzb_"]}}