{"ns:m.02x01bv":{"rdfs:label":["hoc"],"ns:common.topic.description":["hoc, an acronym for High Order Calculator, is an interpreted programming language that was used in the 1984 book The Unix Programming Environment to demonstrate how to build interpreters using Yacc.\\nhoc was developed by Brian Kernighan and Rob Pike as a glorified interactive calculator. Its basic functionality is to evaluate floating-point numerical expressions, e.g., \\\"1+2*sin\\\". Then, variables were added, conditionals, loops, user-defined functions, simple IO, and more, using a syntax resembling C.\\nAn improved hoc interpreter was included in Eighth Edition Research Unix in 1985, but it has not been generally adopted by commercial Unix systems or by Linux distributions. Instead, the earlier calculator languages dc and bc have become widespread on those systems. hoc survived and continued to evolve as part of the Plan 9 operating system. Several improved versions of Hoc were released as free software by Bell Labs and other individuals. hoc is used as the primary scripting language for the Neuron simulator."],"ns:common.topic.article":[{"ns:common.document.text":["hoc, an acronym for High Order Calculator, is an interpreted programming language that was used in the 1984 book The Unix Programming Environment to demonstrate how to build interpreters using Yacc.\\nHoc was developed by Brian Kernighan and Rob Pike as a glorified interactive calculator. Its basic functionality is to evaluate floating-point numerical expressions, e.g., \\\"1+2*sin(0.7)\\\". Then, variables were added, conditionals, loops, user-defined functions, simple IO, and more, using a syntax resembling C.\\nAn improved Hoc interpreter was included in Eighth Edition Research Unix in 1985, but it has not been generally adopted by commercial Unix systems or by Linux distributions. Instead, the earlier calculator languages dc and bc have become widespread on those systems. Hoc survived and continued to evolve as part of the Plan 9 operating system. Several improved versions of Hoc were released as free software by Bell Labs and other individuals (see list below).\\nThe following is a simple example of an interactive calculator session in Hoc; bold text represents hoc's output:\\nAnd a simple example of functions and flow control:"],"ns:common.document.source_uri":["<http://wp/en/12675204>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["hoc"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cs2mm7"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}