{"ns:m.0bvh22":{"ns:common.topic.description":["COMTRAN is an early programming language developed at IBM. It was intended as the business programming equivalent of the scientific programming language FORTRAN. It served as one of the forerunners to the COBOL language. Developed by Bob Bemer, in 1957, the language was the first to feature the programming language element known as a picture clause."],"rdfs:label":["COMTRAN"],"ns:common.topic.alias":["COMmercial TRANslator"],"key:en":["comtran"],"ns:computer.programming_language.developers":["Bob Bemer"],"ns:computer.programming_language.language_designers":["Bob Bemer"],"ns:common.topic.article":[{"ns:common.document.text":["COMTRAN (COMmercial TRANslator) is an early programming language developed at IBM. It was intended as the business programming equivalent of the scientific programming language FORTRAN (FORmula TRANslator). It served as one of the forerunners to the COBOL language. Developed by Bob Bemer, in 1957, the language was the first to feature the programming language element known as a picture clause.\\nSeveral elements of COMTRAN were incorporated into COBOL:\\nA picture clause element defines the length of any given datum, much like a dictionary defines words. In particular a picture clause determines whether the datum contains letters and numbers, and other characteristics of the data, including format, size, and data type.\\nThis is a sample COMTRAN program, doing payroll calculations. (From IBM F28-8043 Commercial Translator General Reference Manual.)"],"ns:common.document.source_uri":["<http://wp/en/4292196>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1957"],"ns:type.object.name":["COMTRAN"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255tpfg3"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.01zpg"],"ns:computer.programming_language.influenced_by":["ns:m.0l6nk"]}}