{"ns:m.04m75m":{"rdfs:label":["Maude system"],"ns:common.topic.description":["The Maude system is an implementation of rewriting logic developed at SRI International. It is similar in its general approach to Joseph Goguen's OBJ3 implementation of equational logic, but based on rewriting logic rather than order-sorted equational logic, and with a heavy emphasis on powerful metaprogramming based on reflection.\\nMaude is free software, and tutorials are available online."],"key:en":["maude_system"],"ns:common.topic.article":[{"ns:common.document.text":["The Maude system is an implementation of rewriting logic developed at SRI International. It is similar in its general approach to Joseph Goguen's OBJ3 implementation of equational logic, but based on rewriting logic rather than order-sorted equational logic, and with a heavy emphasis on powerful metaprogramming based on reflection.\\nMaude is free software, and tutorials are available online.\\nMaude modules (rewrite theories) consists of a term-language plus sets of equations and rewrite-rules. Terms in a rewrite theory are constructed using operators (functions taking 0 or more arguments of some sort, which return a term of a specific sort). Operators taking 0 arguments are considered constants, and we construct our term-language by these simple constructs.\\nNOTE: If you want to test these examples on your own, you should start Maude with the option -no-prelude which lets Maude know that none of its basic modules are included (like Maude's own NAT module which will cause a conflict).\\nThis rewrite theory specifies all the natural numbers. First we introduce the sort, saying that there exists a sort called Nat (short for natural numbers), and below is the specification of how these"],"ns:common.document.source_uri":["<http://wp/en/1251423>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Maude system"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bhhwwh"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}