{"ns:m.05tthtg":{"rdfs:label":["Corba IDL"],"ns:common.topic.description":["The CORBA Interface Definition Language (IDL) is used to define interfaces to objects in your network. IDL allows you to define interfaces to objects without specifying the implementation of those interfaces. To implement an IDL interface, you define a C++ class that can be accessed through that interface and then you create objects of that class within an Orbix server application.  In fact, you can implement IDL interfaces using any programming language for which an IDL mapping is available. An IDL mapping specifies how an interface defined in IDL corresponds to an implementation defined in a programming language. CORBA applications written in different programming languages are fully interoperable.  CORBA defines standard mappings from IDL to several programming languages, including C++, Java, and Smalltalk. The Orbix IDL compiler converts IDL definitions to corresponding C++ definitions, in accordance with the standard IDL to C++ mapping."],"key:en":["corba_idl"],"ns:computer.programming_language.developers":["Object Management Group"],"ns:computer.programming_language.language_designers":["Object Management Group"],"ns:common.topic.article":[{"ns:common.document.updated":["\"2009-04-23T13:15:18.502704Z\"^^<http://www.w3.org/2001/XMLSchema#dateTime>"],"ns:common.document.text":["<div><p>The CORBA Interface Definition Language (IDL) is used to define interfaces to objects in your network. <br><br>IDL allows you to define interfaces to objects without specifying the implementation of those interfaces. To implement an IDL interface, you define a C++ class that can be accessed through that interface and then you create objects of that class within an Orbix server application. </p><p> In fact, you can implement IDL interfaces using any programming language for which an IDL mapping is available. An IDL mapping specifies how an interface defined in IDL corresponds to an implementation defined in a programming language. CORBA applications written in different programming languages are fully interoperable. </p><p> CORBA defines standard mappings from IDL to several programming languages, including C++, Java, and Smalltalk. The Orbix IDL compiler converts IDL definitions to corresponding C++ definitions, in accordance with the standard IDL to C++ mapping. </p></div>"],"ns:common.document.content":["ns:m.05ttj83"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Corba IDL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259gdnpq"],"ns:computer.programming_language.influenced_by":["ns:m.0jgqg"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"]}}