{"ns:m.0ghmfk":{"rdfs:label":["Cadence SKILL"],"ns:common.topic.description":["SKILL is a Lisp dialect used as a scripting language and PCell description language used in many EDA software suites by Cadence Design Systems. It was originally put forth in an IEEE paper in 1990."],"key:en":["cadence_skill"],"ns:common.topic.article":[{"ns:common.document.text":["SKILL is a Lisp dialect used as a scripting language and PCell (parameterized cells) description language used in many EDA software suites by Cadence Design Systems (e.g. Cadence Allegro and Cadence Virtuoso). It was originally put forth in an IEEE paper in 1990.\\nSKILL was originally based on a flavor of Lisp called “Franz Lisp” created at UC Berkeley by the students of Professor Richard J. Fateman. SKILL is not an acronym; it is a name. For trademark reasons Cadence prefers it be capitalized.\\nFranz Lisp and all other flavors of LISP were eventually superseded by an ANSI standard for Lisp called \\\"Common Lisp.\\\" Historically, SKILL was known as IL. SKILL was a library of IL functions. The name was originally an initialism for Silicon Compiler Interface Language (SCIL), pronounced \\\"SKIL,\\\" which then morphed into \\\"SKILL,\\\" a plain English word that was easier for everyone to remember.'\\n\\\"IL\\\" was just Interface Language. Whilst SKILL was used initially to describe the API rather than the language, the snappier name stuck. The name \\\"IL\\\" remains a common file extension used for SKILL code \\\".il\\\" designating that the code contained in the file have lisp-2 semantics. Another possible file"],"ns:common.document.source_uri":["<http://wp/en/6693612>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1990"],"ns:type.object.name":["Cadence SKILL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259dxh5n"],"ns:computer.programming_language.influenced_by":["ns:m.06zrb"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}