{"ns:m.0bwl4s":{"ns:common.topic.description":["PowerHouse is a trademarked name for a byte-compiled fourth-generation programming language originally produced by Quasar Corporation for the Hewlett-Packard HP3000 mini-computer. It was initially composed of five components:\\nQDD, or Quasar Data Dictionary: for building a central data dictionary used by all other components\\nQDesign: a character-based screen generator\\nQuick: an interactive, character-based screen processor\\nQuiz: a report writer\\nQTP: a batch transaction processor."],"rdfs:label":["PowerHouse"],"key:en":["powerhouse_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["PowerHouse is a trademarked name for a byte-compiled fourth-generation programming language (or 4GL) originally produced by Quasar Corporation (later renamed Cognos Incorporated) for the Hewlett-Packard HP3000 mini-computer. It was initially composed of five components:\\nPowerHouse was introduced in 1982 and bundled together in a single product Quiz and Quick/QDesign, both of which had been previously available separately, with a new batch processor QTP. In 1983, Quasar changed its name to Cognos Corporation and began porting their application development tools to other platforms, notably Digital Equipment Corporation's VAX, Data General's Eclipse MV, and IBM's AS/400, along with the UNIX platforms from these vendors. Cognos also began extending their product line with add-ons to PowerHouse (for example, Architect) and end-user applications written in PowerHouse (for example, MultiView). Subsequent development of the product added support for platform-specific relational databases, such as HP's Allbase/SQL, DEC's Rdb, and Microsoft's SQL Server, as well as cross-platform relational databases such as Oracle, Sybase, and IBM's DB2.\\nThe PowerHouse language represented a considerable"],"ns:common.document.source_uri":["<http://wp/en/4313670>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PowerHouse"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125602hqy"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}