{"ns:m.02qfk_c":{"ns:common.topic.description":["WebQL Home Page http://www.ql2.com/products-services/ql2-webql/\\nWebQL has been on the market since 2001. The most current version, WebQL 3.1, was released in November 2006. WebQL was named a \\\"Trend Setting Product for 2006\\\" by KM World. WebQL customers include 5 of the top 10 pharmaceutical companies and 7 of the top 10 airlines.\\nIn many web data integration tasks, the desired data is located on a web page that is accessible only through a form that needs to be completed to access detailed information. WebQL is capable of automatically populating such variable data to gain access to the “deep” Web. The data can then be extracted by WebQL and transformed into an actionable format to be used in a variety of analytical operations.\\nWebQL features novel URL schemes that allow for enhanced flexibility when accessing data sources that are external to WebQL. WebQL also support XML data of arbitrary size, and APIs for embedding WebQL in C, Java or .NET programs.\\nWebQL is driven by a sophisticated programming language similar to standard SQL. The language has a number of operations designed to simplify complex data integration tasks."],"rdfs:label":["WebQL"],"key:en":["webql"],"ns:common.topic.article":[{"ns:common.document.text":["WebQL is a software platform produced by QL2 Software, that is used to automate data integration and collection from unstructured and structured sources including the Web, PDF and Word documents, spreadsheets, email repositories, corporate data stores and more.\\nWebQL has been on the market since 2001. The most current version, WebQL 3.1, was released in November 2006. WebQL was named a \\\"Trend Setting Product for 2006\\\" by KM World. WebQL customers include 5 of the top 10 pharmaceutical companies and 7 of the top 10 airlines.\\nIn addition to handling content in text, WebQL is also capable of Optical Character Recognition that enables it to retrieve text within images.\\nIn many web data integration tasks, the desired data is located on a web page that is accessible only through a form that needs to be completed to access detailed information. WebQL is capable of automatically populating such variable data to gain access to the “deep” Web. The data can then be extracted by WebQL and transformed into an actionable format to be used in a variety of analytical operations.\\nWebQL features novel URL schemes that allow for enhanced flexibility when accessing data sources that are external to"],"ns:common.document.source_uri":["<http://wp/en/10486015>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["WebQL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dysccz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}