{"ns:m.06bt54":{"ns:common.topic.description":["Lava is an experimental, visual object-oriented, interpreter-based programming language with an associated programming environment that uses structure editors instead of text editors. Only comments, constants, and new identifiers may be entered as text.\\nDeclarations are represented in LavaPE as tree structures whose subtrees may be collapsed or expanded. The properties of the declared Lava entities can be edited through pop-up dialogs.\\nAlthough executable code has a traditional text representation in LavaPE, it can be edited only as complete syntactic units, rather than character by character. If you insert a new syntactic construct, it will typically contain \\\"placeholders\\\" that can then be replaced by concrete constructs; the latter may in turn contain syntactic variables, etc. LavaPE provides a tool button for every type of syntactic construct, and a button is enabled only if it is syntactically correct to insert the associated construct at the selected place.\\nFurther characteristic properties of Lava and LavaPE include the following:\\nIt provides strict syntactic separation of interface and implementation sections of a Lava class."],"rdfs:label":["Lava"],"key:en":["lava_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Lava is an experimental, visual object-oriented, interpreter-based programming language with an associated programming environment (Lava Programming Environment or LavaPE) that uses structure editors instead of text editors. Only comments, constants, and new identifiers must be entered as text.\\nDeclarations are represented in LavaPE as tree structures whose subtrees may be collapsed or expanded. The properties of the declared Lava entities can be edited through pop-up dialogs.\\nAlthough executable code has a traditional text representation in LavaPE, it can be edited only as complete syntactic units, rather than character by character. If you insert a new syntactic construct, it will typically contain \\\"placeholders\\\" (syntactic variables) that can then be replaced by concrete constructs; the latter may in turn contain syntactic variables, etc. LavaPE provides a tool button for every type of syntactic construct, and a button is enabled only if it is syntactically correct to insert the associated construct at the selected place.\\nFurther characteristic properties of Lava and LavaPE include the following:\\nLava is open source software using the GPL license (see also Lava at the Free"],"ns:common.document.source_uri":["<http://wp/en/1982671>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Lava"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258jbgyr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}