{"ns:m.01d2vj":{"key:user.avh.ellerdale":["0080-7c2b"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0080-7c2b"],"ns:common.topic.description":["Whitespace is an esoteric programming language developed by Edwin Brady and Chris Morris at the University of Durham. It was released on 1 April 2003. Its name is a reference to whitespace characters. Unlike most programming languages, which ignore or assign little meaning to most whitespace characters, the Whitespace interpreter ignores any non-whitespace characters. Only spaces, tabs and linefeeds have meaning. An interesting consequence of this property is that a Whitespace program can easily be contained within the whitespace characters of a program written in another language, except possibly in languages which depend on spaces for syntax validity such as Python, making the text a polyglot.\\nThe language itself is an imperative stack-based language. The virtual machine on which the programs run has a stack and a heap. The programmer is free to push arbitrary-width integers onto the stack and can also access the heap as a permanent store for variables and data structures."],"rdfs:label":["Whitespace"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ホワイトスペース"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["Whitespace is an esoteric programming language developed by Edwin Brady and Chris Morris at the University of Durham (also developers of the Kaya programming language). It was released on 1 April 2003 (April Fool's Day). Its name is a reference to whitespace characters. Unlike most programming languages, which ignore or assign little meaning to most whitespace characters, the Whitespace interpreter ignores any non-whitespace characters. Only spaces, tabs and linefeeds have meaning. An interesting consequence of this property is that a Whitespace program can easily be contained within the whitespace characters of a program written in another language, except possibly in languages which depend on spaces for syntax validity such as Python, making the text a polyglot.\\nThe language itself is an imperative stack-based language. The virtual machine on which the programs run has a stack and a heap. The programmer is free to push arbitrary-width integers onto the stack (currently there is no implementation of floating point numbers) and can also access the heap as a permanent store for variables and data structures.\\nWhitespace was created by Edwin Brady and Chris Morris in 2002. Slashdot"],"ns:common.document.source_uri":["<http://wp/en/205017>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.image":[{"ns:type.content.length":["4490"],"rdfs:label":["Whitespace hello world program with syntax highlighting ██ tabs ██ spaces"],"ns:type.content.blob_id":["d3478e43e6053c115a6faf953309587aa80a6a48eeec551dad55fa06ef089233"],"ns:common.licensed_object.provenance":["wikipedia,commons,63409"],"ns:type.content.source":["ns:m.02c5ggs"],"ns:common.image.size":["ns:m.02c5ggy"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["Whitespace hello world program with syntax highlighting ██ tabs ██ spaces"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.01d2vj"]}],"ns:type.object.name":["Whitespace"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257_pqhd"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}