{"ns:m.01c9l2":{"rdfs:label":["ISPF"],"ns:common.topic.description":["In computing, Interactive System Productivity Facility is a software product for the z/OS operating system that runs on IBM mainframes. It includes a screen editor, the user interface of which was emulated by some microcomputer editors sold commercially starting in the late 1980s, including SPFPC.\\nISPF primarily provides an IBM 3270 terminal interface with a set of panels. Each panel may include menus and dialogs to run tools on the underlying Time Sharing Option. Generally, these panels just provide a convenient interface to do tasks—most of them execute modules of IBM mainframe utility programs to do the actual work. ISPF is frequently used to manipulate z/OS data sets via its Program Development Facility named ISPF/PDF, where PDF refers to Program Development Facility.\\nISPF is user-extensible and it is often used as an application programming interface. Many vendors have created products for z/OS that use the ISPF interface.\\nAn early version was called merely SPF and introduced in MVS system in 1974."],"key:en":["ispf"],"ns:common.topic.article":[{"ns:common.document.text":["In computing, Interactive System Productivity Facility (ISPF) is a software product for the z/OS operating system that runs on IBM mainframes. It includes a screen editor, the user interface of which was emulated by some microcomputer editors sold commercially starting in the late 1980s, including SPFPC.\\nISPF primarily provides an IBM 3270 terminal interface with a set of panels. Each panel may include menus and dialogs to run tools on the underlying Time Sharing Option (TSO). Generally, these panels just provide a convenient interface to do tasks -- most of them execute modules of IBM mainframe utility programs to do the actual work. ISPF is frequently used to manipulate z/OS data sets via its Program Development Facility (ISPF/PDF).\\nISPF is user-extensible and it is often used as an application programming interface. Many vendors have created products for z/OS that use the ISPF interface.\\nAn early version was called merely SPF and introduced in MVS system. Originally this stood for Structured Programming Facility, since it was introduced about the same time as structured programming concepts, but later the name was changed to System Productivity Facility.\\nISPF can also be run"],"ns:common.document.source_uri":["<http://wp/en/199337>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["ISPF"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cyfryy"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}