{"ns:m.0bp8q":{"ns:common.topic.description":["Curl is a reflective object-oriented programming language for interactive web applications whose goal is to provide a smoother transition between formatting and programming. It makes it possible to embed complex objects in simple documents without needing to switch between programming languages or development platforms.The Curl implementation initially consisted of just an interpreter, but a compiler was later added.\\nCurl combines text markup, scripting, and heavy-duty computing within one unified framework. It is used in a range of internal enterprise, B2B, and B2C applications.\\nCurl programs may be compiled into Curl applets, that are viewed using the Curl RTE, a runtime environment with a plugin for web browsers. Currently, it is supported on Microsoft Windows, Linux, and Mac OS X. Curl supports \\\"detached applets\\\", which is a web deployed applet which runs on the user's desktop independent of a browser window much as in Silverlight 3 and Adobe AIR."],"rdfs:label":["Curl"],"key:en":["curl_programming_language"],"ns:common.topic.social_media_presence":["<http://developers.curl.com>"],"ns:common.topic.official_website":["<http://www.curl.com/>"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.0bbfgkn"],"ns:common.webpage.resource":["ns:m.0bw9bzw"],"ns:common.webpage.uri":["<http://www.curl.com>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0bp8q"]}],"ns:common.topic.article":[{"ns:common.document.text":["Curl is a reflective object-oriented programming language for interactive web applications whose goal is to provide a smoother transition between formatting and programming. It makes it possible to embed complex objects in simple documents without needing to switch between programming languages or development platforms.\\nThe language attempts to address a long-standing problem: the different building blocks that make up any modern web document most often require wildly different methods of implementation: different languages, different tools, different frameworks, often completely different teams. The final — and often most difficult — hurdle has been getting all of these blocks to communicate with each other in a consistent manner. Curl attempts to side-step these problems by providing a consistent syntactic and semantic interface at all levels of web content creation: from simple HTML to complex object-oriented programming.\\nCurl combines text markup (as in HTML), scripting (as in JavaScript), and heavy-duty computing (as in Java, C#, or C++) within one unified framework. It is used in a range of internal enterprise, B2B, and B2C applications.\\nCurl is a markup language like"],"ns:common.document.source_uri":["<http://wp/en/42537>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1998"],"ns:type.object.name":["Curl"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125564drg"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0jgqg"]}}