{"ns:m.04n8q":{"key:user.avh.ellerdale":["0099-7bf5"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0099-7bf5"],"ns:common.topic.description":["Logo is an educational programming language, designed in 1967 by Daniel G. Bobrow, Wally Feurzeig, Seymour Papert and Cynthia Solomon. Today the language is remembered mainly for its use of \\\"turtle graphics\\\", in which commands for movement and drawing produced line graphics either on screen or with a small robot called a \\\"turtle\\\". The language was originally conceived to teach concepts of programming related to LISP and only later to enable what Papert called \\\"body-syntonic reasoning\\\" where students could understand the turtle's motion by imagining what they would do if they were the turtle. There are substantial differences between the many dialects of Logo, and the situation is confused by the regular appearance of turtle graphics programs that mistakenly call themselves Logo.\\nLogo is a multi-paradigm adaptation and dialect of Lisp, a functional programming language. There is no standard Logo, but UCBLogo has best facilities for handling lists, files, I/O, and recursion in scripts, and can be used to teach all computer science concepts, as UC Berkeley lecturer Brian Harvey did in his Computer Science Logo Style trilogy."],"rdfs:label":["Logo"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ロゴ"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.image":[{"ns:type.content.blob_id":["6c2be3d4204f855b32353ac3002a147cbbfd7993745c6fcaca9c067b5d67b499"],"ns:type.content.length":["96506"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Remi"],"rdfs:label":["Remi turtlegrafik"],"ns:common.licensed_object.provenance":["wikipedia,commons,622955"],"ns:common.image.size":["ns:m.01x6k07"],"ns:type.content.source":["ns:m.0291dm9"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["Remi turtlegrafik"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.04n8q"]}],"ns:common.topic.article":[{"ns:common.document.text":["Logo is a multi-paradigm computer programming language used in education. It is an adaptation and dialect of the Lisp language; some have called it Lisp without the parentheses. It was originally conceived and written as a functional programming language, and drove a mechanical turtle as an output device. It also has significant facilities for handling lists, files, I/O, and recursion. Today it is remembered mainly for its turtle graphics, though for tertiary level teaching it has been superseded by Scheme, and scripting languages.\\nLogo was created in 1967 for educational use, more so for constructivist teaching, by Daniel G. Bobrow, Wally Feurzeig, Seymour Papert and Cynthia Solomon. The name is derived from the Greek logos meaning word, emphasising the contrast between itself and other existing programming languages that processed numbers. It can be used to teach most computer science concepts, as UC Berkeley lecturer Brian Harvey does in his Computer Science Logo Style trilogy.\\nLogo was created in 1967 at Bolt, Beranek and Newman (BBN), a Cambridge, Massachusetts research firm, by Wally Feurzeig and Seymour Papert. Its intellectual roots are in artificial intelligence,"],"ns:common.document.source_uri":["<http://wp/en/18334>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Wally Feurzeig"],"ns:computer.programming_language.introduced":["1967"],"ns:type.object.name":["Logo"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12577xg50"],"ns:computer.programming_language.influenced":["ns:m.0x1xg32"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.037xjq"],"ns:computer.programming_language.influenced_by":["ns:m.04kyw"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}