{"ns:m.05p4tb2":{"rdfs:label":["GOAL agent programming language"],"ns:common.topic.description":["GOAL is an agent programming language for programming cognitive agents. GOAL agents derive their choice of action from their beliefs and goals. The language provides the basic building blocks to design and implement cognitive agents by programming constructs that allow and facilitate the manipulation of an agent's beliefs and goals and to structure its decision-making. The language provides an intuitive programming framework based on common sense or practical reasoning."],"key:en":["goal_agent_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["GOAL is an agent programming language for programming rational agents. GOAL agents derive their choice of action from their beliefs and goals. The language provides the basic building blocks to design and implement rational agents by means of a set of programming constructs. These programming constructs allow and facilitate the manipulation of an agent's beliefs and goals and to structure its decision-making. The language provides an intuitive programming framework based on common sense or practical reasoning.\\nThe main features of GOAL include:\\nA GOAL agent program consists of six different sections, including the knowledge, beliefs, goals, action rules, action specifications, and percept rules, respectively. The knowledge, beliefs and goals are represented in a knowledge representation language such as Prolog, Answer set programming, SQL (or Datalog), or the Planning Domain Definition Language, for example. Below, we illustrate the components of a GOAL agent program using Prolog.\\nThe overall structure of a GOAL agent program looks like:\\nThe GOAL agent code used to illustrate the structure of a GOAL agent is an agent that is able to solve Blocks world problems. The beliefs of the"],"ns:common.document.source_uri":["<http://wp/en/21936569>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.image":[{"ns:type.content.length":["197441"],"ns:type.content.blob_id":["2cf22f9fa2dd65a4605aadb36899415a16a3db40793deb8dba0f9ef6c11171a0"],"rdfs:label":["border=0"],"ns:type.content.uploaded_by":["ns:m.0220tm0"],"ns:common.image.size":["ns:m.02c1kxs"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.source":["ns:m.05pkrp2"],"ns:type.content.media_type":["ns:m.08y0"],"ns:type.object.name":["border=0"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.05p4tb2"]}],"ns:type.object.name":["GOAL agent programming language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d7nt5t"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}