{"ns:m.02srct":{"ns:common.topic.description":["IITRAN was a programming language created in the mid-1960s. It was designed as a first language for students, and its syntax resembled that of PL/I. The name derives from Illinois Institute of Technology, where it was developed.\\nThe IITRAN language was initially implemented on an IBM System/360 DOS system. In the early 1970s, the IBM platform proved to be too small for the IIT environment and the hardware was upgraded. A new version was developed for the Univac 1108 platform. The language itself did not change but with the new hardware, a new implementation of the IITran software was developed.\\nIITRAN was designed and developed in response to the increasing demand for a computer language which would meet the following specifications:\\nIt should be clear, concise, and easily learned, even for those who have had no previous experience with computers or mathematics;\\nIt should bear as close a resemblance as possible to the English language;\\nIt should be free of awkward restrictions and limitations;\\nIt should be consistent with mathematical and logical foundations;\\nIt should allow processing of a great number of individual programs in a very short time;"],"rdfs:label":["IITRAN"],"key:en":["iitran"],"ns:common.topic.article":[{"ns:common.document.text":["IITRAN was a programming language created in the mid 1960s. It was designed as a first language for students, and its syntax resembled that of PL/I. The name derives from Illinois Institute of Technology, where it was developed.\\nThe IITRAN language was initially implemented on an IBM System/360 DOS system. In the early 1970s, the IBM platform proved to be too small for the IIT environment and the hardware was upgraded. A new version was developed for the Univac 1108 platform. The language itself did not change but with the new hardware, a new implementation of the IITran software was developed.\\nIITRAN was designed and developed in response to the increasing demand for a computer language which would meet the following specifications:\\n(Bauer, p. V)"],"ns:common.document.source_uri":["<http://wp/en/586692>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["IITRAN"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255lzb8k"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}