{"ns:m.0gnckq":{"rdfs:label":["Chapel"],"ns:common.topic.description":["Chapel, the Cascade High Productivity Language, is a parallel programming language developed by Cray. It is being developed as part of the Cray Cascade project, a participant in DARPA's High Productivity Computing Systems program, which had the goal of increasing supercomputer productivity by the year 2010. It is being developed as an open source project, under the BSD license."],"key:en":["chapel_programming_language"],"ns:computer.programming_language.developers":["Cray"],"ns:common.topic.article":[{"ns:common.document.text":["Chapel is parallel programming language developed by Cray. It is being developed as part of the Cray Cascade project, a participant in DARPA's High Productivity Computing Systems (HPCS) program, which had the goal of increasing supercomputer productivity by the year 2010. Chapel aims to improve the programmability of parallel computers in general and the Cascade system in particular, by providing a higher level of expression than current programming languages do and by improving the separation between algorithmic expression and data structure implementation details.\\nChapel, the Cascade High Productivity Language, supports a multithreaded parallel programming model at a high level by supporting abstractions for data parallelism, task parallelism, and nested parallelism. It enables optimizations for the locality of data and computation in the program via abstractions for data distribution and data-driven placement of subcomputations. It allows for code reuse and generality through object-oriented concepts and generic programming features. For instance, Chapel allows for the declaration of locales.\\nWhile Chapel borrows concepts from many preceding languages, its parallel concepts are"],"ns:common.document.source_uri":["<http://wp/en/6776794>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Chapel"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258qg2zj"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.044cfc"]}}