{"ns:m.0bm90n":{"ns:common.topic.description":["EuLisp is a statically and dynamically scoped Lisp dialect developed by a loose formation of industrial and academic Lisp users and developers from around Europe. The standardizers intended to create a new Lisp \\\"less encumbered by the past\\\", and not so minimalistic as Scheme. Another objective was to integrate the Object-oriented programming paradigm well."],"rdfs:label":["EuLisp"],"key:en":["eulisp"],"ns:common.topic.article":[{"ns:common.document.text":["EuLisp is a statically and dynamically scoped Lisp dialect developed by a loose formation of industrial and academic Lisp users and developers from around Europe. The standardizers intended to create a new Lisp \\\"less encumbered by the past\\\" (compared to Common Lisp), and not so minimalistic as Scheme. Another objective was to integrate the Object-oriented programming paradigm well.\\nLanguage definition process first began in a meeting in 1985 in Paris and took a long time. The complete specification and a first implementation (interpreted-only) was available in 1990.\\nIts primary characteristics are that it is a Lisp-1 (no separate function and variable namespaces), has a CLOS-style (Common Lisp Object System) generic-function type object-oriented system named TELOS (The EuLisp Object System) integrated from the ground up, has a built-in module system, and is defined in layers to promote the use of the Lisp on small, embedded hardware and educational machines. It supports continuations, though not as powerfully as Scheme. It has a simple lightweight process mechanism (threads).\\nAn early implementation of EuLisp was FEEL (Free and Eventually Eulisp). The successor to FEEL was Youtoo"],"ns:common.document.source_uri":["<http://wp/en/4158686>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["EuLisp"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125829mlr"],"ns:computer.programming_language.influenced_by":["ns:m.06zrb"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0gzl9z"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:computer.programming_language.parent_language":["ns:m.04kyw"]}}