{"ns:m.03nyxs":{"ns:common.topic.description":["Perl Data Language is a set of free software array programming extensions to the Perl programming language. PDL extends the data structures built into Perl, to include large multidimensional arrays, and adds functionality to manipulate those arrays as vector objects. It also provides tools for image processing, computer modeling of physical systems, and graphical plotting and presentation. Simple operations are automatically vectorized across complete arrays, and higher-dimensional operations are supported. On a computer with both Perl and PDL installed, any Perl script can use the PDL functionality by declaring \\\"use PDL;\\\"."],"rdfs:label":["Perl Data Language"],"key:en":["perl_data_language"],"ns:common.topic.official_website":["<http://www.pdl.perl.org/>"],"ns:common.topic.article":[{"ns:common.document.text":["PDL (which is an anacronym for Perl Data Language) is a set of array programming extensions to the Perl programming language which, like Perl, is free software. It is an extension to Perl v5 which is intended for scientific and other data intensive programming tasks. Perl's data structures are intended for small to medium sized analysis tasks: they embody simple data structures and include considerable behind-the-scenes magic for type conversion, variable size, and the like. Numerical tasks such as image processing and computer modeling of physical systems require more structured data, and PDL supplies this need by including more traditional array constructs and additional syntax to describe vector processes. On a computer with both Perl and PDL installed, any Perl script can use the PDL functionality by declaring \\\"use PDL;\\\".\\nPDL is a vectorized array programming language: the expression syntax is a variation on standard mathematical vector notation, so that the user can combine and operate on large arrays with simple expressions. In this respect, PDL follows in the footsteps of the APL programming language, and it has been compared to commercial languages such as MATLAB and"],"ns:common.document.source_uri":["<http://wp/en/908764>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://pdl.perl.org/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.03nyxs"]}],"ns:type.object.name":["Perl Data Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258dzyhq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1d"],"ns:computer.programming_language.language_paradigms":["ns:m.03m62t"]}}