{"ns:m.03m_kt":{"ns:common.topic.description":["Thue is an esoteric programming language invented by John Colagioia in early 2000. It is a meta-language that can be used to define or recognize Type-0 languages from the Chomsky hierarchy. Because it is able to define languages of such complexity, it is also Turing-complete itself. Thue is based on a nondeterministic string rewriting system called semi-Thue grammar, which itself is named after the Norwegian mathematician Axel Thue; inspiration is also taken from the grue. The author describes it as follows: \\\"Thue represents one of the simplest possible ways to construe constraint-based programming. It is to the constraint-based paradigm what languages like OISC are to the imperative paradigm; in other words, it's a tar pit.\\\""],"rdfs:label":["Thue"],"key:en":["thue"],"ns:common.topic.article":[{"ns:common.document.text":["Thue ( /ˈtuːeɪ/ too-ay) is an esoteric programming language invented by John Colagioia in early 2000. It is a meta-language that can be used to define or recognize Type-0 languages from the Chomsky hierarchy. Because it is able to define languages of such complexity, it is also Turing-complete itself. Thue is based on a nondeterministic string rewriting system called semi-Thue grammar, which itself is named after (and possibly created by) the Norwegian mathematician Axel Thue; inspiration is also taken from the grue. The author describes it as follows: \\\"Thue represents one of the simplest possible ways to construe constraint-based programming. It is to the constraint-based paradigm what languages like OISC are to the imperative paradigm; in other words, it's a tar pit.\\\"\\nA Thue program starts with a rulebase, which is a series of substitution rules, each of this form:\\nThe rulebase terminates with a lone production symbol on a line:\\nThe initial state is a series of symbols which follow the rulebase.\\nThue consumes the initial symbols and substitutes the result of the rules for each of the initial state's symbols.\\nThue terminates when lhs cannot be found in a resultant state.\\nWhen"],"ns:common.document.source_uri":["<http://wp/en/899025>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Thue"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258177_t"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}