{"ns:m.03qtjn":{"rdfs:label":["MPD"],"ns:common.topic.description":["Multithreaded, Parallel, and Distributed programming is a concurrent programming language whose syntax is derived from the one used in the book Foundations of Multithreaded, Parallel, and Distributed Programming The name thus lists the distinguishing features of the language, namely that it supports all three of these concurrent programming techniques.\\nMPD is implemented as a variant of the SR programming language. It has a different parser, but it uses the same intermediate form and run-time system as SR. Consequently, MPD provides the same variety of concurrent programming mechanisms as does SR.\\nMPD programs can execute on single processors, shared-memory multiprocessors, or clusters of processors. The implementation transparently supports a variety of different kinds of processors and Unix systems."],"key:en":["mpd_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["MPD is a concurrent programming language whose syntax is derived from the one used in the book Foundations of Multithreaded, Parallel, and Distributed Programming (the name of the language comes from the first three letters of the main words of the title.) The name thus lists the distinguishing features of the language, namely that it supports all three of these concurrent programming techniques.\\nMPD is implemented as a variant of the SR programming language. It has a different parser, but it uses the same intermediate form and run-time system as SR. Consequently, MPD provides the same variety of concurrent programming mechanisms as does SR.\\nMPD programs can execute on single processors, shared-memory multiprocessors, or clusters of (homogeneous) processors. The implementation transparently supports a variety of different kinds of processors and Unix systems."],"ns:common.document.source_uri":["<http://wp/en/928466>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["MPD"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256y2bn8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}