{"ns:m.0fs5n":{"ns:common.topic.description":["SISAL is a general-purpose single assignment functional programming language with strict semantics, implicit parallelism, and efficient array handling. SISAL outputs a dataflow graph in Intermediary Form 1. It was derived from VAL, and adds recursion and finite streams. It has a Pascal-like syntax and was designed to be a common high-level language for numerical programs on a variety of multiprocessors."],"rdfs:label":["SISAL"],"key:en":["sisal"],"ns:common.topic.article":[{"ns:common.document.text":["SISAL (Streams and Iteration in a Single Assignment Language) is a general-purpose single assignment functional programming language with strict semantics, implicit parallelism, and efficient array handling. SISAL outputs a dataflow graph in Intermediary Form 1 (IF1). It was derived from VAL (Value-oriented Algorithmic Language, designed by Jack Dennis), and adds recursion and finite streams. It has a Pascal-like syntax and was designed to be a common high-level language for numerical programs on a variety of multiprocessors.\\nSISAL was defined in 1983 by James McGraw et al., at the University of Manchester, LLNL, Colorado State University and DEC. It was revised in 1985, and the first compiled implementation was made in 1986. Its performance is superior to C and rivals Fortran, according to some sources, combined with efficient and automatic parallelization.\\nSISAL's name came from grepping \\\"sal\\\" for \\\"Single Assignment Language\\\" from the Unix dictionary /usr/dict/words.\\nVersions exist for the Cray X-MP, Y-MP, 2; Sequent, Encore Alliant, DEC VAX-11/784, dataflow architectures, KSR1, Transputers and systolic arrays.\\nSISAL saw a brief resurgence in 2010 when a group of undergraduates"],"ns:common.document.source_uri":["<http://wp/en/57406>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1983"],"ns:type.object.name":["SISAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d2hct0"],"ns:computer.programming_language.influenced_by":["ns:m.05y49"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.0445gc"],"ns:computer.programming_language.influenced":["ns:m.06svrt"]}}