{"ns:m.05l1s8":{"ns:common.topic.description":["PBASIC is a microcontroller-based version of BASIC created by Parallax, Inc.\\nPBASIC was created to bring ease of use to the microcontroller and embedded processor world. It is used for writing code for the BASIC Stamp microcontrollers. After the code is written, it is tokenized and loaded into an EEPROM on the microcontroller. These tokens are fetched by the microcontroller and used to generate instructions for the processor."],"rdfs:label":["PBASIC"],"key:en":["pbasic"],"ns:common.topic.article":[{"ns:common.document.text":["PBASIC is a microcontroller based version of BASIC created by Parallax, Inc. The language was created to bring ease of use to the microcontroller and embedded processor world. PBASIC is used for writing code for the BASIC Stamp microcontrollers. After the code is written it is tokenized and loaded into an EEPROM on the microcontroller. These tokens are fetched by the microcontroller and used to generate instructions for the processor.\\nWhen starting a PBASIC file, the programmer defines the version of the BASIC Stamp and the version of PBASIC that will be used. Variables and constants are usually declared first thing in a program. The DO LOOP, FOR NEXT loop, IF and ENDIF, and some standard BASIC commands are part of the language, but many commands like PULSOUT, HIGH, LOW, DEBUG, and FREQOUT are native to PBASIC and used for special purposes that are not available in traditional BASIC (such as having the Basic Stamp ring a piezo-speaker, for example).\\nIn PBASIC you have to select 1 of 7 different basic stamps, BS1, BS2, BS2E, BS2SX, BS2P, BS2PE, and BS2PX, and to that you have to select one of these commands:\\n' {$STAMP BS1}\\n' {$STAMP BS2}\\n' {$STAMP BS2e}\\n' {$STAMP BS2sx}\\n' {$STAMP"],"ns:common.document.source_uri":["<http://wp/en/1655770>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PBASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cz1sr5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}