{"ns:m.02b6np":{"ns:common.topic.description":["A data definition language or data description language is a syntax similar to a computer programming language for defining data structures, especially database schemas."],"rdfs:label":["Data definition language"],"key:en":["data_definition_language"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["データていぎげんご"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["A data definition language or data description language (DDL) is a syntax similar to a computer programming language for defining data structures, especially database schemas.\\nThe data definition language concept and name was first introduced in relation to the Codasyl database model, where the schema of the database was written in a language syntax describing the records, fields, and sets of the user data model. Later it was used to refer to a subset of Structured Query Language (SQL) for creating tables and constraints. SQL-92 introduced a schema manipulation language and schema information tables to query schemas. These information tables were specified as SQL/Schemata in SQL:2003. The term DDL is also used in a generic sense to refer to any formal language for describing data or information structures.\\nUnlike many data description languages, SQL uses a collection of imperative verbs whose effect is to modify the schema of the database by adding, changing, or deleting definitions of tables or other objects. These statements can be freely mixed with other SQL statements, so the DDL is not truly a separate language.\\nCreate - To make a new database, table, index, or stored query. A"],"ns:common.document.source_uri":["<http://wp/en/452018>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Data definition language"],"rdf:type":["ns:user.aldopomponi.default_domain.testaldotype"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258m_gsl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}