{"ns:m.04p4mh":{"ns:common.topic.description":["Action! is a programming language and development environment with an integrated editor, compiler, and debugger for the Atari 8-bit family of computers. It was created by Clinton Parker, who had previously developed the Micro SPL language with Henry Baker, and released on cartridge by Optimized Systems Software in 1983. Action! was used to develop at least two commercial products--the Homepak productivity suite and Games Computers Play client program--and numerous programs in ANALOG Computing and Antic magazines. The language was never ported to other systems.\\nThe Action! language syntax is similar to that of ALGOL 68. Constructs were designed to map cleanly to 6502 opcodes, to provide the high performance necessary for game and graphics demos without needing complex optimizations in the compiler. Unlike the integrated Atari BASIC and Atari Assembler Editor environments, the Action! editor is full-screen, so it does not use line numbers.\\nA development library was available as a separate product called the Action! Toolkit.\\nThe 6502 assembly language source code for Action! was made available under the GNU General Public License by the author in 2015."],"rdfs:label":["Action!"],"key:en":["action_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Action! is a programming language, with integrated editor, debugger, and 6502 compiler, for the Atari 8-bit family of microcomputers. Action! was created by Clinton Parker and released on cartridge by Optimized Systems Software in 1983. Its syntax is similar to that of ALGOL 68.\\nAction! is significant for its high performance, which allows games and graphics demos to be written in a high-level language without use of hand-written assembly language code. Action! language constructs were designed to map cleanly to 6502 opcodes.\\nA development library was available as a separate product called the Action! Toolkit. Action! was used to develop at least two commercial products: the Homepak productivity suite and Games Computers Play client program. The language was never ported to other systems.\\nIn 2007 it inspired Effectus - a cross-compiler currently running on Windows targeting the Atari 8-bit. Effectus resembles Action! syntax and is intended to be as compatible as possible with it.\\nAction! has three fundamental data types, all of which are numeric.\\nInternally represented as an unsigned 8-bit integer. Values range from 0 to 255.\\nThe CHAR keyword can also be used to declare BYTE"],"ns:common.document.source_uri":["<http://wp/en/1273369>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Action!"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2pf5n"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"]}}