{"ns:m.0273jqp":{"ns:common.topic.description":["PC-LISP is an implementation of the Franz Lisp dialect by Peter Ashwood-Smith.\\nVersion 2.11 was released on May 15, 1986. A current version may be downloaded from the external link below.\\nCurrently, PC-LISP has been ported to 32 & 64 bit Linux, Mac, and Windows.\\nNote that the Franz LISP dialect was the immediate, portable successor to the ITS version of Maclisp and is perhaps the closest thing to the LISP in the Steven Levy book Hackers as is practical to operate. PC-LISP runs well in DOS emulators and on modern Windows versions. Because PC-LISP implements Franz LISP, it is a dynamically scoped predecessor to modern Common Lisp. This is therefore an historically important implementation."],"rdfs:label":["PC-LISP"],"key:en":["pc_lisp"],"ns:common.topic.article":[{"ns:common.document.text":["PC-LISP is an implementation of the Franz Lisp dialect for DOS by Peter Ashwood-Smith.\\nVersion 2.11 was released on May 15, 1986. It can still be found on old abandonware and shareware download sites.\\nAshwood-Smith says of his interpreter: \\\"PC-LISP is a small implementation of LISP for ANY MS-DOS machine. While small, it is capable of running a pretty good subset of Franz LISP.\\\"\\nNote that the Franz LISP dialect was the immediate, portable successor to the ITS version of Maclisp and is perhaps the closest thing to the LISP in the Steven Levy book Hackers as is practical to operate. PC-LISP runs well in DOS emulators and on modern Windows versions. Because PC-LISP implements Franz LISP, it is a dynamically scoped predecessor to modern Common Lisp. This is therefore an historically important implementation.\\nThe session is running the following code which demonstrates dynamic scoping in Franz LISP. Note that PC-LISP does not implement the let special form that Emacs Lisp provides for local variables. Instead, all variables are what an ALGOL-based language would call \\\"global\\\". The first dialect of Lisp to incorporate ALGOL scoping rules (called lexical scoping) was Scheme although the"],"ns:common.document.source_uri":["<http://wp/en/8440838>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PC-LISP"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cg9syx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}