{"ns:m.02f_lf":{"rdfs:label":["Synthesis Toolkit"],"ns:common.topic.description":["The Synthesis Toolkit is an open source API for real time audio synthesis with an emphasis on classes to facilitate the development of physical modelling synthesizers. It is written in C++ and is written and maintained by Perry Cook at Princeton University and Gary Scavone at CCRMA. It contains both low-level synthesis and signal processing classes and higher-level instrument classes which contain examples of most of the currently available physical modelling algorithms in use today. STK is free software, but a number of its classes, particularly some physical modelling algorithms, are covered by patents held by Stanford University and Yamaha.\\nThe STK is used widely in creating software synthesis applications. Versions of the STK instrument classes have been integrated into ChucK, Csound, Real-Time Cmix, Max/MSP, SuperCollider and FAUST. It has been ported to SymbianOS and iOS as well."],"key:en":["synthesis_toolkit"],"ns:common.topic.article":[{"ns:common.document.text":["The Synthesis Toolkit (STK) is an open source API for real time audio synthesis with an emphasis on classes to facilitate the development of physical modelling synthesizers. It is written in C++ and is written and maintained by Perry Cook at Princeton University and Gary Scavone at CCRMA. It contains both low-level synthesis and signal processing classes (oscillators, filters, etc.) and higher-level instrument classes which contain examples of most of the currently available physical modelling algorithms in use today. STK is free software, but a number of its classes, particularly some physical modelling algorithms, are covered by patents held by Stanford University and Yamaha.\\nThe STK is used widely in creating software synthesis applications. Versions of the STK instrument classes have been integrated into ChucK, Csound, Real-Time Cmix, Max/MSP (as part of PeRColate), SuperCollider and FAUST. It has been ported to SymbianOS as well."],"ns:common.document.source_uri":["<http://wp/en/483766>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Synthesis Toolkit"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258t0m3f"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}