{"ns:m.04j9q4g":{"rdfs:label":["SAS language"],"ns:common.topic.description":["The SAS language is a computer programming language used for statistical analysis, originated by a project at the North Carolina State University. It can read in data from common spreadsheets and databases and output the results of statistical analyses in tables, graphs, and as RTF, HTML and PDF documents. The SAS language runs under compilers that can be used on Microsoft Windows, Linux, and various other UNIX and mainframe computers.\\nThe SAS System and World Programming System are SAS language compilers."],"key:en":["sas_language"],"ns:common.topic.subject_of":["Edvancer Eduventures"],"ns:common.topic.subjects":["Edvancer Eduventures"],"ns:common.topic.article":[{"ns:common.document.text":["The SAS language is a data processing and statistical analysis language.\\nSee more on origins of SAS language at SAS System.\\nThe SAS language basically divides data processing and analysis into two kinds of steps.\\n1) Data Steps - Which manipulate data input and creation or deletion of variables .\\n2) Procedure Steps - Which manipulate analysis and output.The short form for each procedure step is Proc\\nEach line of code in SAS language ends with a \\\";\\\"\\nData Storage Hierarchy Data is stored in this hierarchy -\\n1)Libraries - Which contain datasets.\\nLibname Good \\\"C:/Data/\\\";\\nThis creates a reference path to library named Good at storage location \\\"C:/Data/\\\";\\n2)Datasets -Which contain variables and observations. Observations are rows , and variables are column headers.\\nDatasets can be temporary (they close when you shut down the SAS Compiling software) or they can be stored to the Operating Disk File System.\\ndata good.dataset1; (Output Dataset Name) set dataset2; (Input Dataset Name) run; (Command after each Data step)\\nThis stores the temporary dataset named \\\"Dataset2\\\" into a permanent location \\\"C:/Data/dataset1.sas7bdat ) because it uses the Reference to good as \\\"C:/Data/\\\"; in previous"],"ns:common.document.source_uri":["<http://wp/en/19060492>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["SAS language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2pf0q"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}