{"ns:m.09hbnw":{"ns:common.topic.description":["FLACC is an implementation of the ALGOL 68 programming language.\\nChris Thomson and Colin Broughton founded Chion Corporation which developed and marketed FLACC. This compiler and run-time system conformed exactly to the Revised Report, ran on IBM 370 and compatible mainframes, and included debugging features derived from WATFIV. It was released in 1977.\\nChris was a student of Barry J. Mailloux. Barry studied at Amsterdam's Mathematisch Centrum from 1966 under Adriaan van Wijngaarden. Barry's work on the Algol 68 language established the University of Alberta as a center for Algol 68-related activity.\\nAccording to Thomson decade later:\\nYou know, we only ever got 22 copies installed, and less than 5 of those in North America. Even though it ran on 370's under MVS, CMS and MTS, and was cheap and reliable. Talk about a marketing disaster."],"rdfs:label":["FLACC"],"key:en":["flacc"],"ns:common.topic.article":[{"ns:common.document.text":["FLACC is an implementation of the ALGOL 68 programming language.\\nChris Thomson and Colin Broughton founded Chion Corporation which developed and marketed FLACC (Full Language Algol 68 Checkout Compiler). This compiler and run-time system conformed exactly to the Revised Report, ran on IBM 370 and compatible mainframes, and included debugging features derived from WATFIV. It was released in 1977.\\nChris was a student of Barry J. Mailloux. Barry studied at Amsterdam's Mathematisch Centrum from 1966 under Adriaan van Wijngaarden. Barry's work on the Algol 68 language established the University of Alberta as a center for Algol 68-related activity.\\nAccording to Thomson decade later:\\nScanned documentation at softwarepreservation.org:"],"ns:common.document.source_uri":["<http://wp/en/3508682>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FLACC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255d324b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}