{"ns:m.0cm999h":{"ns:common.topic.description":["Qt Quick is a free software application framework developed and maintained by the Qt Project within the Qt framework. It provides a way of building custom, highly dynamic user interfaces with fluid transitions and effects, which are becoming more common especially in mobile devices. Qt Quick includes a declarative scripting language called QML.\\nQt Declarative is a runtime interpreter that reads the Qt declarative user interface definition, QML data, and displays the UI that it describes. The QML syntax allows using JavaScript to provide the logic, and it is often used for this purpose. It is not the only way, however: logic can be written with native code as well.\\nQt Quick and QML are officially supported in Qt 4.7, and it is a commercial option in mobile applications when Qt 4.7 is available for deployment in Symbian and Maemo/MeeGo devices."],"rdfs:label":["Qt Quick"],"ns:common.topic.article":[{"ns:common.document.text":["Qt Quick is a free software application framework developed and maintained by Nokia within the Qt framework. It provides a declarative way of building custom, highly dynamic user interfaces with fluid transitions and effects, which are becoming more common especially in mobile devices. Qt Quick includes a declarative scripting language called QML.\\nQt Declarative is a runtime interpreter that reads the Qt declarative user interface definition, QML data, and displays the UI that it describes. The QML syntax allows using JavaScript to provide the logic, and it is often used for this purpose. It is not the only way, however: logic can be written with native code as well.\\nQt Quick and QML are officially supported in Qt 4.7 (with Qt Creator 2.1), and it is a commercial option in mobile applications when Qt 4.7 is available for deployment in Symbian and Maemo/MeeGo devices."],"ns:common.document.source_uri":["<http://wp/en/28042943>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Qt Quick"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1q3sd00c_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}