{"ns:m.02m_kj":{"rdfs:label":["Message Parsing Interpreter"],"ns:common.topic.description":["The Message Parsing Interpreter is a Lisp-like programming language based on text replacement that is used on Fuzzball MUCK servers, starting with version 2.2fb5.00. It is generally considered easier to learn and use than MUF, and enjoys a large popularity among Fuzzball MUCK users.\\nMPI originally stood for \\\"My Personal Insanity\\\" — a temporary project name used by the programmer when it was first implemented during a 3-week coding binge. It was later backronymed to \\\"Message Parsing Interpreter\\\" to keep the acronym, yet sound more respectable.\\nWhen online, the command MPI CATEGORY provides a listing of the available MPI topics arranged by function. The most common use for MPI is for report generation and formatting text strings; however, it does support the creation of macros, conditional logic, and looping for a limited number of iterations."],"key:en":["message_parsing_interpreter"],"ns:common.topic.article":[{"ns:common.document.text":["The Message Parsing Interpreter (MPI for short, not to be confused with the Message Passing Interface) is a Lisp-like programming language based on text replacement that is used on Fuzzball MUCK servers, starting with version 2.2fb5.00. It is generally considered easier to learn and use than MUF, and enjoys a large popularity among Fuzzball MUCK users.\\nAmusingly, MPI originally stood for \\\"My Personal Insanity\\\" — a temporary project name used by the programmer when it was first implemented during a 3 week coding binge. It was later backronymed to \\\"Message Parsing Interpreter\\\" to keep the acronym, yet sound more respectable.\\nWhen online, the command MPI CATEGORY provides a listing of the available MPI topics arranged by function. The most common use for MPI is for report generation and formatting text strings, however it does support the creation of macros, conditional logic, and looping for a limited number of iterations.\\nMPI could be viewed as a form of markup language as instructions are encapsulated within bracket marks to differentiate them from regular text. The MPI command is specified first, followed by a colon, and then command arguments, separated by commas. If one of the"],"ns:common.document.source_uri":["<http://wp/en/539201>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Message Parsing Interpreter"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12592bgnc"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}