{"ns:m.039lgr":{"rdfs:label":["CHILL"],"ns:common.topic.description":["In computing, CHILL is a procedural programming language designed for use in telecommunication switches. The language is still used for legacy systems in some telecommunication companies and for signal box programming.\\nThe CHILL language is similar in size and complexity to the original Ada language. The first specification of the CHILL language was published in 1980, a few years before Ada.\\nITU provides a standard CHILL compiler. A free CHILL compiler was bundled with GCC up to version 2.95, however, was removed from later versions. An object-oriented version, called Object CHILL, was developed also.\\nITU is responsible for the CHILL standard, known as ITU-T Rec. Z.200. The equivalent ISO standard is ISO/IEC 9496:2003.. In late 1999 CCITT stopped maintaining the CHILL standard.\\nCHILL was used in systems of Alcatel System 12 and Siemens EWSD, for example."],"key:en":["chill"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["チル"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["In computing, CHILL (an acronym for CCITT High Level Language) is a procedural programming language designed for use in telecommunication switches (the hardware used inside telephone exchanges). The language is still used for legacy systems in some telecommunication companies and for signal box programming.\\nThe CHILL language is similar in size and complexity to the Ada language. The first specification of the CHILL language was published in 1980, a few years before Ada.\\nITU provides a standard CHILL compiler. A free CHILL compiler was bundled with GCC up to version 2.95, however, was removed from later versions. An object-oriented version, called Object CHILL, was developed also.\\nITU is responsible for the CHILL standard, known as ITU-T Rec. Z.200. The equivalent ISO standard is ISO/IEC 9496:2003. (The text of the two documents is the same). In late 1999 CCITT stopped maintaining the CHILL standard."],"ns:common.document.source_uri":["<http://wp/en/765313>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1980"],"ns:type.object.name":["CHILL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255p_dh2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.05xjv"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"]}}