{"ns:m.04093_t":{"ns:common.topic.description":["JAWS Scripting Language is a proprietary programming language that facilitates the interoperability of the JAWS for Windows screen reading program with practically any application–both proprietary and off-the-shelf. The JAWS Scripting Language, or JSL is a compiled language, allowing for source code protection. \\\"JAWS scripting\\\" commonly also cumulatively refers to customization of JAWS through use of its built-in, user-editable utilities or editing the configuration files directly, in combination with writing actual scripts. The scripting language is an API that exposes functionality including a combination of traditional JAWS scripting, MSAA Server direct scripting, and document object model scripting to ensure optimal performance of JAWS to end-users."],"rdfs:label":["JAWS Scripting Language"],"ns:common.topic.alias":["Jaws scripting language"],"key:en":["jaws_scripting_language"],"ns:common.topic.article":[{"ns:common.document.text":["JAWS Scripting Language is a proprietary programming language that facilitates the interoperability of the JAWS for Windows screen reading program with practically any application–both proprietary and off-the-shelf. The JAWS Scripting Language, or JSL is a compiled language, allowing for source code protection. \\\"JAWS scripting\\\" commonly also cumulatively refers to customization of JAWS through use of its built-in, user-editable utilities (called \\\"Managers\\\") or editing the configuration files directly, in combination with writing actual scripts. The scripting language is an API that exposes functionality including a combination of traditional JAWS scripting, MSAA Server direct scripting, and document object model scripting to ensure optimal performance of JAWS to end-users."],"ns:common.document.source_uri":["<http://wp/en/16873677>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["JAWS Scripting Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dcyrm_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}