{"ns:m.05nn80":{"rdfs:label":["Maya Embedded Language"],"ns:common.topic.description":["The Maya Embedded Language is a scripting language used to simplify tasks in Autodesk's 3D Graphics Software Maya. Most tasks that can be achieved through Maya's GUI can be achieved with MEL, as well as certain tasks that are not available from the GUI. MEL offers a method of speeding up complicated or repetitive tasks, as well as allowing users to redistribute a specific set of commands to others that may find it useful."],"key:base.ranker.rankerurlname":["maya-embedded-language$002F1548081"],"key:en":["maya_embedded_language"],"ns:common.topic.article":[{"ns:common.document.text":["The Maya Embedded Language (MEL) is a scripting language used to simplify tasks in Autodesk's 3D Graphics Software Maya. Most tasks that can be achieved through Maya's GUI can be achieved with MEL, as well as certain tasks that are not available from the GUI. MEL offers a method of speeding up complicated or repetitive tasks, as well as allowing users to redistribute a specific set of commands to others that may find it useful.\\nMEL is syntactically similar to Tcl and Perl. It provides some memory management and dynamic array-allocation, and offers direct access to functions specific to Maya. The majority of standard Maya commands are default MEL scripts, saved in the Maya Program Files directory.\\nMEL is fairly limited compared to mainstream scripting languages. It is not object oriented, and lacks advanced features such as associative arrays. Very few improvements have been made to it in recent years, and in Maya 8.5, Python was added to Maya as an alternative to MEL.\\nThe tools designed using MEL Scripts generally come under the following categories.\\nThis is an example of a script which copies a selected object through its path:\\nMaya also offers an expression language that is a"],"ns:common.document.source_uri":["<http://wp/en/1690201>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Maya Embedded Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257pmmxq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}