{"ns:m.0555r6":{"ns:common.topic.description":["Lucid is a dataflow programming language. It is designed to experiment with non-von Neumann programming models. It was designed by Bill Wadge and Ed Ashcroft and described in the book Lucid, the Dataflow Programming Language."],"rdfs:label":["Lucid"],"key:en":["lucid"],"ns:computer.programming_language.language_designers":["Edward A. Ashcroft"],"ns:common.topic.article":[{"ns:common.document.text":["Lucid is a dataflow programming language. It is designed to experiment with non-von Neumann programming models. It was designed by Bill Wadge and Ed Ashcroft and described in the book Lucid, the Dataflow Programming Language.\\nLucid uses a demand-driven model for data computation. Each statement can be understood as an equation defining a network of processors and communication lines between them through which data flows. Each variable is an infinite stream of values and every function is a filter or a transformer. Iteration is simulated by 'current' values and 'fby' (read as 'followed by') operator allowing composition of streams.\\nLucid is based on an algebra of histories, a history being an infinite sequence of data items. Operationally, a history can be thought of as a record of the changing values of a variable, history operations such as first and next can be understood in ways suggested by their names. Lucid was originally conceived as a kind of very disciplined mathematically pure single assignment language in which verification would be very much simplified. However, the dataflow interpretation has been very important in helping the direction in which Lucid has evolved.\\nIn"],"ns:common.document.source_uri":["<http://wp/en/1485589>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1976"],"ns:type.object.name":["Lucid"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12595vlk2"],"ns:computer.programming_language.influenced_by":["ns:m.01hxzg"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0fs5n"],"ns:computer.programming_language.language_paradigms":["ns:m.0445gc"]}}