{"ns:m.05s50p":{"rdfs:label":["PWB shell"],"ns:common.topic.description":["The PWB shell was an early Unix shell.\\nDistributed with some versions of Programmer's Workbench UNIX circa 1975-1977, it was a modified version of the Thompson shell with additional features to increase usability for programming, and was maintained by John Mashey and various others."],"key:en":["pwb_shell"],"ns:common.topic.article":[{"ns:common.document.text":["The PWB shell (also known as the Mashey shell) was an early Unix shell.\\nDistributed with some versions of Programmer's Workbench UNIX circa 1975-1977, it was a modified (and generally constrained to be upward-compatible) version of the Thompson shell with additional features to increase usability for programming, and was maintained by John Mashey and various others (Dick Haight, Alan Glasser).\\nAlthough it was soon superseded by the Bourne shell, several features introduced in the PWB shell remain in many later shells. The if and goto commands were made internal to the shell, and extended to allow if-then-else-endif, and switch and while constructs were introduced, as well as onintr to ignore interrupts or catch them to perform cleanup. Simple variables could be used, although their names were limited to one letter and some letters were reserved for special purposes, of which some are the precursors of the environment variables found in all Unix systems from Version 7 onward.\\nFor example, The $s variable was the ancestor of $HOME, used to avoid hard-coding pathnames. The $p variable was the ancestor of $PATH, which let users search for commands in their own choice of directories."],"ns:common.document.source_uri":["<http://wp/en/1737777>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PWB shell"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1259xs7t9"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}