{"ns:m.04b9q6":{"ns:common.topic.description":["Perl 6 is a member of the Perl family of programming languages. It is still in development as a specification from which several interpreter and compiler implementations are being written. It is introducing elements of many modern and historical languages. Perl 6 is intended to have many implementations. Compatibility with Perl 5 is not a goal, though a compatibility mode is part of the specification. The design process for Perl 6 began in 2000. A release candidate is expected in September 2015 and a final release by December.\\nDevelopment on Pugs, the first high-traction implementation, began in 2005, and today there are multiple Perl 6 implementation projects. Rakudo Perl is based on NQP and can use MoarVM or the Java Virtual Machine as a runtime environment, and releases a new version every month; in July 2010, the project released the first Rakudo Star distribution, a useful and usable collection of a Perl 6 implementation and related materials. Larry Wall maintains a reference grammar known as STD.pm6, written in Perl 6 and bootstrapped with Perl 5.\\nNiecza, another major Perl 6 implementation, focuses on optimization and efficient implementation research."],"rdfs:label":["Perl 6"],"key:en":["perl_6"],"ns:common.topic.topical_webpage":["<http://dev.perl.org/perl6/>"],"ns:common.topic.official_website":["<http://perl6.org/>"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["パールシックス"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bk95vc"],"ns:common.webpage.uri":["<http://perl6.org/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.04b9q6"]}],"ns:common.topic.article":[{"ns:common.document.text":["Perl 6 is a major revision to the Perl programming language. It is still in development, as a specification from which several interpreter and compiler implementations are being written. It is introducing elements of many modern and historical languages. Perl 6 is intended to have many implementations. Backward compatibility with earlier versions of Perl is not a goal, though a compatibility mode is part of the specification. The design process for Perl 6 began in 2000.\\nDevelopment on Pugs, the first high-traction implementation, began in 2005, and today there are multiple Perl 6 implementation projects. Rakudo Perl is based on Parrot and NQP (Not Quite Perl), and releases a new version every month; In July 2010, the project released the first Rakudo Star distribution, a useful and usable collection of a Perl 6 implementation and related materials. Larry Wall maintains a reference grammar known as STD.pm6 , written in Perl 6 and bootstrapped with Perl 5.\\nNiecza, another major Perl 6 implementation, focuses on optimization and efficient implementation research. It targets the Common Language Infrastructure. \\nIn Perl 6, we decided it would be better to fix the language than fix the"],"ns:common.document.source_uri":["<http://wp/en/1146638>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Larry Wall"],"ns:computer.programming_language.introduced":["2000"],"ns:type.object.name":["Perl 6"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12575g9qd"],"ns:computer.programming_language.language_paradigms":["ns:m.01h1_2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.070d2"]}}