{"ns:m.057fd":{"rdfs:label":["Modula"],"ns:common.topic.description":["The Modula programming language is a descendent of the Pascal programming language. It was developed in Switzerland in the 1970s by Niklaus Wirth, the same person who designed Pascal. The main innovation of Modula over Pascal is a module system, used for grouping sets of related declarations into program units; hence the name Modula. The language is defined in a report by Wirth called Modula. A language for modular multiprogramming published 1976.\\nModula was first implemented by Niklaus Wirth himself on a PDP-11. Very soon other implementations followed, most important the University of York Modula compiler and a compiler developed at Philips Laboratories named PL Modula, which generated code for the LSI-11 microprocessor.\\nThe development of Modula was discontinued soon after its publication; Wirth then concentrated his efforts on Modula's successors: Modula-2 and Oberon."],"key:en":["modula"],"ns:award.award_winning_work.awards_won":[{"ns:award.award_honor.year":["1984"],"ns:award.award_honor.notes_description":["For developing a sequence of innovative computer languages, EULER, ALGOL-W, MODULA and PASCAL."],"ns:award.award_honor.ceremony":["ns:m.010nzvmq"],"ns:award.award_honor.honored_for":["ns:m.057fd"],"ns:award.award_honor.award":["ns:m.07n52"],"rdf:type":["ns:award.award_honor"],"ns:freebase.valuenotation.is_reviewed":["ns:m.0bzy7yg"],"ns:award.award_honor.award_winner":["ns:m.05fgl"]}],"ns:common.topic.article":[{"ns:common.document.text":["The Modula programming language is a descendent of the Pascal programming language. It was developed in Switzerland in the late 1970s by Niklaus Wirth, the same person who designed Pascal. The main innovation of Modula over Pascal is a module system, used for grouping sets of related declarations into program units; hence the name Modula.\\nModula was never released, and its development was discontinued after its publication; Wirth then concentrated his efforts on Modula's successors: Modula-2, Oberon, Modula-2+ and Modula-3. Although Wirth never released Modula, a compiler from the University of York, UK, was released."],"ns:common.document.source_uri":["<http://wp/en/20824>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Niklaus Wirth"],"ns:type.object.name":["Modula"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258vfls3"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0kzb_"],"ns:computer.programming_language.influenced_by":["ns:m.05y49"],"ns:computer.programming_language.language_paradigms":["ns:m.0fzlnq"]}}