{"ns:m.03nnsbc":{"ns:common.topic.description":["ParadisEO is a white-box object-oriented framework dedicated to the flexible design of metaheuristics. This template-based, ANSI-C++ compliant computation library is portable across both Windows system and sequential platforms. ParadisEO is distributed under the CeCill license and can be used under several environments."],"rdfs:label":["Paradiseo"],"key:en":["paradiseo"],"ns:common.topic.topical_webpage":["<http://paradiseo.gforge.inria.fr/>"],"ns:common.topic.official_website":["<http://www.paradiseo.gforge.inria.fr>"],"ns:common.topic.article":[{"ns:common.document.text":["ParadisEO is a white-box object-oriented framework dedicated to the flexible design of metaheuristics. This template-based, ANSI-C++ compliant computation library is portable across both Windows system and sequential platforms (Unix, Linux, Mac OS X, etc.). ParadisEO is distributed under the CeCill license and can be used under several environments.\\nParadisEO is a white-box object-oriented framework dedicated to the reusable design of metaheuristics, hybrid metaheuristics, and parallel and distributed metaheuristics. ParadisEO provides a broad range of features including evolutionary algorithms, local searches, Particle swarm optimization, the most common parallel and distributed models and hybridization mechanisms, etc. This high content and utility encourages its use at International level. ParadisEO is based on a clear conceptual separation of the solution methods from the problems they are intended to solve. This separation confers to the user a maximum code and design reuse. Furthermore, the fine-grained nature of the classes provided by the framework allow a higher flexibility compared to other frameworks. ParadisEO is of the rare frameworks that provide the most common"],"ns:common.document.source_uri":["<http://wp/en/15654857>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://paradiseo.gforge.inria.fr>"],"ns:common.webpage.category":["ns:m.08mbj32"],"ns:common.webpage.resource":["ns:m.0bk296t"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.03nnsbc"]}],"ns:type.object.name":["Paradiseo"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fy1q28"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}