{"ns:m.028b0tb":{"rdfs:label":["ARC Macro Language"],"ns:common.topic.description":["The ARC Macro Language is a proprietary high-level algorithmic language for generating applications in ArcInfo. It was designed by ESRI in 1986 specifically for their command line-driven ARC/INFO geographical information system. AML's syntax was based on CPL because the majority of ARC/INFO installations at that time ran on Prime computers. The macro language features include the ability to create onscreen menus, use and assign variables, control statement execution, and get and use map or page unit coordinates.\\nAlthough the language is still supported by ESRI in modern ArcInfo Workstation environments, the language has been superseded by the geoprocessing framework, which is part of the ArcGIS suite and allows programming access using ArcObjects through VBA or Python."],"key:en":["arc_macro_language"],"ns:common.topic.article":[{"ns:common.document.text":["The ARC Macro Language (AML) is a proprietary high-level algorithmic language for generating applications in ArcInfo. It was designed by ESRI in 1986 specifically for their command line-driven ARC/INFO geographical information system. AML's syntax was based on CPL (the shell language of the PRIMOS operating system) because the majority of ARC/INFO installations at that time ran on Prime computers. The macro language features include the ability to create onscreen menus, use and assign variables, control statement execution, and get and use map or page unit coordinates.\\nAlthough the language is still supported by ESRI in modern ArcInfo Workstation environments, the language has been superseded by the geoprocessing framework, which is part of the ArcGIS suite and allows programming access using ArcObjects through VBA or Python."],"ns:common.document.source_uri":["<http://wp/en/9466502>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["ARC Macro Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255z_rlq"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}