{"ns:m.03189t":{"ns:common.topic.alias":["Shakespeare Programming Language"],"rdfs:label":["Shakespeare"],"ns:common.topic.description":["The Shakespeare Programming Language is an esoteric programming language designed by Jon Åslund and Karl Hasselström. Like the Chef programming language, it is designed to make programs appear to be something other than programs; in this case, Shakespearean plays.\\nA character list in the beginning of the program declares a number of stacks, naturally with names like \\\"Romeo\\\" and \\\"Juliet\\\". These characters enter into dialogue with each other in which they manipulate each other's topmost values, push and pop each other, and do I/O. The characters can also ask each other questions which behave as conditional statements. On the whole, the programming model is very similar to assembly language, but more than several amounts more verbose."],"ns:common.topic.article":[{"ns:common.document.text":["The Shakespeare Programming Language (SPL) is an esoteric programming language designed by Jon Åslund and Karl Hasselström. Like the Chef programming language, it is designed to make programs appear to be something other than programs; in this case, Shakespearean plays.\\nA character list in the beginning of the program declares a number of stacks, naturally with names like \\\"Romeo\\\" and \\\"Juliet\\\". These characters enter into dialogue with each other in which they manipulate each other's topmost values, push and pop each other, and do I/O. The characters can also ask each other questions which behave as conditional statements. On the whole, the programming model is very similar to assembly language, but more than an order of magnitude more verbose.\\nThe first line in a Shakespeare program is called the 'title'. The compiler considers anything from the first line to the first period to be a comment.\\nThis is the section where variables are declared. Each variable can hold a signed integer value and is of the following form:\\nWhere Name is the name of the variable and Description is ignored by the compiler.\\nEach variable name must be the name of a character from a Shakespeare play.\\nA piece"],"ns:common.document.source_uri":["<http://wp/en/667776>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["Karl Hasselström"],"ns:type.object.name":["Shakespeare"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255jhxrx"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0p8g"]}}