{"ns:m.07n77":{"ns:common.topic.description":["Turing is a Pascal-like programming language developed in 1982 by Ric Holt and James Cordy, then of University of Toronto, Canada. Turing is a descendant of Euclid, Pascal and SP/k that features a clean syntax and precise machine-independent semantics."],"rdfs:label":["Turing"],"key:en":["turing_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Turing is a Pascal-like programming language developed in 1982 by Ric Holt and James Cordy, then of University of Toronto, Canada. Turing is a descendant of Euclid, Pascal and SP/k that features a clean syntax and precise machine-independent semantics.\\nNamed after British computer scientist Alan Turing, Turing is used primarily as a teaching language at the high school and university level. Two other versions exist, Object-Oriented Turing and Turing Plus, a systems programming variant. In September 2001, \\\"Object Oriented Turing\\\" was renamed \\\"Turing\\\" and the original Turing was renamed \\\"Classic Turing\\\". Turing is no longer supported by Holt Software Associates in Toronto. Currently, Microsoft Windows is the only supported platform. Turing was, at one point, widely used in high schools in Ontario as an introduction to programming.\\nOn November 28, 2007, Turing, which was previously a commercial programming language, became freeware, available to download from the developer's website free of charge for personal, commercial, and educational use.\\nThe makers of Turing, Holt Software Associates, have since ceased operations. It is unclear whether Turing is still in development, but there"],"ns:common.document.source_uri":["<http://wp/en/31105>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1982"],"ns:type.object.name":["Turing"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12579fh3q"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.042v27"],"ns:computer.programming_language.influenced":["ns:m.042v27"],"ns:computer.programming_language.influenced_by":["ns:m.05y49"]}}