{"ns:m.02f_d6":{"key:authority.google.google_plus_page":["101152450218454384328"],"ns:common.topic.description":["JSyn is a free API for developing interactive sound applications in Java. Developed by Phil Burk and others, it is distributed through Burk's company, Mobileer Inc. JSyn has a flexible, unit generator-based synthesis and DSP architecture that allows developers to create synthesizers, audio playback routines, and effects processing algorithms within a Java framework that allows for easy integration with other Java routines. A plugin is available for web browsers to run JSyn-enabled applets distributed over the world wide web.\\nAlthough fundamentally a synthesis language, JSyn has a number of powerful extensions and ancillary libraries, including JMSL and JScore, which adds a significantly higher level of musical informatics to the package than would normally be supplied with a set of synthesis routines. Wire, a graphical editor for JSyn routines, also allows developers to create DSP chains using a simple GUI that gives the API some of the ease of use of programs such as Max/MSP."],"rdfs:label":["JSyn"],"key:en":["jsyn"],"ns:common.topic.social_media_presence":["<http://plus.google.com/101152450218454384328>"],"ns:common.topic.article":[{"ns:common.document.text":["JSyn (\\\"Java Synthesis\\\") is a free API for developing interactive sound applications in Java. Developed by Phil Burk and others, it is distributed through Burk's company, SoftSynth. JSyn has a flexible, unit generator-based synthesis and DSP architecture that allows developers to create synthesizers, audio playback routines, and effects processing algorithms within a Java framework that allows for easy integration with other Java routines (e.g. graphics, user interface, etc.). A plugin is available for web browsers to run JSyn-enabled applets distributed over the world wide web.\\nAlthough fundamentally a synthesis language (imitative of if not directly inspired by Csound and other MUSIC-N languages), JSyn has a number of powerful extensions and ancillary libraries, including JMSL (a Java update to the HMSL music specification language) and JScore (a staff notation editor and library), which adds a significantly higher level of musical informatics to the package than would normally be supplied with a set of synthesis routines. Wire, a graphical editor for JSyn routines, also allows developers to create DSP chains using a simple GUI that gives the API some of the ease of use of"],"ns:common.document.source_uri":["<http://wp/en/483726>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["JSyn"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cb6wm4"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}