{"ns:m.02_cw3":{"ns:common.topic.description":["TI BASIC was a dialect of BASIC for the Texas Instruments TI-99/4A Home Computer, developed under contract to Microsoft by Bob Wallace and Bob Greenberg. A version supporting compiled code was also used as a commercial development language for the TI-990 range of minicomputers.\\nTI BASIC was built into the 99/4 and 99/4A, and was remarkably easy to learn. Users could access functions through this simple language that on other computers would only be available to those versed in the machines' assembly language code. Text, full screen graphics, logic operations, and recording to tape could all be accomplished using TI BASIC. TI also produced an Extended BASIC cartridge that greatly enhanced the functionality accessible to BASIC users."],"rdfs:label":["TI BASIC"],"key:en":["ti_basic"],"ns:common.topic.article":[{"ns:common.document.text":["TI BASIC was a dialect of BASIC for the Texas Instruments TI-99/4A Home Computer (1981), developed under contract to Microsoft by Bob Wallace and Bob Greenberg. A version supporting compiled code was also used as a commercial development language for the TI-990 range of minicomputers.\\nTI BASIC was built into the 99/4 and 99/4A, and was remarkably easy to learn. Users could access functions through this simple language that on other computers would only be available to those versed in the machines' assembly language code. Text, full screen graphics, logic operations, and recording to tape (or any other file system - diskettes, RS-232 interface, RAM disks) could all be accomplished using TI BASIC. TI also produced an Extended BASIC cartridge that greatly enhanced the functionality accessible to BASIC users.\\nThe statements of TI BASIC are CALL, CLOSE, DATA, DEF, DIM, END, FOR..TO..STEP, GOSUB, GOTO, IF..THEN..ELSE, INPUT, LET, NEXT, ON..GOSUB, ON..GOTO, OPEN, OPTION BASE, PRINT, RANDOMIZE, READ, REM, RESTORE, RETURN, STOP\\nEvery line of TI BASIC can only contain one statement. The possibility to put several statements in a line with :: and also the necessary PEEK and LOAD calls to use"],"ns:common.document.source_uri":["<http://wp/en/648165>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1981"],"ns:type.object.name":["TI BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fwcmbr"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}