{"ns:m.07gjz6":{"ns:common.topic.description":["Tcl/Java is a project to bridge Tcl and Java. It consists of two distinct packages, Tcl Blend and Jacl."],"rdfs:label":["Tcl/Java"],"key:en":["tcl_java"],"ns:common.topic.official_website":["<http://sourceforge.net/projects/tcljava>"],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bjfpw1"],"ns:common.webpage.uri":["<http://sourceforge.net/projects/tcljava>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.07gjz6"]}],"ns:common.topic.article":[{"ns:common.document.text":["Tcl/Java is a project to bridge Tcl and Java. It consists of two distinct packages, Tcl Blend and Jacl.\\nTcl Blend is a Tcl extension that makes use of JNI to facilitate communication between a Java interpreter and a Tcl interpreter. Tcl Blend is typically used to load a Java interpreter into an existing Tcl process, so that functionality implemented in Java can be accessed in a Tcl script. For example, one could allocate a Java object in a Tcl script and interactively invoke Java methods on the object.\\nOne can also load Tcl Blend and Tcl into a Java process, which adds scripting functionality to an existing Java application. Because Tcl Blend is a normal Tcl extension, one can use it with other popular Tcl extensions like Tk, Expect, and Itcl.\\nJacl is a self-contained implementation of a Tcl interpreter, written entirely in Java. Jacl also includes features that facilitate communication between a Java interpreter and a Tcl interpreter. Jacl is typically used to incorporate Tcl scripting functionality into an existing Java application, without dealing with the complexities of native code that come with loading Tcl Blend into a Java process.\\nJTcl, a fork of Jacl, was released on"],"ns:common.document.source_uri":["<http://wp/en/2474113>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Tcl/Java"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257jml62"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}