{"ns:m.0b1wj0":{"rdfs:label":["JavaScript syntax"],"ns:common.topic.description":["The syntax of JavaScript is the set of rules that define a correctly structured JavaScript program.\\nThe examples below make use of the alert function for standard text output. The JavaScript standard library lacks an official standard text output function. However, given that JavaScript is mainly used for client-side scripting within modern Web browsers, and that almost all Web browsers provide the alert function, alert is used in the examples."],"key:en":["javascript_syntax"],"ns:common.topic.article":[{"ns:common.document.text":["The syntax of JavaScript is the set of rules that define a correctly structured JavaScript program.\\nThe examples below make use of the alert function for standard text output. The JavaScript standard library lacks an official standard text output function. However, given that JavaScript is mainly used for client-side scripting within modern web browsers, and that almost all web browsers provide the alert function, alert is used in the examples.\\nBrendan Eich summarized the ancestry of the syntax in the first paragraph of the JavaScript 1.1 specification as follows:\\nJavaScript is case sensitive. It is common to start the name of a constructor with a capitalised letter, and the name of a function or variable with a lower-case letter.\\nSpaces, tabs and newlines used outside of string constants are called whitespace. Unlike C, whitespace in JavaScript source can directly impact semantics. Because of a technique called \\\"semicolon insertion\\\", some statements that are well formed when a newline is parsed will be considered complete (as if a semicolon were inserted just prior to the newline). Programmers are advised to supply statement-terminating semicolons explicitly because it may lessen"],"ns:common.document.source_uri":["<http://wp/en/3824186>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["JavaScript syntax"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255cn54y"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0q2c"]}}