{"ns:m.09kns0":{"ns:common.topic.description":["VisSim is a visual block diagram language for simulation of dynamical systems and model based design of embedded systems. It is developed by Visual Solutions of Westford, Massachusetts. It uses a graphical data flow paradigm to implement dynamic systems based on differential equations. Version 8 adds interactive UML OMG 2 compliant state chart graphs that are placed in VisSim diagrams. This allows easy modeling of state based systems like startup sequencing of process plants or serial protocol decoding."],"rdfs:label":["VisSim"],"key:en":["vissim"],"ns:common.topic.official_website":["<http://www.vissim.com>"],"ns:common.topic.webpage":[{"ns:common.webpage.resource":["ns:m.0bk9_zd"],"ns:common.webpage.uri":["<http://www.vissim.com>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.09kns0"]}],"ns:common.topic.article":[{"ns:common.document.text":["VisSim is a visual block diagram language for simulation of dynamical systems and model based design of embedded systems. It is developed by Visual Solutions of Westford, Massachusetts. It uses a graphical data flow paradigm to implement dynamic systems based on differential equations. Version 8 adds interactive UML 2 compliant state chart graphs that are placed in VisSim diagrams. This allows easy modeling of state based systems like startup sequencing of process plants or serial protocol decoding.\\nVisSim is widely used in control system design and digital signal processing for multidomain simulation and design. It includes blocks for arithmetic, Boolean, and transcendental functions, as well as digital filters, transfer functions, numerical integration and interactive plotting. The most commonly modeled systems are aeronautical, biological/medical, digital power, electric motor, electrical, hydraulic, mechanical, process, thermal/HVAC and econometric.\\nAccredited educational institutions are allowed to site license VisSim v3.0 at no cost. The latest versions of VisSim and add-ons are also available to students and academic institutions at greatly reduced pricing.\\nA read-only"],"ns:common.document.source_uri":["<http://wp/en/3545503>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1989"],"ns:type.object.name":["VisSim"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125blf0mn"],"ns:computer.programming_language.influenced_by":["ns:m.01t6b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.02hrsx"]}}