{"ns:m.025s4vp":{"ns:common.topic.description":["Quantum programming is a set of computer programming languages that allow the expression of quantum algorithms using high-level constructs. The point of quantum languages is not so much to provide a tool for programmers, but to provide tools for researchers to understand better how quantum computation works and how to reason formally about quantum algorithms.\\nOne can single out two main groups of quantum programming languages: imperative quantum programming languages and functional quantum programming languages.\\nThe most prominent representatives of the first group are QCL and LanQ.\\nEfforts are underway to develop functional programming languages for quantum computing. Examples include Selinger's QPL, and the Haskell-like language QML by Altenkirch and Grattage. Higher-order quantum programming languages, based on lambda calculus, have been proposed by van Tonder, Selinger and Valiron and by Arrighi and Dowek.\\nSimon Gay's Quantum Programming Languages Survey provides information on the state of research and a comprehensive bibliography of resources about quantum programming as of 2007."],"rdfs:label":["Quantum programming"],"key:en":["quantum_programming"],"ns:common.topic.article":[{"ns:common.document.text":["Quantum programming is a set of computer programming languages that allow the expression of quantum algorithms using high-level constructs. The point of quantum languages is not so much to provide a tool for programmers, but to provide tools for researchers to understand better how quantum computation works and how to formally reason about quantum algorithms.\\nEfforts are underway to develop functional programming languages for quantum computing. Examples include Selinger's QPL , and the Haskell-like language QML by Altenkirch and Grattage . Higher-order quantum programming languages, based on lambda calculus, have been proposed by van Tonder , Selinger and Valiron  and by Arrighi and Dowek.\\nSimon Gay's Quantum Programming Languages Survey has more information on the current state of research and a comprehensive bibliography of resources.\\nQuantum pseudocode proposed by E. Knill is the first formalised language for description of quantum algorithms was introduced and, moreover, it was tightly connected with a model of quantum machine called Quantum Random Access Machine (QRAM).\\nQCL (Quantum Computation Language) is one of the first implemented quantum programming languages. Its"],"ns:common.document.source_uri":["<http://wp/en/2137644>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Quantum programming"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125d31vr2"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}