{"ns:m.01k8xl":{"ns:common.topic.description":["Revolution is a software development environment/multimedia authoring software in the tradition of HyperCard and is based on the MetaCard engine. Its primary focus is on providing a relatively accessible development tool set and scripting language that enable the creation of software programs that run across multiple platforms with little or no code modifications. The Integrated Development Environment included with Revolution is built partly on the models created by Bill Atkinson and the original HyperCard team at Apple and subsequently followed by many other software development products, such as Microsoft's Visual Basic. Revolution includes an English language-like scripting language called Transcript, a full programming language superset of the HyperCard's scripting language, HyperTalk.\\nThe higher-grade versions, allow applications to be compiled to run on more than one platform, including Macintosh, Windows and Unix-like systems including Linux. It can also import HyperCard stacks, which require little or no modification unless they use external functions, which generally do not work in Revolution."],"rdfs:label":["Revolution"],"ns:common.topic.article":[{"ns:common.document.text":["Revolution is a software development environment/multimedia authoring software in the tradition of HyperCard and is based on the MetaCard engine. Its primary focus is on providing a relatively accessible development tool set and scripting language that enable the creation of software programs that run across multiple platforms with little or no code modificaitons. The Integrated Development Environment (IDE) included with Revolution is built partly on the models created by Bill Atkinson and the original HyperCard team at Apple and subsequently followed by many other software development products, such as Microsoft's Visual Basic. Revolution includes an English language-like scripting language called Transcript, a full programming language superset of the HyperCard's scripting language, HyperTalk.\\nThe higher-grade versions (see Versions, below), allow applications to be compiled to run on more than one platform, including Macintosh (Classic or Mac OS 9, and Mac OS X), Windows and Unix-like systems including Linux. It can also import HyperCard stacks, which require little or no modification unless they use external functions, which generally do not work in Revolution.\\nRevolution is"],"ns:common.document.source_uri":["<http://wp/en/243402>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Revolution"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fxgchk"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}