{"ns:m.033jmv":{"rdfs:label":["Joy"],"ns:common.topic.description":["The Joy programming language in computer science is a purely functional programming language that was produced by Manfred von Thun of La Trobe University in Melbourne, Australia. Joy is based on composition of functions rather than lambda calculus. It has turned out to have many similarities to Forth, due not to design but to a sort of parallel evolution and convergence. It was also inspired by the function-level programming style of Backus's FP."],"key:en":["joy_programming_language"],"ns:computer.programming_language.language_designers":["Manfred von Thun"],"ns:common.topic.article":[{"ns:common.document.text":["The Joy programming language in computer science is a purely functional programming language that was produced by Manfred von Thun of La Trobe University in Melbourne, Australia. Joy is based on composition of functions rather than lambda calculus. It has turned out to have many similarities to Forth, due not to design but to a sort of parallel evolution and convergence.\\nJoy is unusual (except for function-level programming languages and some esoteric ones, such as unlambda) in its lack of a lambda operator, and therefore lack of formal parameters. To illustrate this with a common example, here is how the square function might be defined in an imperative programming language (C):\\nThe variable x is a formal parameter which is replaced by the actual value to be squared when the function is called. In a functional language (Scheme) the same function would be defined:\\nThis is different in many ways, but it still uses the formal parameter x in the same way. In Joy the square function is defined:\\nIn Joy, everything is a function that takes a stack as an argument and returns a stack as a result. For instance, the numeral '5' does not represent an integer constant, but instead a short"],"ns:common.document.source_uri":["<http://wp/en/696166>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["2001"],"ns:type.object.name":["Joy"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258953zx"],"ns:computer.programming_language.language_paradigms":["ns:m.03p3g9"],"ns:computer.programming_language.influenced_by":["ns:m.06zrb"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.03m7hp"]}}