{"ns:m.02zwml":{"ns:common.topic.description":["Ratfiv is an enhanced version of the Ratfor programming language, a preprocessor for Fortran designed to give it C-like capabilities. Fortran was widely used for scientific programming but had very basic control-flow primitives and no \\\"macro\\\" facility which limited its expressiveness.\\nThe name of the language is a pun.\\nRatfiv was developed by Bill Wood at the Institute for Cancer Research, Philadelphia, PA in the early 1980s and released on several DECUS SIG tapes. It is based on the original Ratfor by B. Kernighan and P. J. Plauger, with rewrites and enhancements by David Hanson and friends, Joe Sventek and Debbie Scherrer.\\nRatfiv V2.1 was distributed on the DECUS RSX82a SIG tape."],"rdfs:label":["Ratfiv"],"key:en":["ratfiv"],"ns:common.topic.article":[{"ns:common.document.text":["Ratfiv is an enhanced version of the Ratfor programming language, a preprocessor for Fortran designed to give it C-like capabilities. Fortran was widely used for scientific programming but had very basic control-flow primitives (\\\"do\\\" and \\\"goto\\\") and no \\\"macro\\\" facility which limited its expressiveness.\\nThe name of the language is a pun (Ratfor (RATional FORtran) -> \\\"Rat Four\\\" -> \\\"Rat Five\\\" -> RatFiv).\\nRatfiv was developed by Bill Wood at the Institute for Cancer Research, Philadelphia, PA in the early 1980s and released on several DECUS (Digital Equipment Users Group) SIG (Special Interest Group) tapes. It is based on the original Ratfor by B. Kernighan and P. J. Plauger, with rewrites and enhancements by David Hanson and friends (U. of Arizona), Joe Sventek and Debbie Scherrer (Lawrence Berkeley National Laboratory).\\nRatfiv V2.1 was distributed on the DECUS RSX82a SIG tape."],"ns:common.document.source_uri":["<http://wp/en/642890>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Ratfiv"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257bh218"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}