{"ns:m.0gdxqx":{"ns:common.topic.description":["Speedcoding or Speedcode was the first high order or high-level language created for an IBM computer. The language was developed by John Backus in 1953 for the IBM 701 to support computation with floating point numbers. Here high level means symbolic and aiming for natural language expressivity as a goal as opposed to machine or hardware instruction oriented coding.\\nThe idea arose from the difficulty of programming the IBM SSEC machine when Backus was hired to calculate astronomical positions in early 1950. The speedcoding system was an interpreter and focused on ease of use at the expense of system resources. It provided pseudo-instructions for common mathematical functions: logarithms, exponentiation, and trigonometric operations. The resident software analyzed pseudo-instructions one by one and called the appropriate subroutine. Speedcoding was also the first implementation of decimal input/output operations. Although it substantially reduced the effort of writing many jobs, the running time of a program that was written with the help of Speedcoding was usually ten to twenty times that of machine code."],"rdfs:label":["Speedcoding"],"key:en":["speedcoding"],"ns:computer.programming_language.developers":["IBM"],"ns:common.topic.article":[{"ns:common.document.text":["Speedcoding or Speedcode was the first higher-level language created for an IBM computer. The language was developed by John Backus in 1953 for the IBM 701 to support computation with floating point numbers.\\nThe idea arose from the difficulty of programming the IBM SSEC machine when Backus was hired to calculate astronomical positions in early 1950. The speedcoding system was an interpreter and focused on ease of use at the expense of system resources. It provided pseudo-instructions for common mathematical functions: logarithms, exponentiation, and trigonometric operations. The resident software analyzed pseudo-instructions one by one and called the appropriate subroutine. Speedcoding was also the first implementation of decimal input/output operations. Although it substantially reduced the effort of writing many jobs, the running time of a program that was written with the help of Speedcoding was usually ten to twenty times that of machine code. The interpreter took 310 memory words, about 30% of the memory available on a 701."],"ns:common.document.source_uri":["<http://wp/en/6616312>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.language_designers":["John Backus"],"ns:computer.programming_language.introduced":["1953"],"ns:type.object.name":["Speedcoding"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255yhqk_"],"ns:computer.programming_language.influenced":["ns:m.05xjv"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.0qjrr"],"ns:computer.programming_language.influenced_by":["ns:m.0p8g"]}}