{"ns:m.0dbqww":{"rdfs:label":["PAL"],"ns:common.topic.description":["PAL, the Pedagogic Algorithmic Language, is a programming language developed at the Massachusetts Institute of Technology in around 1967 to help teach programming language semantics and design. It is a \\\"direct descendent\\\" of ISWIM and owes much of its philosophy to Christopher Strachey.\\nThe initial implementation of PAL, in Lisp, was written by Peter Landin and James H. Morris, Jr. It was later redesigned by Martin Richards, Thomas J. Barkalow, Arthur Evans, Jr., Robert M. Graham, James Morris, and John Wozencraft. It was implemented by Richards and Barkalow in BCPL as an intermediate-code interpreter and ran on the System/360; this was called PAL/360."],"key:en":["rpal"],"ns:common.topic.article":[{"ns:common.document.text":["RPAL (an acronym for Right-reference Pedagogic Algorithmic Language) is a functional programming language related to the ML programming language. It is a subset of PAL, a language invented by Arthur Evans, Jr. and John Wozencraft in the early 1970s at MIT for teaching programming language construction.\\nThis language is used almost exclusively by Dr. Manuel Bermúdez of the Computer Science department at the University of Florida as a means of teaching the construction of programming languages and encouraging students to shift paradigms from the imperative model to the functional model. Programs in this language can only be made up of a single expression, because the language does not offer a sequencing operator. The other notable operator that the language is missing is an assignment operator. The only way to change a variable is to create a new binding for it. This binding is permanent, and cannot be changed. The same name, however, may be rebound in a nested scope.\\nThe following links are the specification of the language as presented by Dr. Bermúdez:"],"ns:common.document.source_uri":["<http://wp/en/5268150>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255d_yc0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}