{"ns:m.04d5t6":{"ns:common.topic.description":["FOCAL is an interpreted programming language resembling JOSS. The name is an acronym for Formulating On-Line Calculations in Algebraic Language.\\nLargely the creation of Richard Merrill, FOCAL was initially written for and had its largest impact on the Digital Equipment Corporation's PDP-8 computers. Merrill wrote the original and classic FOCAL-69 interpreters for the PDP-8. Digital itself described FOCAL as \\\"a JOSS-like language.\\\"\\nLike early versions of BASIC, FOCAL was a complete programming environment in itself, requiring no operating system. As in MUMPS, most commands could be, and in practice were, abbreviated to a single letter of the alphabet. Creative choices of words were used to make each command uniquely defined by its leading character. Digital made available several European-language versions in which the command words were translated into the target language."],"rdfs:label":["FOCAL"],"key:en":["focal_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["FOCAL is an interpreted programming language resembling JOSS. Its name is an abbreviation of FOrmula CALculator.\\nLargely the creation of Richard Merrill, FOCAL was initially written for and had its largest impact on the Digital Equipment Corporation's (DEC's) PDP-8 computers. Merrill wrote the original (1968) and classic FOCAL-69 interpreters for the PDP-8. Digital itself described FOCAL as \\\"a JOSS-like language.\\\"\\nLike early versions of BASIC, FOCAL was a complete programming environment in itself, requiring no operating system. As in MUMPS, most commands could be, and in practice were, abbreviated to a single letter of the alphabet. Creative choices of words were used to make each command uniquely defined by its leading character. Digital made available several European-language versions in which the command words were translated into the target language.\\nFOCAL ran on very low-end PDP-8 systems, even systems with only 4K words of memory and lacking mass storage. The FOCAL interpreter was written in very tight assembly language and typically used only 3K 12-bit words, leaving a somewhat limiting 1K words to hold the user program, and variables.\\nIf the system was upgraded by adding"],"ns:common.document.source_uri":["<http://wp/en/1170592>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FOCAL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bnl6yd"],"ns:computer.programming_language.influenced_by":["ns:m.011k8l"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}