{"ns:m.03wfgb":{"rdfs:label":["POP-2"],"ns:common.topic.description":["POP-2, often referred to as POP2 was a programming language developed around 1970 from the earlier language POP-1 by Robin Popplestone and Rod Burstall at the University of Edinburgh. It drew roots from many sources: the languages LISP and ALGOL 60, and theoretical ideas from Landin. It used an incremental compiler, which gave it some of the flexibility of an interpreted language, including allowing new function definitions at run time and modification of function definitions while a program was running, without the overhead of an interpreted language."],"key:en":["pop-2"],"ns:common.topic.article":[{"ns:common.document.text":["POP-2, often referred to as POP2 was a programming language developed around 1970 from the earlier language POP-1 (originally named COWSEL) by Robin Popplestone and Rod Burstall at the University of Edinburgh. It drew roots from many sources: the languages LISP and ALGOL 60, and theoretical ideas from Landin. It used an incremental compiler, which gave it some of the flexibility of an interpreted language, including allowing new function definitions at run time and modification of function definitions while a program was running (both of which are features of dynamic compilation), without the overhead of an interpreted language. It has been described as 'The first true functional language' at HOPL, the History of Programming Languages web site.\\nPOP-2's syntax was Algol-like, except that assignments were the other way round: instead of writing\\none wrote\\nThe reason for this was that the language had explicit notion of an operand stack; thus, the previous assignment could be written as two separate statements:\\nwhich evaluated the value 3 and left it on the stack, and\\nwhich popped the top value off the stack and assigned it to the variable 'a'. Similarly, the function call\\ncould be"],"ns:common.document.source_uri":["<http://wp/en/981616>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["POP-2"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258s88bj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0nd8d"]}}