{"ns:m.0272tx2":{"rdfs:label":["VistaSmalltalk"],"ns:common.topic.description":["VistaSmalltalk, or Vistascript, is a Microsoft Vista scripting Internet Explorer web development environment based on Smalltalk for the Microsoft .NET framework using XAML. While the name implies it is only an implementation of Smalltalk, Vista Smalltalk also includes a Lisp language engine which can use the Smalltalk libraries.\\nVista Smalltalk can be opened in IE7 either by clicking on the link at the Vistascript.net home page or by downloading the code and executing vst.exe within its directory or with its directory set in the PATH for Windows XP or Windows Vista.\\nNewer versions of Vista Smalltalk can also be run on top of the Adobe Flash. This by technical novelty- Vista Smalltalk is using the Flash runtime instead of a traditional Smalltalk virtual machine, something which hasn't been done before. This use of Flash for Vista Smalltalk's runtime means that Vista Smalltalk can now be run on Mac OS X and Linux, where the original Vista Smalltalk was constrained to Windows due to its use of .NET.\\nOnce the browser pane is visible, a right-click on the background makes available a typical Smalltalk workspace, transcript or class browser."],"key:en":["vistasmalltalk"],"ns:common.topic.article":[{"ns:common.document.text":["VistaSmalltalk, or Vistascript, is a Microsoft Vista scripting Internet Explorer web development environment based on Smalltalk for the Microsoft .NET framework using XAML. While the name implies it is only an implementation of Smalltalk, Vista Smalltalk also includes a Lisp language engine which can use the Smalltalk libraries.\\nVista Smalltalk can be opened in IE7 either by clicking on the link at the Vistascript.net home page (this does not work.) or by downloading the code and executing vst.exe within its directory or with its directory set in the PATH for Windows XP or Windows Vista.\\nNewer versions of Vista Smalltalk can also be run on top of the Adobe Flash. This by technical novelty- Vista Smalltalk is using the Flash runtime instead of a traditional Smalltalk virtual machine, something which hasn't been done before. This use of Flash for Vista Smalltalk's runtime means that Vista Smalltalk (contrary to the name) can now be run on Mac OS X and Linux, where the original Vista Smalltalk was constrained to Windows due to its use of .NET.\\nOnce the browser pane is visible, a right-click on the background makes available a typical Smalltalk workspace, transcript or class"],"ns:common.document.source_uri":["<http://wp/en/8420975>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["2006"],"ns:type.object.name":["VistaSmalltalk"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fpl1pf"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced_by":["ns:m.070d2"]}}