{"ns:m.03g637":{"ns:common.topic.description":["DarkBASIC is a commercial game creation programming language released by The Game Creators. The language is a structured form of BASIC and is similar to AMOS on the Amiga. The purpose of the language is game creation using Microsoft's DirectX from a BASIC programming language. It is faster and easier to use than comparable languages, but also less powerful. It is marketed on its ability to allow a total novice to make playable games after following its tutorials.\\nDarkBASIC is a programming language that specializes in the creation of games. It can create both 2D and 3D games, providing function libraries that enable a game to be programmed with considerably less code than with a language such as C++ without such dedicated libraries. DarkBASIC consists of an IDE, Debugger and interpreter, and an engine built on DirectX 7. The compiler emits Bytecode that is appended to an interpreter to create a stand alone executable.\\nIt was first released in 2000 by DarkBasic Software Ltd. In 2002, The Game Creators released an updated version called DarkBASIC Professional able to use newer versions of DirectX."],"rdfs:label":["DarkBASIC"],"key:en":["darkbasic"],"ns:common.topic.article":[{"ns:common.document.text":["DarkBASIC is a commercial game creation programming language released by The Game Creators. The language is a structured form of BASIC and is similar to AMOS on the Amiga. The purpose of the language is game creation using Microsoft's DirectX from a BASIC programming language. It is faster and easier to use than comparable languages, but also less powerful. It is marketed on its ability to take a total novice and have them making games with its tutorials.\\nDarkbasic is a programming language that specializes in the creation of games. It can create both 2D and 3D games using a lot less code than the equivalent program would take by using more powerful languages such as C++ due to the included libraries. It is often referred to as DarkBASIC Classic to avoid confusion with DarkBASIC Professional. It consists of an IDE, Debugger and interpreter, and an engine built on DirectX 7. The compiler emitted Bytecode that is appended to an interpreter to create a stand alone executable.\\nIt was first released in 2000 by DarkBasic Software ltd. (now The Game Creators ltd.). In 2002, The Game Creators released a more powerful and extensive DarkBASIC Professional using newer versions of DirectX.\\nThe"],"ns:common.document.source_uri":["<http://wp/en/842340>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["DarkBASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125fl6q5p"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}