{"ns:m.027d4dd":{"ns:common.topic.description":["Eltron Programming Language is a printer control language used to produce printed paper labels for various Eltron model printers.\\nNewer printers support also the Zebra Programming Language.\\nEPL2 is a markup, line-at-a-time language, suitable for printing on media of reduced space, and although it supports bitmaps, its use is usually for labels including barcode information. Contrary to what the official documentation title says, it is not a programming language.\\nEach EPL2 line starts with one or more letters, and may be followed by one or more comma-separated arguments. Commands and arguments are case-sensitive.\\nArguments that are numeric or belong to a fixed set of options are inlined, and any string or set of variable values must be surrounded by double-quotes.\\nAlthough the EPL2 language has a quite lengthy and complete number of commands, the most basic are:\\nAh_pos,v_pos,rotation,font,h_mult,v_mult,reverse,\\\"text\\\" - ASCII text"],"rdfs:label":["Eltron Programming Language"],"key:en":["eltron_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Eltron Programming Language (EPL and EPL2) is a printer control language used to produce printed paper labels for various Eltron (now Zebra) model printers.\\nNewer printers support also the Zebra Programming Language (ZPL).\\nEPL2 is a markup, line-at-a-time language, suitable for printing on media of reduced space, and although it supports bitmaps (and therefore, arbitrary images), its use is usually for labels including barcode information. Contrary to what the official documentation title says, it is not a programming language (no flow-control or even conditionals are supported; variables are supported as numbered content).\\nEach EPL2 line starts with one or more letters (indicating the command), and may be followed by one or more comma-separated arguments. Commands and arguments are case-sensitive.\\nArguments that are numeric or belong to a fixed set of options (see i.e. the reverse argument for A) are inlined, and any string or set of variable values must be surrounded by double-quotes (\\\" - see i.e. the text argument for A).\\nAlthough the EPL2 language has a quite lengthy and complete number of commands, the most basic are:"],"ns:common.document.source_uri":["<http://wp/en/8664562>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Eltron Programming Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125b2pm68"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}