{"ns:m.03_h_w":{"key:user.avh.ellerdale":["0083-8fe5"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0083-8fe5"],"rdfs:label":["G-code"],"ns:common.topic.description":["G-code, which has many variants, is the common name for the most widely used numerical control programming language. It is used mainly in computer-aided manufacturing for controlling automated machine tools. G-code is sometimes called G programming language.\\nIn fundamental terms, G-code is a language in which people tell computerized machine tools how to make something. The how is defined by instructions on where to move, how fast to move, and through what path to move. The most common situation is that, within a machine tool, a cutting tool is moved according to these instructions through a toolpath, cutting away excess material to leave only the finished workpiece. The same concept also extends to noncutting tools such as forming or burnishing tools, photoplotting, additive methods such as 3D printing, and measuring instruments."],"key:en":["g-code"],"ns:common.topic.image":[{"ns:type.content.blob_id":["03db2540083d10bd471a0f1ec9f60611c91b018dfba113896aabc8a5bbb4cc54"],"ns:type.content.length":["2476"],"rdfs:label":["Tool Path for program"],"ns:common.licensed_object.provenance":["wikipedia,en,3094790"],"ns:type.content.source":["ns:m.03qw8pq"],"ns:common.image.size":["ns:m.02bdhhp"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08wq"],"ns:type.object.name":["Tool Path for program"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.03_h_w"]}],"ns:common.topic.article":[{"ns:common.document.text":["G-code is the common name for the most widely used computer numerical control (CNC) programming language, which has many implementations. Used mainly in automation, it is part of computer-aided engineering. G-code is sometimes called G programming language.\\nIn fundamental terms, G-code is a language in which people tell computerized machine tools what to make and how to make it. The \\\"what\\\" and \\\"how\\\" are mostly defined by instructions on where to move to, how fast to move, and through what path to move. The most common situation is that a cutting tool is moved according to these instructions, cutting away excess material to leave only the finished workpiece. Non-cutting tools, such as cold-forming tools, burnishing tools, or measuring probes, are also sometimes involved.\\nThe first implementation of numerical control was developed at the MIT Servomechanisms Laboratory in the early 1950s. In the decades since, many implementations have been developed by many (commercial and noncommercial) organizations. G-code has often been used in these implementations. The main standardized version used in the United States was settled by the Electronic Industries Alliance in the early 1960s. A"],"ns:common.document.source_uri":["<http://wp/en/1027403>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["G-code"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12590cn3k"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}