{"ns:m.02y1lf":{"ns:common.topic.description":["m4 is a general-purpose macro processor designed by Brian Kernighan and Dennis Ritchie. m4 is an extension of an earlier macro processor m3, written by Ritchie for the AP-3 minicomputer."],"key:en":["m4"],"rdfs:label":["m4"],"ns:computer.programming_language.language_designers":["Dennis Ritchie"],"ns:common.topic.article":[{"ns:common.document.text":["m4 is a general purpose macro processor designed by Brian Kernighan and Dennis Ritchie. m4 is an extension of an earlier macro processor m3, written by Ritchie for the AP-3 minicomputer.\\nAll UNIXes make the m4 macro processor available, and POSIX has standardized it. Most users require m4 simply as a dependency of GNU autoconf, used by \\\"configure\\\" scripts, although the language can be, and is, used in other contexts.\\nA macro processor (or a preprocessor) operates as a text-replacement tool. End-users often employ it to re-use text templates, typically in programming applications, but also in text editing and in text-processing applications.\\nMacro processors became popular when programmers commonly used assembly language. In those early days of programming, programmers noted that much of their programs consisted of repeated text, and they invented simple means for reusing this text. Programmers soon discovered the advantages not only of reusing entire blocks of text, but also of substituting different values for similar parameters. This defined the usage range of macro processors.\\nKernighan and Ritchie developed m4 in 1977, basing it on the ideas of Christopher Strachey. The"],"ns:common.document.source_uri":["<http://wp/en/625653>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1977"],"ns:type.object.name":["m4"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12556xlrp"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}