{"ns:m.079lq":{"ns:common.topic.description":["SNOBOL is a series of computer programming languages developed between 1962 and 1967 at AT&T Bell Laboratories by David J. Farber, Ralph E. Griswold and Ivan P. Polonsky, culminating in SNOBOL4. It was one of a number of text-string-oriented languages developed during the 1950s and 1960s; others included COMIT and TRAC.\\nSNOBOL4 stands apart from most programming languages by having patterns as a first-class data type and by providing operators for pattern concatenation and alternation. Strings generated during execution can be treated as programs and executed.\\nSNOBOL4 was quite widely taught in larger US universities in the late 1960s and early 1970s and was widely used in the 1970s and 1980s as a text manipulation language in the humanities.\\nIn recent years its use has faded as newer languages such as AWK and Perl have made string manipulation by means of regular expressions fashionable. SNOBOL4 patterns subsume BNF grammars, which are equivalent to context-free grammars and more powerful than regular expressions."],"rdfs:label":["SNOBOL"],"key:en":["snobol"],"ns:computer.programming_language.language_designers":["Ivan P. Polonsky"],"ns:common.topic.article":[{"ns:common.document.text":["SNOBOL (StriNg Oriented and symBOlic Language) is a series of computer programming languages developed between 1962 and 1967 at AT&T Bell Laboratories by David J. Farber, Ralph E. Griswold and Ivan P. Polonsky, culminating in SNOBOL4. It was one of a number of text-string-oriented languages developed during the 1950s and 1960s; others included COMIT and TRAC.\\nSNOBOL4 stands apart from most programming languages by having patterns as a first-class data type (i.e. a data type whose values can be manipulated in all ways permitted to any other data type in the programming language) and by providing operators for pattern concatenation and alternation. Strings generated during execution can be treated as programs and executed.\\nSNOBOL4 was quite widely taught in larger US universities in the late 1960s and early 1970s and was widely used in the 1970s and 1980s as a text manipulation language in the humanities.\\nIn recent years its use has faded as newer languages such as AWK and Perl have made string manipulation by means of regular expressions fashionable. SNOBOL4 patterns subsume BNF grammars, which are equivalent to context-free grammars and more powerful than regular expressions. The"],"ns:common.document.source_uri":["<http://wp/en/29515>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1962"],"ns:type.object.name":["SNOBOL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125dp7637"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.dialects":["ns:m.03tr0"],"ns:computer.programming_language.influenced":["ns:m.0q2c"],"ns:computer.programming_language.influenced_by":["ns:m.03z51v"]}}