{"ns:m.027sj6":{"rdfs:label":["IBM i Control Language"],"ns:common.topic.description":["The IBM i Control Language is a scripting language for the IBM's IBM i platform bearing a resemblance to the IBM Job Control Language and consisting of an ever expanding set of command objects used to invoke traditional AS/400 programs and/or get help on what those programs do. CL can also be used to create CL programs where there are additional commands that provide program-like functionality\\nWhile thousands of commands were written by IBM developers to perform system level tasks like compiling programs, backing up data, changing system configurations, displaying system object details, or deleting them, commands are not limited to systems level concerns and can be drafted for user applications as well."],"key:en":["as_400_control_language"],"ns:common.topic.article":[{"ns:common.document.text":["The AS/400 Control Language (CL) is a scripting language for the IBM AS/400 midrange platform bearing a resemblance to the IBM Job Control Language and consisting of an ever expanding set of command objects (*CMD) used to invoke traditional AS/400 programs and/or get help on what those programs do. CL can also be used to create CL programs (congruent to shell scripts) where there are additional commands that provide program-like functionality (GOTO, IF/ELSE, variable declaration, file input, etc.)\\nThe vast majority of AS/400 commands were written by IBM developers to perform system level tasks like compiling programs, backing up data, changing system configurations, displaying system object details, or deleting them. Commands are not limited to systems level concerns and can be drafted for user applications as well.\\nParameters (command-line arguments) defined in the main procedures of all traditional AS/400 programs are hard coded lists that are made up of parameters that can be numeric, alphanumeric, boolean, etc. and the order in which parameters are passed is important. This is a stark difference from the Unix and DOS worlds where the parameter list in Unix shell scripts and C"],"ns:common.document.source_uri":["<http://wp/en/431985>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.developers":["IBM"],"ns:computer.programming_language.language_designers":["IBM"],"ns:type.object.name":["IBM i Control Language"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12571zj86"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.05xjv"],"ns:computer.programming_language.influenced":["ns:m.03790v"]}}