{"ns:m.0h9wb":{"ns:common.topic.description":["Poplog is a reflective, incrementally compiled software development environment for the programming languages POP-11, Common Lisp, Prolog, and Standard ML, originally created in the UK for teaching and research in artificial intelligence at the University of Sussex."],"rdfs:label":["Poplog"],"key:en":["poplog"],"ns:common.topic.article":[{"ns:common.document.text":["Poplog is a reflective, incrementally compiled software development environment for the programming languages POP-11, Common Lisp, Prolog, and Standard ML, originally created in the UK for teaching and research in artificial intelligence at the University of Sussex.\\nAfter an incremental compiler for Prolog had been added to an implementation of POP-11, the name Poplog was adopted, to reflect the fact that it supported programming in both languages. The name was retained, as a trade mark of the University of Sussex, when the system was later extended as incremental compilers were added for Lisp and Standard ML.\\nFor some time after 1983, Poplog was sold and supported internationally as a commercial product, by Systems Designers Ltd, whose name changed as ownership changed. (The company is now owned by EDS.) In 1989, it was called SD-Scicon. At that time a management buy-out produced a spin-off company Integral Solutions Ltd (ISL), to sell and support Poplog in collaboration with Sussex University, who retained the rights to the name 'Poplog' and were responsible for most of the software development while it was a commercial product.\\nISL and its clients used Poplog for a number of"],"ns:common.document.source_uri":["<http://wp/en/65118>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Poplog"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bnxf2h"],"ns:computer.programming_language.language_paradigms":["ns:m.03p3g9"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}