{"ns:m.03ppzh":{"ns:common.topic.description":["SETL is a very high-level programming language based on the mathematical theory of sets. It was originally developed by Jack Schwartz at the NYU Courant Institute of Mathematical Sciences in the late 1960s.\\nDavid Bacon, who was previously a PhD student in NYU with Jack Schwartz still actively maintains the compiler for SETL and its website."],"rdfs:label":["SETL"],"key:en":["setl"],"ns:common.topic.official_website":["<http://setl.org/>"],"ns:common.topic.article":[{"ns:common.document.text":["SETL (SET Language) is a very-high level programming language based on the mathematical theory of sets. It was originally developed by Jack Schwartz at the NYU Courant Institute of Mathematical Sciences in the late 1960s.\\nSETL provides two basic aggregate data types: unordered sets, and sequences (the latter also called tuples). The elements of sets and tuples can be of any arbitrary type, including sets and tuples themselves. Maps are provided as sets of pairs (i.e., tuples of length 2) and can have arbitrary domain and range types. Primitive operations in SETL include set membership, union, intersection, and power set construction, among others.\\nSETL provides quantified boolean expressions constructed using the universal and existential quantifiers of first-order predicate logic.\\nSETL provides several iterators to produce a variety of loops over aggregate data structures.\\nIn the 1970s, SETL was ported to the BESM-6, ES EVM and other Russian computer systems.\\nSETL was used for an early implementation of the Ada programming language, known as the NYU Ada/ED translator. This later became the first validated Ada implementation, certified on April 11, 1983.\\nDavid Bacon, who was"],"ns:common.document.source_uri":["<http://wp/en/916963>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm3d9p"],"ns:common.webpage.uri":["<http://setl.org/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.03ppzh"]}],"ns:computer.programming_language.introduced":["1969"],"ns:type.object.name":["SETL"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12594ncxv"],"ns:computer.programming_language.influenced":["ns:m.03r1wd"],"ns:computer.programming_language.language_paradigms":["ns:m.06w_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}