{"ns:m.051624":{"ns:common.topic.description":["Karel is an educational programming language for beginners, created by Richard E. Pattis in his book Karel The Robot: A Gentle Introduction to the Art of Programming. Pattis used the language in his courses at Stanford University, California. The language is named after Karel Čapek, a Czech writer who introduced the word robot."],"rdfs:label":["Karel"],"key:en":["karel_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["Karel is an educational programming language for beginners, created by Richard E. Pattis in his book Karel The Robot: A Gentle Introduction to the Art of Programming. Pattis used the language in his courses at Stanford University, California. The language is named after Karel Čapek, a Czech writer who introduced the word robot.\\nA program in Karel is used to control a simple robot named Karel that lives in an environment consisting of a grid of streets (left-right) and avenues (up-down). Karel understands five basic instructions: move (Karel moves by one square in the direction he is facing), turnleft (Karel turns 90 ° left), putbeeper (Karel puts a beeper on the square he is standing at), pickbeeper (Karel lifts a beeper off the square he is standing at), and turnoff (Karel switches himself off, the program ends). Karel can also perform boolean queries about his immediate environment, asking whether there is a beeper where he is standing, whether there are barriers next to him, and about the direction he is facing. A programmer can create additional instructions by defining them in terms of the five basic instructions, and by using conditional control flow statements if and while"],"ns:common.document.source_uri":["<http://wp/en/1433925>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1981"],"ns:type.object.name":["Karel"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258qxcky"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0gzx5x"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:computer.programming_language.influenced_by":["ns:m.05y49"],"ns:symbols.namesake.named_after":["ns:m.0bx6b"]}}