{"ns:m.02rgks0":{"rdfs:label":["Adenine"],"ns:common.topic.description":["Adenine, named after the nucleobase adenine, is a scripting language that is cross-platform, which is developed in the context of project Haystack and Project Oxygen of the Massachusetts Institute of Technology Computer Science and Artificial Intelligence Laboratory in collaboration with Nippon Telegraph and Telephone.\\nAdenine was developed as the implementation language of the Haystack Semantic Desktop. It is the perhaps the earliest example of a homoiconic general graph programming language.\\nA substantial characteristic of Adenine is that this language possesses native support for the Resource Description Framework. The language constructs of Adenine are derived from Python and Lisp.\\nAdenine is written in RDF and thus also can be represented and written with RDF based syntaxes such as Notation3. Also, as well as RDF, Adenine can be extended. The data type system corresponds to the data type system from RDF and XML Schema, and can be extended."],"ns:common.topic.article":[{"ns:common.document.text":["Adenine, named after the nucleobase adenine, is a scripting language that is cross-platform, which is developed in the context of project Haystack and Project Oxygen of the Massachusetts Institute of Technology (MIT) Computer Science and Artificial Intelligence Laboratory (CSAIL) in collaboration with Nippon Telegraph and Telephone (NTT).\\nA substantial characteristic of Adenine is that this language possesses native support for the Resource Description Framework (RDF). The language constructs of Adenine are derived from Python and Lisp.\\nAdenine is written in RDF and thus also can be represented and written with RDF based syntaxes such as Notation3 (N3). Also, as well as RDF, Adenine can be extended. The data type system corresponds to the data type system from RDF and XML Schema, and can be extended."],"ns:common.document.source_uri":["<http://wp/en/11517646>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Adenine"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257y87_b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}