{"ns:m.02cv24":{"key:user.avh.ellerdale":["0214-9235"],"ns:user.avh.default_domain.ellerdale_topic.ellerdale_id":["0214-9235"],"ns:common.topic.description":["QBasic is an IDE and interpreter for a variety of the BASIC programming language which is based on QuickBASIC. Code entered into the IDE is compiled to an intermediate form, and this intermediate form is immediately interpreted on demand within the IDE. It can run under nearly all versions of DOS and Windows, or through DOSBox/DOSEMU, on Linux and FreeBSD. For its time, QBasic provided a state-of-the-art IDE, including a debugger with features such as on-the-fly expression evaluation and code modification.\\nLike QuickBASIC, but unlike earlier versions of Microsoft BASIC, QBasic is a structured programming language, supporting constructs such as subroutines and while loops. Line numbers, a concept often associated with BASIC, are supported for compatibility, but are not considered good form, having been replaced by descriptive line labels. QBasic has limited support for user-defined data types, and several primitive types used to contain strings of text or numeric data."],"rdfs:label":["QBasic"],"key:en":["qbasic"],"ns:common.topic.official_website":["<http://www.microsoft.com/>"],"ns:common.topic.article":[{"ns:common.document.text":["QBasic is an IDE and interpreter for a variant of the BASIC programming language which is based on QuickBASIC. Code entered into the IDE is compiled to an intermediate form, and this intermediate form is immediately interpreted on demand within the IDE. It can run under nearly all versions of DOS and Windows, or through DOSBox/DOSEMU, on Linux and FreeBSD. For its time, QBasic provided a state-of-the-art IDE, including a debugger with features such as on-the-fly expression evaluation and code modification.\\nLike QuickBASIC, but unlike earlier versions of Microsoft BASIC, QBasic is a structured programming language, supporting constructs such as subroutines and while loops. Line numbers, a concept often associated with BASIC, are supported for compatibility, but are not considered good form, having been replaced by descriptive line labels. QBasic has limited support for user-defined data types (structures), and several primitive types used to contain strings of text or numeric data.\\nQBasic was intended as a replacement for GW-BASIC. It was based on the earlier QuickBASIC 4.5 compiler but without QuickBASIC's compiler and linker elements. Version 1.0 was shipped together with MS-DOS"],"ns:common.document.source_uri":["<http://wp/en/23712097>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bkgq7t"],"ns:common.webpage.uri":["<http://www.microsoft.com/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.02cv24"]}],"ns:computer.programming_language.language_designers":["Microsoft Corporation"],"ns:computer.programming_language.introduced":["1991"],"ns:type.object.name":["QBasic"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1256npdxh"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.0h22q"],"ns:computer.programming_language.language_paradigms":["ns:m.05yd5"],"ns:computer.programming_language.influenced":["ns:m.0h6g8"]}}