{"ns:m.0bcr5c":{"rdfs:label":["MIMIC"],"ns:common.topic.description":["MIMIC, known in capitalized form only, is a former simulation computer language developed 1964 by H. E. Petersen, F. J. Sansom and L. M. Warshawsky of Systems Engineering Group within the Air Force Materiel Command at the Wright-Patterson AFB in Dayton, Ohio, USA. It is an expression-oriented continuous block simulation language, but capable of incorporating blocks of FORTRAN-like algebra.\\nMIMIC is a further development from MIDAS, which represented analog computer design. Written completely in FORTRAN but one routine in COMPASS, and ran on Control Data supercomputers, MIMIC is capable of solving much larger simulation models.\\nWith MIMIC, ordinary differential equations describing mathematical models in several scientific disciplines as in engineering, physics, chemistry, biology, economics and as well as in social sciences can easily be solved by numerical integration and the results of the analysis are listed or drawn in diagrams. It also enables the analysis of nonlinear dynamic conditions.\\nThe MIMIC software package, written as FORTRAN overlay programs, executes input statements of the mathematical model in six consecutive passes."],"ns:common.topic.article":[{"ns:common.document.text":["This article is about the programming language. For the vaccine development tool, see MIMIC (Immunology).\\nMIMIC, known in capitalized form only, is a former simulation computer language developed 1964 by H. E. Petersen, F. J. Sansom and L. M. Warshawsky of Systems Engineering Group within the Air Force Materiel Command at the Wright-Patterson AFB in Dayton, Ohio, USA. It is an expression-oriented continuous block simulation language, but capable of incorporating blocks of FORTRAN-like algebra.\\nMIMIC is a further development from MIDAS (Modified Integration Digital Analog Simulator), which represented analog computer design. Written completely in FORTRAN but one routine in COMPASS, and ran on Control Data supercomputers, MIMIC is capable of solving much larger simulation models.\\nWith MIMIC, ordinary differential equations describing mathematical models in several scientific disciplines as in engineering, physics, chemistry, biology, economics and as well as in social sciences can easily be solved by numerical integration and the results of the analysis are listed or drawn in diagrams. It also enables the analysis of nonlinear dynamic conditions.\\nThe MIMIC software package, written"],"ns:common.document.source_uri":["<http://wp/en/4017688>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["MIMIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bt9fwc"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}