{"ns:m.08td3z":{"rdfs:label":["Collaborative human interpreter"],"ns:common.topic.description":["The Collaborative Human Interpreter is a proposed software interface for human-based computation specially designed for collecting and making use of human intelligence in a computer program. One typical usage is implementing impossible-to-automate functions.\\nFor example, it is currently difficult for a computer to differentiate between images of men, women and non-humans. However, this is easy for people. A programmer using CHI could write a code fragment along these lines:\\nCode for the function checkGender can currently only approximate a result, but the task can easily be solved by a person. When the function checkGender is called, the system will send a request to someone, and the person who received the request will process the task and input the result. If the person inputs value MALE, you'll get the value in your variable result, in your program. This querying process can be highly automated."],"key:en":["collaborative_human_interpreter"],"ns:common.topic.article":[{"ns:common.document.text":["The Collaborative Human Interpreter (CHI) is a proposed software interface for human-based computation (first proposed as a programming language on the blog Google Blogoscoped, but implementable via an API in virtually any programming language) specially designed for collecting and making use of human intelligence in a computer program. One typical usage is implementing impossible-to-automate functions.\\nFor example, it is currently difficult for a computer to differentiate between images of men, women and non-humans. However, this is easy for people. A programmer using CHI could write a code fragment along these lines:\\nCode for the function checkGender(Photo p) can currently only approximate a result, but the task be can be easily solved by a person. When the function checkGender() is called, the system will send a request to someone, and the person who received the request will process the task and input the result. If the person (task processor) inputs value MALE, you'll get the value in your variable result, in your program. This querying process can be highly automated.\\nOn November 6, 2005, Amazon.com launched CHI as its business platform in the Amazon Mechanical Turk . It's"],"ns:common.document.source_uri":["<http://wp/en/3130340>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Collaborative human interpreter"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125f2j4s0"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}