{"ns:m.02h0jd":{"ns:common.topic.description":["Lingo is a verbose object-oriented scripting language developed by John H. Thompson for use in Adobe Director. Lingo is used to develop desktop applications, interactive kiosks, CD-ROMs and Adobe Shockwave content.\\nLingo is the primary programming language on the Adobe Shockwave platform, which dominated the interactive multimedia product space during the 1990s. Various graphic adventure games were developed with Lingo during the 1990s, including The Journeyman Project, Total Distortion, Mia's Language Adventure, Mia's Science Adventure, and the Didi & Ditto series. Hundreds of free online video games were developed using Lingo, and published on websites such as Miniclip and Shockwave.com.\\nLingo can be used to build user interfaces, to manipulate raster graphics, vector graphics and 3D graphics, and other data processing tasks. Lingo supports specialized syntax for image processing and 3D object manipulation. 3D meshes can also be created on the fly using Lingo."],"rdfs:label":["Lingo"],"key:en":["lingo_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["The name Lingo has been used by several unrelated programming languages. Presently, it most commonly refers to a scripting language developed by John H. Thompson for use in Adobe Director (formerly Macromedia Director), used for regular desktop applications, interactive kiosks, CD-ROMs and Adobe Shockwave internet sites. HyperTalk is likely to have been one of the inspirations for Lingo.\\nWhen Lingo was created, a verbose syntax was designed to mimic spoken language, so it would be easy for beginners to get started. You could write whole HyperTalk-like sentences such as:\\nif sprite 5 is visible then go to the frame\\nNote that in \\\"go to\\\" statements the \\\"to\\\" is optional. Also note that unlike other programming languages, \\\"go\\\" statements reference frames in Director's Score, not particular lines of code.\\nAlthough it is still possible to use the verbose syntax, the current version of the language fully supports dot syntax, so that the code looks more like standard programming languages such as JavaScript or C++.\\nThe equivalent in new scripting style would be:\\nif sprite(5).visible then _movie.go(_movie.frame)\\nThis format uses elements of the Director Object Model, introduced in Director MX"],"ns:common.document.source_uri":["<http://wp/en/493076>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Lingo"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255vdz8x"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}