{"ns:m.05dts":{"ns:common.topic.description":["Nial is a high-level array programming language developed from about 1981 by Mike Jenkins of Queen's University, Kingston, Ontario, Canada.\\nNial combines a functional programming notation for arrays based on Array Theory developed by Trenchard More with structured programming concepts for numeric, character and symbolic data.\\nIt is most often used for prototyping and artificial intelligence."],"rdfs:label":["Nial"],"key:en":["nial"],"ns:common.topic.article":[{"ns:common.document.text":["Nial (from \\\"Nested Interactive Array Language\\\") is a high-level array programming language developed from about 1981 by Mike Jenkins of Queen's University, Kingston, Ontario, Canada.\\nNial combines a functional programming notation for arrays based on Array Theory developed by Trenchard More with structured programming concepts for numeric, character and symbolic data.\\nIt is most often used for prototyping and artificial intelligence.\\nIn 1982, Jenkins formed a company Nial Systems Ltd to market the language and the Q'Nial implementation of Nial. As of 2006, the company website supports an Open Source project for the Q'Nial software with the binary and source available for download under the terms of an Artistic Licence.\\nNial uses a generalized and expressive Array Theory in its Version 4, but sacrificed some of the generality of functional model, and modified the Array Theory in the Version 6. Only Version 6 is available now.\\nNial defines all its datatypes as nested rectangular arrays. ints, booleans, chars etc. are considered as a solitary array or an array containing a single member. Arrays themselves can contain other arrays to form arbitrarily deep structures. Nial also provides"],"ns:common.document.source_uri":["<http://wp/en/21571>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1981"],"ns:type.object.name":["Nial"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125gs6m0f"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.03m62t"],"ns:computer.programming_language.influenced_by":["ns:m.0q1d"],"ns:computer.programming_language.parent_language":["ns:m.0q1d"]}}