{"ns:m.01jm0":{"ns:common.topic.description":["Blitz BASIC refers to the programming language dialect that was interpreted by the first Blitz compilers, devised by New Zealand-based developer Mark Sibly. Being derived from BASIC, Blitz syntax was designed to be easy to pick up for beginners first learning to program. The languages are game-programming oriented but are often found general-purpose enough to be used for most types of application. The Blitz language evolved as new products were released, with recent incarnations offering support for more advanced programming techniques such as object-orientation and multi-threading. This led to the languages losing their BASIC moniker in later years."],"rdfs:label":["Blitz BASIC"],"key:en":["blitz_basic"],"ns:common.topic.article":[{"ns:common.document.text":["Blitz BASIC refers to the programming language dialect that was interpreted by the first Blitz compilers, devised by New Zealand-based developer Mark Sibly. Being derived from BASIC, Blitz syntax was designed to be easy to pick-up for beginners first learning to program. The languages are game-programming orientated but are often found general-purpose enough to be used for most types of application. The Blitz language evolved as new products were released, with recent incarnations offering support for more advanced programming techniques such as object-orientation and multi-threading. This led to the languages losing their BASIC moniker in later years.\\nThe first iteration of the Blitz language was created for the Amiga platform and published by the Australian firm Memory and Storage Technology. Returning to New Zealand, Blitz2 was published several years later by Acid Software (a local Amiga game publisher). Since then, Blitz compilers have been released on several platforms.\\nIdigicon published BlitzBasic for Microsoft Windows in October 2000. The language included a built-in API for performing basic 2D-graphics and audio operations. Following the release of Blitz3D, BlitzBasic is"],"ns:common.document.source_uri":["<http://wp/en/4840>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["2004"],"ns:type.object.name":["Blitz BASIC"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125bpmnt7"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.0gh8h6w"]}}