{"ns:m.0gzx5x":{"ns:common.topic.description":["AgentSheets is a Cyberlearning tool to teach students programming and related information technology skills through game design.\\nAgentSheets is supported by a middle and high school curriculum called Scalable Game Design aligned with the ISTE National Educational Technology Standards. The mission of this project is to reinvent computer science in public schools by motivating & educating all students including women and underrepresented communities to learn about computer science through game design starting at the middle school level. Through this curriculum students build increasingly sophisticated games and, as part of this process, learn about computational concepts at the level of computational thinking that are relevant to game design as well as to computational science. The curriculum is made available through the Scalable Game Design Wiki. Research investigating motivational aspects of computer science education in public schools is currently exploring the introduction of game design in representative regions of the USA including technology hubs, inner city, rural and remote/tribal areas."],"rdfs:label":["AgentSheets"],"key:en":["agentsheets"],"ns:common.topic.official_website":["<http://www.agentsheets.com/>"],"ns:common.topic.image":[{"ns:type.content.length":["45055"],"ns:type.content.blob_id":["d74ccb06b6f0406e03f288cd76875935e3185baea49036c7ec7f33d79ebb39a2"],"ns:common.licensed_object.provenance":["wikipedia,en,6978154"],"ns:common.image.size":["ns:m.01x42_4"],"ns:type.content.source":["ns:m.05th5zk"],"ns:common.licensed_object.license":["ns:m.05smz"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["Agentsheets_IDE"],"rdfs:label":["Agentsheets_IDE"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0gzx5x"],"ns:common.image.rights_holder_text_attribution":["Attributed to wikipedia user Dragentsheets"],"ns:type.content.uploaded_by":["ns:m.0220tm0"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.agentsheets.com>"],"ns:common.webpage.category":["ns:m.08mbj5d"],"ns:common.webpage.resource":["ns:m.0bm3fnk"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0gzx5x"]}],"ns:common.topic.article":[{"ns:common.document.text":["AgentSheets is an educational Cyberlearning  tool to create Web-based simulation games. AgentSheets is used worldwide to teach students programming and related information technology skills through game design. The built-in drag-and-drop language is accessible enough that students without programming background can make their own simple Frogger-like game, and publish it on the Web, in their first session. At the same time, AgentSheets is powerful enough to make sophisticated The Sims-like games with artificial intelligence. To transition from visual programming to more traditional programming students can render their games into Java source code.\\nAgentSheets is supported by a middle and high school curriculum called Scalabable Game Design aligned with the ISTE National Educational Technology Standards (NETS). The mission of this project is to reinvent computer science in public schools by motivating & educating all students including women and underrepresented communities to learn about computer science through game design starting at the middle school level. Through this curriculum students build increasingly sophisticated games and, as part of this process, learn about"],"ns:common.document.source_uri":["<http://wp/en/6983799>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1991"],"ns:type.object.name":["AgentSheets"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12598b9pg"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.language_paradigms":["ns:m.05prj"],"ns:computer.programming_language.influenced":["ns:m.0bfq5w"],"ns:computer.programming_language.influenced_by":["ns:m.070d2"]}}