{"ns:m.0d_8qw":{"rdfs:label":["Flow-based programming"],"ns:common.topic.description":["In computer programming, flow-based programming is a programming paradigm that defines applications as networks of \\\"black box\\\" processes, which exchange data across predefined connections by message passing, where the connections are specified externally to the processes. These black box processes can be reconnected endlessly to form different applications without having to be changed internally. FBP is thus naturally component-oriented.\\nFBP is a particular form of dataflow programming based on bounded buffers, information packets with defined lifetimes, named ports, and separate definition of connections."],"key:en":["flow-based_programming"],"ns:common.topic.image":[{"ns:type.content.length":["18433"],"ns:type.content.blob_id":["2987a0f817545c15bfd1dfa2f81a8a6bc03b7c01ac3766a07039c9327d1d6644"],"rdfs:label":["Simple FBP diagram"],"ns:common.licensed_object.provenance":["wikipedia,en,5704974"],"ns:type.content.source":["ns:m.02fgj6j"],"ns:common.image.size":["ns:m.02fgj6p"],"ns:common.licensed_object.license":["ns:m.034jd"],"ns:type.content.media_type":["ns:m.08x8"],"ns:type.object.name":["Simple FBP diagram"],"rdf:type":["ns:type.content"],"ns:common.image.appears_in_topic_gallery":["ns:m.0d_8qw"]}],"ns:common.topic.article":[{"ns:common.document.text":["In computer science, flow-based programming (FBP) is a programming paradigm that defines applications as networks of \\\"black box\\\" processes, which exchange data across predefined connections by message passing, where the connections are specified externally to the processes. These black box processes can be reconnected endlessly to form different applications without having to be changed internally. FBP is thus naturally component-oriented.\\nFBP is a particular form of dataflow programming based on bounded buffers, information packets with defined lifetimes, named ports, and separate definition of connections.\\nThe FBP development approach views an application not as a single, sequential, process, which starts at a point in time, and then does one thing at a time until it is finished, but as a network of asynchronous processes communicating by means of streams of structured data chunks, called \\\"information packets\\\" (IPs). In this view, the focus is on the application data and the transformations applied to it to produce the desired outputs. The network is defined externally to the processes, as a list of connections which is interpreted by a piece of software, usually called the"],"ns:common.document.source_uri":["<http://wp/en/5689970>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Flow-based programming"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.12586g51_"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}