{"ns:m.0bh1q5":{"rdfs:label":["Identity transform"],"ns:common.topic.description":["The identity transform is a data transformation that copies the source data into the destination data without change.\\nThe identity transformation is considered an essential process in creating a reusable transformation library. By creating a library of variations of the base identity transformation, a variety of data transformation filters can be easily maintained. These filters can be chained together in a format similar to UNIX shell pipes."],"key:en":["identity_transform"],"ns:common.topic.article":[{"ns:common.document.text":["The identity transform is a data transformation that copies the source data into the destination data without change.\\nThe identity transformation is considered an essential process in creating a reusable transformation library. By creating a library of variations of the base identity transformation, a variety of data transformation filters can be easily maintained. These filters can be chained together in a format similar to UNIX shell pipes.\\nThe \\\"copy with recursion\\\" permits, changing little portions of code, produce entire new and different output, filtering or updating the input. Understanding the \\\"identity by recursion\\\" we can understand the filters.\\nThe most frequently cited example of the identity transform (for XSLT version 1.0) is the \\\"copy.xsl\\\" transform as expressed in XSLT. This transformation uses the xsl:copy command to perform the identity transformation:\\nThis template works by matching all attributes (@*) and other nodes (node()), copying each node matched, then applying the identity transformation to all attributes and child nodes of the context node. This recursively descends the element tree and outputs all structures in the same structure they were found in the"],"ns:common.document.source_uri":["<http://wp/en/4081099>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Identity transform"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cg5gp6"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}