{"ns:m.04g1zgl":{"ns:common.topic.description":["JFugue is an open source programming library that allows one to program music in the Java programming language without the complexities of MIDI. It was first released in 2002 by David Koelle. The current version, JFugue 5.0, was released in March 2015. Brian Eubanks has described JFugue as \\\"useful for applications that need a quick and easy way to play music or to generate MIDI files.\\\" JFugue is free software released under the Apache License."],"rdfs:label":["JFugue"],"key:en":["jfugue"],"ns:common.topic.article":[{"ns:common.document.text":["JFugue is an open source programming library that allows one to program music in the Java programming language without the complexities of MIDI. It was first released in 2002 by David Koelle. Brian Eubanks has described JFugue as \\\"useful for applications that need a quick and easy way to play music or to generate MIDI files.\\\"\\nHere's an example Java program that will play the C-major scale in JFugue.\\nThe string passed to JFugue contains a series of musical instructions that JFugue parses and turns into musical events, which by default are rendered in MIDI. These strings, called the \\\"MusicString\\\", can represent all of the musical features of MIDI. JFugue also provides features that enable the developer to write music in a straightforward manner; for example, chords and instruments are represented in a user-centered manner.\\nA notion of Patterns is integral to JFugue. Patterns are used to represent phrases of music that can be combined and repeated.\\nPatterns can also be transformed into new phrases of music using a PatternTransformer:\\nJFugue uses the MIDI implementation provided by the Java programming language to create audio output from the \\\"MusicString\\\", the series of instructions"],"ns:common.document.source_uri":["<http://wp/en/17436179>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["JFugue"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257xhmrl"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}