{"ns:m.076t4y":{"ns:common.topic.description":["XACML stands for \\\"eXtensible Access Control Markup Language\\\". The standard defines a declarative access control policy language implemented in XML and a processing model describing how to evaluate access requests according to the rules defined in policies.\\nAs a published standard specification, one of the goals of XACML is to promote common terminology and interoperability between access control implementations by multiple vendors. XACML is primarily an Attribute Based Access Control system, where attributes associated with a user or action or resource are inputs into the decision of whether a given user may access a given resource in a particular way. Role-based access control can also be implemented in XACML as a specialization of ABAC.\\nThe XACML model supports and encourages the separation of the access decision from the point of use. When access decisions are baked into client applications, it is very difficult to update the decision criteria when the governing policy changes. When the client is decoupled from the access decision, authorization policies can be updated on the fly and affect all clients immediately."],"rdfs:label":["XACML"],"key:en":["xacml"],"ns:common.topic.article":[{"ns:common.document.text":["XACML stands for eXtensible Access Control Markup Language. The standard defines a declarative access control policy language implemented in XML and a processing model describing how to evaluate authorization requests according to the rules defined in policies.\\nAs a published standard specification, one of the goals of XACML is to promote common terminology and interoperability between authorization implementations by multiple vendors. XACML is primarily an Attribute Based Access Control system (ABAC), where attributes (bits of data) associated with a user or action or resource are inputs into the decision of whether a given user may access a given resource in a particular way. Role-based access control (RBAC) can also be implemented in XACML as a specialization of ABAC.\\nThe XACML model supports and encourages the separation of the authorization decision from the point of use. When authorization decisions are baked into client applications (or based on local machine userids and Access Control Lists (ACLs)), it is very difficult to update the decision criteria when the governing policy changes. When the client is decoupled from the authorization decision, authorization policies can"],"ns:common.document.source_uri":["<http://wp/en/2365219>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["XACML"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125932vxd"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}