{"ns:m.01b5k":{"ns:common.topic.description":["Brainfuck is an esoteric programming language created in 1993 by Urban Müller, and notable for its extreme minimalism.\\nThe language consists of only eight simple commands and an instruction pointer, yet is fully Turing-complete. However, it is not intended for practical use; but to challenge and amuse programmers.\\nThe language's name is a reference to the slang term \\\"brain fuck\\\", which refers to things so complicated or unusual that they exceed the limits of one's understanding."],"rdfs:label":["Brainfuck"],"key:en":["brainfuck"],"ns:base.schemastaging.context_name.pronunciation":[{"ns:base.schemastaging.pronunciation.yomigana":["ブレインファック"],"rdf:type":["ns:base.schemastaging.pronunciation"]}],"ns:common.topic.article":[{"ns:common.document.text":["The brainfuck programming language is an esoteric programming language noted for its extreme minimalism. It is a Turing tarpit, designed to challenge and amuse programmers, and was not made to be suitable for practical use. It was created in 1993 by Urban Müller.\\nThe name of the language is generally not capitalized except at the start of a sentence, although it is a proper noun.\\nUrban Müller created brainfuck in 1993 with the intention of designing a language which could be implemented with the smallest possible compiler, inspired by the 1024-byte compiler for the FALSE programming language. Several brainfuck compilers have been made smaller than 200 bytes. The classic distribution is Müller's version 2, containing a compiler for the Amiga, an interpreter, example programs, and a readme document.\\nThe language consists of eight commands, listed below. A brainfuck program is a sequence of these commands, possibly interspersed with other characters (which are ignored). The commands are executed sequentially, except as noted below; an instruction pointer begins at the first command, and each command it points to is executed, after which it normally moves forward to the next command."],"ns:common.document.source_uri":["<http://wp/en/4086>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1993"],"ns:type.object.name":["Brainfuck"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1255xf99n"],"ns:computer.programming_language.language_paradigms":["ns:m.0dg773l"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced_by":["ns:m.06ypf2"],"ns:computer.programming_language.parent_language":["ns:m.06ypf2"],"ns:computer.programming_language.dialects":["ns:m.0dg778l"]}}