{"ns:m.02s2nd":{"ns:common.topic.description":["PROIV is a fourth-generation programming language, developed and sold by NorthgateArinso, part of the Northgate Information Solutions Group. It has an active community of around 2500 developers and end-users worldwide, ranging from consultants to large multinationals, finance institutions, tax authorities, retailers, engineering companies, media operators and software houses.\\nPROIV's usual application domain is database-centric business applications. PROIV has some similarities to languages such as ABAP, FOCUS and RPG.\\nPROIV programs consist of declarative/non-procedural specifications that control the overall structure of the program and database access and that have an implicit sequence of execution. Procedural subroutines can be added by the programmer; these are written in a 3GL-like language which PROIV calls \\\"Logic\\\".\\nNote that in PROIV programs are referred to as \\\"functions\\\", which can be confusing as it differs from the more usual use of that term in programming languages."],"rdfs:label":["PROIV"],"key:en":["pro-iv"],"ns:common.topic.article":[{"ns:common.document.text":["PROIV is a fourth-generation programming language (4GL), developed and sold by NorthgateArinso, part of the Northgate Information Solutions Group. It has an active community of around 2500 developers and end-users worldwide, ranging from consultants to large multinationals, finance institutions, tax authorities, retailers, engineering companies, media operators and software houses.\\nPROIV's usual application domain is database-centric business applications. PROIV has some similarities to languages such as ABAP, FOCUS and RPG.\\nPROIV programs consist of declarative/non-procedural specifications that control the overall structure of the program and database access and that have an implicit sequence of execution (which PROIV programmers refer to as the timing cycle). Procedural subroutines can be added by the programmer; these are written in a 3GL-like language which PROIV calls \\\"Logic\\\".\\nNote that in PROIV programs are referred to as \\\"functions\\\", which can be confusing as it differs from the more usual use of that term in programming languages.\\nPROIV was developed by Sushil K. Garg working in Hawaii in 1976 on a General Automation System. In the early 1980s it was licensed to McDonnell"],"ns:common.document.source_uri":["<http://wp/en/580197>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["PROIV"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125f5879n"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}