{"ns:m.0dsbpg6":{"ns:common.topic.description":["Rust is a general-purpose, multi-paradigm, compiled programming language developed by Mozilla Research. It is designed to be a \\\"safe, concurrent, practical language\\\", supporting pure-functional, concurrent-actor, imperative-procedural, and object-oriented styles.\\nThe language grew out of a personal project by Mozilla employee Graydon Hoare. Mozilla began sponsoring the project in 2009 and announced it for the first time in 2010. The same year, work shifted from the initial compiler to the self-hosting compiler written in Rust. Known as rustc, it successfully compiled itself in 2011. The self-hosted compiler uses LLVM as its back end.\\nThe first numbered pre-alpha release of the Rust compiler occurred in January 2012. Rust 1.0, the first stable release, was released on May 15, 2015.\\nRust is developed entirely in the open and solicits feedback and contributions from the community. The design of the language has been refined through the experiences of writing the Servo layout engine and the Rust compiler. Although its development is sponsored by Mozilla, it is a community project. A large portion of current commits are from community members."],"rdfs:label":["Rust"],"ns:common.topic.official_website":["<http://www.rust-lang.org/>"],"ns:common.topic.article":[{"ns:common.document.text":["Rust is an experimental, concurrent, multi-paradigm, compiled programming language developed by Mozilla Labs. It is designed to be practical, supporting pure-functional, concurrent-actor, imperative-procedural, and object-oriented styles.\\nThe lead developer is Graydon Hoare, who began work on the system in 2006; Mozilla became involved in 2009, and officially unveiled the language for the first time at Mozilla Summit 2010. In 2010, work shifted from the initial compiler, written in OCaml, to the self-hosted compiler written in Rust itself. It successfully compiled itself the following year. The self-hosted compiler uses LLVM as its backend.\\nVersion 0.1 of the Rust compiler was completed in January 2012. Mozilla described it as an alpha release, suitable for early adopters and language enthusiasts.\\nThe current version is Rust 0.2, released on 29 March 2012.\\nIn keeping with Mozilla policy, Rust is developed in the open, and solicits feedback and contributions from the community.\\nThe Rust wiki states: “This is alpha-level software with many known bugs, incomplete features and planned future changes. Use at your own risk, expect some instability, disruption and source-level"],"ns:common.document.source_uri":["<http://wp/en/29414838>"],"rdf:type":["ns:common.document"]}],"ns:common.topic.webpage":[{"ns:common.webpage.uri":["<http://www.rust-lang.org/>"],"rdf:type":["ns:common.webpage"],"ns:common.webpage.topic":["ns:m.0dsbpg6"]}],"ns:computer.programming_language.introduced":["2010"],"ns:type.object.name":["Rust"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1yl5l052n"],"ns:computer.programming_language.influenced":["ns:m.0swpzmh"],"ns:computer.programming_language.influenced_by":["ns:m.0pkgc"],"ns:computer.programming_language.language_paradigms":["ns:m.07phw8"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}