{"ns:m.0508gj":{"ns:common.topic.description":["C-- is a C-like programming language. Its creators, functional programming researchers Simon Peyton Jones and Norman Ramsey, designed it to be generated mainly by compilers for very high-level languages rather than written by human programmers. Unlike many other intermediate languages, its representation is plain ASCII text, not bytecode or another binary format."],"rdfs:label":["C--"],"ns:computer.programming_language.language_designers":["Simon Peyton Jones"],"ns:common.topic.article":[{"ns:common.document.text":["C-- is an intermediate language designed to be emitted by compiler. C-- is intended to play the role that is usually played by either the C programming language or machine-specific assembly language in modern compilers. The language's syntax borrows heavily from C. Hence, the name of the language employs C's unary destructive decrement operator to show that it is almost a subset of C. This is analogous to the way in which C++ is almost a superset of C.\\n\\nThe language is designed as an intermediate language to mediate between high-level compiler tools and low-level optimiser. It omits or changes standard C features such as variadic function, pointer syntax, and aspects of C's type system. These features are left out of C-- or present in modified form because they hamper certain essential features of C-- (such as tail-call optimisation) and the ease with which code-generation tools can produce it.\\n\\nC-- is a target platform for the Glasgow Haskell Compiler, and will eventually become the main platform. Some of C--'s developers, including Simon Peyton Jones, also work on GHC. The codebase and development are based at Microsoft Research in Cambridge, though it is not a Microsoft"],"ns:common.document.source_uri":["<http://wp/en/5857492>"],"rdf:type":["ns:common.document"]}],"ns:computer.programming_language.introduced":["1997"],"ns:type.object.name":["C--"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.125cng4f5"],"ns:computer.programming_language.language_paradigms":["ns:m.01c3bz"],"ns:computer.programming_language.influenced_by":["ns:m.01t6b"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}