{"ns:m.0fs0gv":{"ns:common.topic.description":["FARGO was the predecessor to the popular RPG programming language. FARGO was more of a utility program than a programming language, whereas RPG had a program generation process that produced an executable object."],"rdfs:label":["FARGO"],"key:en":["fargo_programming_language"],"ns:common.topic.article":[{"ns:common.document.text":["FARGO (Fourteen-o-one [IBM 1401] Automatic Report Generation Operation) was the predecessor to the popular RPG programming language (RPG). FARGO was more of a utility program than a programming language, whereas RPG had a program generation process that produced an executable object.\\nThe idea behind FARGO was to facilitate ease of transition for IBM 407 Accounting Machine technicians to the new IBM 1400 series of computers. The 1400 series had two assemblers; Symbolic Programming System (SPS) and Autocoder (a more advanced assembler than SPS, and that required more memory). These represented a significant paradigm shift and learning curve for the technicians who were accustomed to wiring a plugboard control panel to direct input, output, control and counter operations (add, subtract). Multiplication and division operations were possible but their practicality was limited.\\nTabulator machine operations were directed by impulses emitted in a machine cycle; hence, FARGO emulated the notion of a cycle. FARGO coordinated the concept of coding sheets that closely approximated the principles of wiring panels of tabulating machines. Early FARGO training material showed the wiring panel vs."],"ns:common.document.source_uri":["<http://wp/en/6135484>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["FARGO"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.11b7wpv4w6"],"ns:common.topic.notable_types":["ns:m.01xrl_t"],"ns:computer.programming_language.influenced":["ns:m.02yrkx"]}}