{"ns:m.0gf4q":{"ns:common.topic.description":["Abbreviated Test Language for All Systems is a MILSPEC language for automatic testing of avionics equipment. It is a high-level computer language and can be used on any computer whose supporting software can translate it into the appropriate low-level instructions."],"rdfs:label":["Abbreviated Test Language for All Systems"],"key:en":["abbreviated_test_language_for_avionics_systems"],"ns:common.topic.article":[{"ns:common.document.text":["Abbreviated Test Language for All Systems (ATLAS) is a MILSPEC language for automatic testing of avionics equipment. It is a high-level computer language and can be used on any computer whose supporting software can translate it into the appropriate low-level instructions.\\nThe ATLAS language was initially developed by an international committee made up of representatives from the airline industries, military services, avionics manufacturers, and Automatic Test Equipment manufacturers. The goal of the committee was to design a standard English-like language that could be easily understood and used by both avionics and test equipment engineers. The result was the ATLAS language specification, published by Aeronautical Radio, Inc.\\nThe ATLAS language is oriented toward the Unit Under Test and is independent of the test equipment used. This allows interchangeability of test procedures developed by different organizations, and thus reduces costly duplication of test programming effort.\\nThe first ATLAS specification developed by the international committee was published in 1968. The basic document has been revised several times.\\nThe ATLAS programming language incorporates an online"],"ns:common.document.source_uri":["<http://wp/en/60446>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Abbreviated Test Language for All Systems"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1258mf1fk"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}