{"ns:m.012s37":{"ns:common.topic.description":["Rapira is an educational procedural programming language developed in the USSR and implemented on Agat computer, PDP-11 clones and Intel-8080/Z80 clones. It was an interpreted language with dynamic type system and high level constructions. The language originally had a Russian-based set of keywords, but English and Moldovan were added later. Also, it was more elegant and easier to use than existing Pascal implementations of the time.\\nRapira was used in teaching computer programming in Soviet schools. The programming environment included a text editor and an integrated debugger.\\nSample program:\\nThe same, but using the English lexics [sic, from the article referenced below]:\\nRapira's ideology was based on such languages as POP-2 and SETL, with strong influences from ALGOL."],"rdfs:label":["Rapira"],"key:en":["rapira"],"ns:common.topic.article":[{"ns:common.document.text":["Rapira (Russian: Рапира, rapier) is an educational procedural programming language developed in the USSR and implemented on Agat computer, PDP-11 clones (Electronika, DVK, BK series) and Intel-8080/Z80 clones (Korvet). It was an interpreted language with dynamic type system and high level constructions. The language originally had a Russian-based set of keywords, but English and Moldovan were added later. Also, it was more elegant and easier to use than existing Pascal implementations of the time.\\nRapira was used in teaching computer programming in Soviet schools. The programming environment included a text editor and an integrated debugger.\\nSample program:\\nThe same, but using the English lexics [sic, from the article referenced below]:\\nRapira's ideology was based on such languages as POP-2 and SETL, with strong influences from ALGOL."],"ns:common.document.source_uri":["<http://wp/en/146951>"],"rdf:type":["ns:common.document"]}],"ns:type.object.name":["Rapira"],"rdf:type":["ns:computer.programming_language"],"ns:kg.object_profile.prominent_type":["ns:computer.programming_language"],"ns:common.topic.notable_for":["ns:g.1257hv58h"],"ns:common.topic.notable_types":["ns:m.01xrl_t"]}}